[
  {
    "title": "GlassFish - Delivering a better application server, one step at a time",
    "level": "beginner-intermediate",
    "summary": "GlassFish is a recent and active open source community which has delivered a production-ready Java EE 5 compliant application server in May 2006. Although missing clustering capabilities, this first version is used in production by several demanding web sites and applications. Grizzly (nio web framework), web services, documentation, administration, and monitoring tools are some of its key features. Also, full Java EE 5 support means you can use features such EJB 3 and JPA (Java Persistence API), the new JAX-WS 2.x Web Services stack and JSF (JavaServer Faces) 1.2 MVC framework. This session will focus on Version 2 of GlassFish (due to be released in the Fall of 2007) and will cover clustering, OpenESB (a JBI implementation) integration and the new Web Services stack called Metro (JAX-WS and WSIT, aka \"project Tango\" combined) for secure, transactionnal, asynchonous, and reliable Web Services. Performance and ease-of-use features are also key features in this release. Some of these features will be demoed during the talk including IDE integration. Open Source clearly isn't about good enough and the GlassFish community believes that there's still plenty of room for innovation at the application server level. So this session provides technical details on the preview of GlassFish v3 (modular HK2 architecture, startup time). Finally, the presentation will touch on the GlassFish community from users to partners.",
    "description": "This is a 1-hour technical overview for a developer audience which includes /several short but live demonstrations/.",
    "language": "en",
    "speakers": [
      {
        "name": "Alexis Moussine-Pouchkine",
        "biography": "Java Middleware Evangelist ( Sun Microsystems ) Alexis Moussine-Pouchkine is a GlassFish evangelist. He has 10 years of customer-facing java experience and is now the two-way link between the core GlassFish developers and the broader community which involves presenting in various conferences around the world. Alexis is an editor of \"The Aquarium\" blog (http://blogs.sun.com/theaquarium) and a reviewer and translator of various Java and XML books. Alexis lives in Paris, France."
      }
    ],
    "year": 2007
  },
  {
    "title": "JavaPosse, live!",
    "level": "beginner",
    "summary": "",
    "description": "The Java Posse is a popular weekly podcast with news and interviews related to the Java technology world. In this session, you meet the four hosts of the show as they record a situation report from the JavaZone conference.",
    "language": "en",
    "speakers": [
      {
        "name": "Tor Norbye",
        "biography": "Software Engineer ( Sun ) Tor Norbye is a senior staff engineer at Sun Microsystems where he is working on Ruby support for NetBeans. Previously, he wrote the visual webform designer in Sun Java Studio Creator and worked on AJAX JSF components. He blogs regularly at http://blogs.sun.com/tor, and is a cohost of the Java Posse."
      },
      {
        "name": "Dick Wall",
        "biography": "Evangineer ( Google ) Dick Wall has been programming computers since his first contact with one in 1983. He holds a B.Sc and M.Sc in Computer Science from the University of Kent, in the UK. He has worked for several technology companies in the intervening years, and is now a Developer Community Outreach engineer (or Evangineer) for Google, where he now works supporting developers in the community using Google products and APIs. He is also co-host of the Java Posse podcast - http://javaposse.com and the Google Developer Podcast - http://code.google.com/p/google-developer-podcast/"
      },
      {
        "name": "Carl Quinn",
        "biography": "( Google ) Carl Quinn has been developing software since the late 1970's, and working in Java since the early days of 1995. He got into building developer libraries and tools early in his career, working at Borland on their C++ IDE and OWL, and then moving on to help start the JBuilder project. Later he joined the Rave project at Sun, which became the Java Studio Creator product. In addition to being a member of the Java Posse, he is currently at Google, focusing on Java developer tools and infrastructure."
      }
    ],
    "year": 2007
  },
  {
    "title": "Hvordan lage enterprise-applikasjoner med JSE",
    "level": "intermediate",
    "summary": "Etter mange år med utvikling av enterprise-applikasjoner med JEE (Java Enterprise Edition) har utviklere blitt mer kritiske til hva man faktisk trenger av pakken. I dette foredraget vil jeg gjennomgå fordeler og ulemper med den komplette pakken man får av JEE. Jeg vil også gjennomgå hvilke krav en enterpriseapplikasjon vanligvis faktisk har. Gjennom hele foredraget vil jeg vise hvordan man kan bruke JSE og nyttige påbygg for å levere applikasjoner som oppfyller alle drifts- og forettningskrav, men som ikke går i veien for utvikleren. Jeg vil vise at ved å lage selvstendige applikasjoner som er uavhengig av en stor applikasjonstjener, kan man få et billigere produkt med færre feil. Med min erfaring som konsulent på Maven-relaterte oppgaver så har jeg sett hvilke hindringer JEE-applikasjonstjenere legger i utvikling og utrulling av ellers enkle applikasjoner. Jeg vil i dette foredraget vise en oversikt over problemene og komme med konkrete metoder man kan bruke for å lette hverdagen til utviklerene, arkitektene og drifterene.",
    "description": "Introduksjon Hvorfor er Java EE så vanskelig å bruke? Lange turer mellom skriving og kjøring av kode Utrulling og produksjonssetting, hvorfor er det så vanskelig? Miljøforskjeller mellom utviklerens maskin og miljø til produksjonsmiljøet Hvordan løser man disse problemstillingene med JEE Hvordan løser man disse problemstillingene med JSE Hvilke problemer kan Java SE ikke løse Oversikt og arkitekturer som illustrerere løsningene Bruk av embedding som et alternativ til å kjøre applikasjonene i en applikasjonstjener Oppsummering: Praktiske erfaringer ved å ikke bruke appservere Hvor passer det og hvor passer det ikke Påkrevd forkunnskap Krever kjennskap til Java SE og grunnleggende forståelse for de problemene som JEE prøver å løse. Forventede deltagere: Utviklere og arkitekter som er interessert i en enklere og mere feilfri hverdag.",
    "language": "no",
    "speakers": [
      {
        "name": "Trygve Laugstøl",
        "biography": "Utvikler og arkitekt ( Arktekk ) Trygve Laugstøl jobber i Arktekk som utvikler, arkitekt og har mange års erfaring med Java-utvikling. Han har lang erfaring med utvikling og bruk av åpen kildekode som kjerneutvikler av Maven 2 og Continuum. Trygve har jobbet lenge med utvikling av plugins som støtter opp om smidig utvikling og som rådgiver innenfor disse områdene."
      }
    ],
    "year": 2007
  },
  {
    "title": "Latest in Java Technology From Sun Microsystems",
    "level": "beginner",
    "summary": "The designated Sun Executive will deliver a keynote address illuminating key issues impacting the software industry. They will provide the vision and strategy for developers to collaborate by leveraging communities, technologies, and products in the current fast paced environment of software innovation, while highlighting key Sun technologies that facilitate this process This session will provide technically and visually compelling demonstrations that illuminate Sun's key technologies and platforms. Each demo will be displayed via rapid interaction and visual presentations that identify and highlight the Java and Solaris platforms, technologies and tools used to create build and deploy a series of impressive demos. The demos will be delivered in such a manner to show how Sun's technologies can easily be deployed using comprehensive wireless, desktop, bleeding edge and enterprise applications. The goal and objective being to show in easy rapid succession the use of Sun's technologies in innovative and progressively more challenging applied solutions.",
    "description": "The session will start with a three-dimension representation of a virtual workplace that allows remote interaction and collaboration. The second demo will use Java ME and Sun SPOTS demonstrating the ability of robots communicating and interaction in an environment . Then a visually compelling demo will incorporate several key Sun technologies that create an environment that enable various devices reacting to sensors and external stimuli.",
    "language": "en",
    "speakers": [
      {
        "name": "Simon Ritter",
        "biography": "Java Technology Evangelist ( Sun Microsystems ) Simon Ritter is a Java Technology Evangelist at Sun Microsystems. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K. Originally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon moved to Sun in 1996. At this time he started working with Java technology and has spent time working both in Java technology development and consultancy. He now specialises in looking at emerging technologies including grid computing, RFID, robotics and wireless sensor networks. Simon and his performing LEGO robots have appeared before audiences worldwide."
      },
      {
        "name": "Angela M. Caicedo",
        "biography": "Technology Evangelist ( Sun Microsystems ) Angela Caicedo is a Technology Evangelist at Sun Microsystems. Angela's expertise includes: Java ME, Java SE, Java EE, and the entire Sun Java Enterprise System. She loves spending time in new and cool technologies like: Game developments, 3D, bluetooth, smartdust (Sun' SPOTs), and others. She has also presented these topics at developer conferences around the world. Angela graduated from the University EAFIT of Medellin Colombia in 1998 with a B.S. in Computer Science. During 1996-1997 Angela was a visitor student at Center for Educational Computing Initiatives at MIT. Prior to joining Sun, Angela worked for three years as a software developer and researcher at the Swiss Federal Institute of Technology (EPFL), in Lausanne Switzerland, and participated in several European Projects. Angela has also done research on Intelligent Agents which is one of her specialties."
      }
    ],
    "year": 2007
  },
  {
    "title": "Hands-on demo of Mule ESB",
    "level": "advanced",
    "summary": "This will be a live demo of a financial services grid using GigaSpaces as the grid provider, this will be very similar to a large customer's set up (detailed above). We will put through several thousand SWIFT messages and demonstrate dynamic scalability, Spring abstraction and resilience through the grid while converting them into ISO-20022 message. If we get time we'll do a more eye-pleasing demo (using the same set up) but calculating Mandelbrot fractals. We will go on to talk about just how fast the same set up works using Azul. We will use several laptops for the demos.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "John Davies",
        "biography": "Technical Director and head of research ( IONA ) John Davies is a veteran speaker on global-scale enterprise architectures and high performance computing. John has well over 25 years in IT, mostly in investment banking, holding several global roles in the world's largest banks including Global Head of Architecture for Prime Brokerage at JP Morgan. In 2000 John co-founded a company called C24 specialising in complex integration for banking standards inclusing SWIFT, FpML and ISO-20022. C24 was sold to IONA in March 2007 where John is now Technical Director and head of research. In the early days of C24 John co-authored several enterprise Java books published by Wrox and has since authored several papers on TheServerSide and InfoQ on subjects including AMQP, Grid, HPC, XPath and JavaSpaces."
      },
      {
        "name": "Ross Mason",
        "biography": "CTO and Co-founder ( MuleSource ) Prior to founding MuleSource Ross Mason was Chief Executive Officer of SymphonySoft Limited, an EU based company that provides services and support for open source integration projects. In 2003 Ross founded Mule, the leading Java-based integration platform and Enterprise Service Bus framework. Mule is being used by top-tier financial institutions and many other high profile enterprises in Telecommunications, Retail, Insurance and Government. Previously, Mason was Lead Architect for RaboBank and played a key role in developing one of the first large-scale ESB implementations in 2002. Mason holds a B.Sc. (Hons) in Computer Science from Bristol, UK."
      }
    ],
    "year": 2007
  },
  {
    "title": "Mule 2 and Beyond",
    "level": "intermediate",
    "summary": "Mule is the leading open source ESB and integration framework. It's focus has always been on the developer with the aim of simplifying the difficult task of implementing an integration or SOA project. The focus Mule 2.0 is to make things even easier, more powerful even more robust. This talk will pivot on some of the new features of Mule. - New Xml configuration. Xml editor and developer friendly - no more class names! - The new extensible configuration model - Enhancements to the Mule runtime environment - How mule works with BPM and where BPEL fits in - OSGi support, For dynamic component loading and hot deployment - Data Streaming support Ross will also discuss the Mule roadmap for 2007/2008 including new arrivals in the Mule ecosystem and some a couple of Mule Customer case studies.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Ross Mason",
        "biography": "CTO and Co-founder ( MuleSource ) Prior to founding MuleSource Ross Mason was Chief Executive Officer of SymphonySoft Limited, an EU based company that provides services and support for open source integration projects. In 2003 Ross founded Mule, the leading Java-based integration platform and Enterprise Service Bus framework. Mule is being used by top-tier financial institutions and many other high profile enterprises in Telecommunications, Retail, Insurance and Government. Previously, Mason was Lead Architect for RaboBank and played a key role in developing one of the first large-scale ESB implementations in 2002. Mason holds a B.Sc. (Hons) in Computer Science from Bristol, UK."
      }
    ],
    "year": 2007
  },
  {
    "title": "High performance programming in Java",
    "level": "intermediate-advanced",
    "summary": "This talk will consider some challenges when implementing a high performance, server application in Java and our responses to them. While implementing the application in Java 5, we have found three major areas where libraries/JVM provided insufficient support. First: Thread control – how to make sure you application maintains control of those threads. Second – Interrupts, how to deal with them. Third: Garbage collection – how will it behave in production? We will give a compact introduction to each of the challenges before detailing our response to them. Hopefully you may be able to learn from our actions.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Hans Christian Falkenberg",
        "biography": "( Fast Search & Transfer ASA ) I work at Fast Search & Transfer ASA, where I have been employed since I completed my master in computer science at NUST (NTNU) in the complex computer systems group in 2005. Programming has been my hobby since the early 90s and I’m starting to get a grip on what it means. Recent experiences have taught me not to do multi-threaded programming. Unless really necessary. And necessary it is, so here I am doing it :)"
      }
    ],
    "year": 2007
  },
  {
    "title": "Domain driven pointcut design",
    "level": "intermediate",
    "summary": "AOP has become a buzzword that almost every Java developer have heard. Netherless, AOP is still an exotic technology that is not the first thing that comes to a mind for most people when a trying to solve new tasks. The main reason for that is that many developers find it difficult to think in terms of AOP and AOP is mainly associated with logging, tracing, caching, and other trivial crosscutting concerns. As I will show AOP can be used for much more interesting things. This presentation summarizes ideas from several articles and blogs written by some of the most influential AOP gurus and presents examples inspired by real projects. Following topics will be covered: What are the most common problems of software projects using AOP? AOP \\!= obliviousness AOP and DDD Applying OOP design principles to AOP Examples",
    "description": "Introducing AOP Raising application abstraction level with AOP AOSD paradox and solution to it AOP and DDD types of pointcuts concern semantics mismatch pointcut design guidelines AOP-aware interfaces AOP-aware interfaces vs conventional OOP interfaces Problems of common domain model for different application layers Several examples summary Language: Norsk Level: Intermediate Required experience: Noe forkunnskap om AOP and enterprise Java applikasjoner Expected audience: Utviklere og arkitekter som er interessert i AOP, og som ønsker å lære mer om effektiv bruk av AOP i enterprise applikasjoner.",
    "language": "no",
    "speakers": [
      {
        "name": "Sergei Savenko",
        "biography": "Senior consultant ( Objectware ) Sergei Savenko is working as a senior consultant at Objectware. He has been working with Java for the last 7 years. He is interested in lightweight architecture frameworks, AOP, and Domain Driven Design."
      }
    ],
    "year": 2007
  },
  {
    "title": "Getting the most out of garbage collection",
    "level": "intermediate",
    "summary": "Garbage collection is an invisible but extremely helpful part of the Java language. Investing a bit of effort in understanding garbage collection can yield big benefits in terms of application throughput and responsiveness, but care must be taken. It is common to try and improve application responsiveness by tuning the garbage collector to shorten garbage collection pauses. However, short pauses alone do not guarantee good application response times. Judging whether an application is performing well or poorly on the basis of pause times alone is dangerous, because big pause times often go along with great application performance. Even the total amount of time spent paused for garbage collection is not a good predictor of the impact of garbage collection on application performance. Although garbage collection is often treated as a performance cost, garbage collection can actually outperform manual memory management. Verbose garbage collection logs contain lots of information but it's not always obvious what it means or how to use it. Verbose gc can guide gc tuning decisions and also give insight into application behaviour. Verbose gc can help diagnose application response time problems, detect memory leaks and spotlight pathological patterns of object creation. I will demonstrate using verbose gc analysis tools to quickly find memory leaks, choose the best heap size, and choose the garbage collection policy which makes an application go fastest.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Dr Holly Cummins",
        "biography": "Tooling developer ( IBM ) Holly is a tooling developer within the IBM Java Technology Centre. She develops garbage collection analysis tools, building on her experience working as a performance engineer within the garbage collection development team. Holly has been with IBM for five years. Before joining IBM she completed a doctorate in quantum computation at the University of Oxford."
      }
    ],
    "year": 2007
  },
  {
    "title": "Ruby Tooling, State of The Art",
    "level": "intermediate",
    "summary": "Java integrated development environments (IDEs) have offered unparalleled productivity tools for developers. Refactoring, code completion, and static code analysis are all made possible by the Java programming language's static typing system. Dynamic languages, on the other hand, have traditionally left much to be desired in the tools department. Their proponents have argued that tools are not as necessary, because there is less code to write, and that unit tests can replace static checking. With dynamic languages such as Ruby being hosted on the Java platform, new efforts have been made to bring the features of Java IDEs to the dynamic language world. The results are promising: as a dynamic language developer, you can have your cake and eat it too. This technical session covers recent developments for Ruby in the NetBeans IDE and discusses future directions for research in this area, such as direct and statistical type inference, wide-ranging refactoring support, more-accurate code completion, and multilanguage editing and debugging.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Tor Norbye",
        "biography": "Software Engineer ( Sun ) Tor Norbye is a senior staff engineer at Sun Microsystems where he is working on Ruby support for NetBeans. Previously, he wrote the visual webform designer in Sun Java Studio Creator and worked on AJAX JSF components. He blogs regularly at http://blogs.sun.com/tor, and is a cohost of the Java Posse."
      }
    ],
    "year": 2007
  },
  {
    "title": "Developing Rich Desktop Applications using Qt Jambi",
    "level": "beginner",
    "summary": "In this session we intend to demonstrate to the audience, using source code examples and live demos, how it is possible to develop rich, snappy, native-looking, desktop applications using the framework Qt Jambi. Qt Jambi is the Java version of the popular Qt C++ cross-platform framework, opening a world of possibilities for Java and C++ programmers alike. It is an officially supported technology aimed at Java programmers who want to create great-looking GUI applications using a first-rate GUI framework. The Qt C++ framework has been at the heart of commercial applications since 1995. Qt is used by companies and organizations as diverse as Adobe®, Boeing®, IBM®, Motorola®, NASA, Skype®, and by numerous smaller companies and organizations. Qt's classes are fully featured and provide consistent interfaces to assist learning, reduce developer workload, and increase programmer productivity. Qt also has a long history in the Open Source community, among other things as the foundation of the K Desktop Environment (KDE). In our presentation we will demonstrate Qt Designer by example and at the same time introduce Qt Jambi's signal and slot mechanism, layout management, and Qt Jambi's ability to customize user interface look using cascading stylesheets (CSS). We will also demonstrate some of basic of Qt's model view framework. Qt Designer is a WYSIWYG tool for graphically designing user interfaces. Qt Designer can be used purely for GUI design, or to create entire applications with its support for integration with popular integrated development environments (IDEs), like Eclipse. Using Qt Designer for our examples, we will see how Qt Jambi's layout management and signals and slots works. Signals and Slots are Qt Jambi's object communication mechanism, gluing components together in a simpler manner than traditional listener interfaces. Attendees to this presentation are expected to gain insight a new way of developing desktop applications using Java. Expected requirements from the audience is a basic knowledge of the Java Programming Language and GUI development.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Gunnar Sletta",
        "biography": "Senior Developer ( Trolltech ASA ) Education: Cand. Scient. from the University of Oslo, specializing in Scientific Computing and Visualization. Current employment: Gunnar Sletta is a senior developer at Trolltech ASA in Oslo, Norway. He has worked for the company for almost 5 years and has worked in a number of areas. His initial work was on Qt's scripting support, an ECMAScript based interpreter based on the KDE project KJS. After that he was a major player in the design and implementation of Qt's 2D graphics subsystem. Recently he has been the lead developer on the Qt Jambi project. Gunnar Sletta is an experienced presenter and has held presentations on multiple occasions for larger audiences. Java background: In addition to his experience from leading the Qt Jambi development, he worked as a professional java developer for several years."
      }
    ],
    "year": 2007
  },
  {
    "title": "Building Buzzword-compliant Mashups using Mule,",
    "level": "intermediate",
    "summary": "The talk is about how an ESB, and Mule in particular, can be utilized to create Mashups. Mashups and ESBs serve as catalysts for learning new technologies and thus stay in touch with the latest buzzwords (if that it a personal goal). The notion of Mashups fuels creative ideas and an ESB like Mule makes it easy to realize them. This talk promotes the idea that Mashups and Mule is a perfect match for learning the new techonologies. GeoMail is used throughout the talk and serves as an example that illustrates the road from an idea to a final Mashup. GeoMail retrieves the IP address of the originating sender of your incoming e-mails, resolves a geographic location from that IP-address using a public Web Service and plots the locations asynchrounously om GoogleMaps using a custom Mule Ajax Transport. The result is a live view of how widespread your mailinglist is or how international your contact list is. This talk will present how GeoMail is created and the choices that were made in order to stay buzzword-compliant.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Rune Peter Bjørnstad",
        "biography": "Konsulent ( Bouvet ) Currently works as a consultant for Bouvet AS with Java experience since 1999. Primary fields of interests are systems integration and Web development. A board member for the Norwegian Java User Group (javaBin), author of integration related articles and a presenter."
      }
    ],
    "year": 2007
  },
  {
    "title": "Quick and Easy Profiling with Integrated Tools",
    "level": "intermediate",
    "summary": "Have you ever struggled to figure out why some part of your application runs slowly? Have you ever seen hard-to-reproduce OutOfMemoryErrors that shut down your application? What do you need to make profiling of a Java application easy? The answer is simple: powerful tools that are well integrated into your development environment. Recent advances in the JDK software have increased the power and flexibility of profiling tools for the Java platform. Further advances in integrated development environments (IDEs) have made profiling tools even easier and more convenient to use. Finding performance problems, threading issues, and memory leaks has never been easier. This session focuses on specific advances in the integration of powerful profiling tools into the NetBeans IDE and includes demonstrations that show specific use cases.",
    "description": "Outline 1. What sorts of problems can an integrated profiler help you solve? 2. The state of the art today: NetBeans Profiler version 5.5.1 3. Case Study: A memory leak in HttpUnit. 4. Upcoming enhancements to make things even easier: A preview of NetBeans Profiler 6.0. 5. Case Study: JRoller performance problems. Required experience Attendees are expected to understand the basics of performance and memory usage problems in Java applications. Expected audience Anyone who has experience with or wants to learn more about tracking down performance bottlenecks and memory leaks in Java applications.",
    "language": "en",
    "speakers": [
      {
        "name": "Gregg Sporar",
        "biography": "( Sun Microsystems ) Gregg Sporar has been a software developer for over twenty years, working on projects ranging from control software for a burglar alarm to 3D graphical user interfaces. He has been using Java since 1998 and his interests include user interfaces, development tools, and performance profiling. He works for Sun Microsystems as a Technical Evangelist on the NetBeans project.  He has done presentations at JavaOne, JavaZone, Sun Tech Days, and at Java User Group meetings."
      },
      {
        "name": "Jaroslav Bachorik",
        "biography": "( Sun Microsystems ) Jaroslav Bachorik has been in software development since 1998 and participating on various projects ranging from Business Intelligence and reporting through Document Management System implementations to enterprise Java applications. He is interested in Object Oriented design, design patterns, and their application in extreme programming (XP) environments. He joined the NetBeans Profiler team in early 2006 and is responsible mainly for Java EE related features. He did a technical demo of the NetBeans Profiler at NetBeans Day Prague 2006."
      },
      {
        "name": "Jiri Sedlacek",
        "biography": "( Sun Microsystems ) Jiri Sedlacek joined the NetBeans Profiler project as a developer in 2004 after finishing his university studies. He primarily works on integrating the tools provided by the NetBeans Profiler into the NetBeans IDE. He is responsible for NetBeans Profiler user interface and usability design decisions. His presentation experience includes an in-depth session on the NetBeans Profiler at NetBeans Day Prague in 2006."
      }
    ],
    "year": 2007
  },
  {
    "title": "Using Spring-OSGi in Swing applications",
    "level": "beginner",
    "summary": "OSGi is a mature and powerful dynamic module system for Java which recently has gained a lot of interest in the Java community. OSGi offers real modularization within a Java Virtual Machine, including dynamic updates of modules (or “bundles” in OSGi jargon), as well as a service oriented API for communication between the modules. A well known example of a rich client application based on OSGi is the Eclipse IDE. The Spring-OSGi project aims to make it easy to build Spring applications that run in an OSGi framework. Spring-OSGi achieves this by letting services, used for inter-bundle communication, be exported and referenced with methods familiar to Spring developers. This talk gives a brief introduction to OSGi and then continues on to show how Spring-OSGi may be used in order to modularize a rich client application written in Swing. The talk will include lessons learned from OSGi development, and solutions to problems typically encountered. The presentation will also show some practical steps you will need to go through in order to start using Spring-OSGi.",
    "description": "- Introduction to OSGi and Spring-OSGi (10 minutes) - Modularizing a Swing application using Spring-OSGi (30 minutes) - Lessons learned (10 minutes) - Q & A (10 minutes) Required Experience: Knowledge of J2SE, class loaders, Swing, the Spring container Expected Audience: Anyone considering OSGi as a platform for rich client development. Attendees will learn what OSGi is and how it may be applied in such a scenario.",
    "language": "en",
    "speakers": [
      {
        "name": "Nils Hofseth Andersen",
        "biography": "Senior Consultant ( Capgemini Norway ) Nils Hofseth Andersen is a Senior Consultant in Capgemini Norway, with 8 years experience working as Java developer and solution architect, mainly within the Oil & Gas industry."
      }
    ],
    "year": 2007
  },
  {
    "title": "The Hundred Kilobytes Kernel (HK2)",
    "level": "intermediate",
    "summary": "The java.net project \"Hundred Kilobytes Kernel\" (HK2) is a module subsystem coupled with a simple yet powerful component model to build software. It is a great technology to use in any Java software development and can be used in small devices such as phones up to enterprise applications. HK2 is designed to be friendly to existing technologies such as OSGi but it will also provide a path to the implementation of modules (JSR 277) in Java SE 7. HK2 is used as the foundation for GlassFish V3.",
    "description": "Outline Introduction to component models, 2 min o OSGi o JSR 277 HK2 overview o Modules, 20 min + Modules - Module definition - Module packaging + The module subsystem - Instances - Unloading - Modules and classloaders + Repository + Registry o Components, 20 min + Services - The build system - Runtime - Instantiation - Life Cycle + Inversion of Control - Injection - Extraction - Instantiation cascading Live demonstration, 5 min How HK2 is used in GlassFish V3, 5 min Q & A, 10 min Required experience None Expected audience Architects and developers",
    "language": "en",
    "speakers": [
      {
        "name": "Rikard Thulin",
        "biography": "Senior Software Engineer ( IBS JavaSolutions ) Rikard Thulin is a Senior Software Engineer at IBS JavaSolutions. Rikard is one of the lead persons for the Java User Group in Gotenburg, JavaFroum. In a previous life, Rikard worked as a Java Architect at Sun Microsystems. Rikard holds a M.S. in Software Engineering. Previous presentations: JavaZone 2006, http://www2.java.no/web/show.do?page=92&articleid=4559 JavaForum in Stockholm and Gothenburg, several talks the last couple of years. More information about Javaforum can be found here: http:///javaforum.se Sun Engineering Conference 2005, Santa Clara, USA"
      },
      {
        "name": "Ferid Sabanovic",
        "biography": "Consultant ( IBS JavaSolutions ) Ferid Sabanovic is a consultant at IBS JavaSolutions. His interests include J2EE and other similar object oriented technologies like .NET. Ferid is actively involved in the Swedish Java User Group Javaforum. Ferid holds a B.Sc degree in Informatics"
      }
    ],
    "year": 2007
  },
  {
    "title": "Enterprise Comet - No Plugins, No Polling, No Pain!",
    "level": "beginner",
    "summary": "There is a common misconception among many end-users, consumers, and developers that Ajax is the ultimate solution for the Web, and that it can provide all the same functionality as a rich desktop solution. Sure, Ajax can cover most of our expectations for a rich client, mimicking functionality provided by a desktop application, but there is still one area that has yet to be fully integrated - scalable server-initiated message delivery - Enterprise Comet. Comet is an advanced technique to enable real-time messaging from a Web server to one or more browsers, even if some of those browsers are behind a firewall or proxy server. Imagine being able to monitor any real-time data source from server statistics to your favorite stock portfolio, directly from your Web browser with no polling, no plugins and no pain! Grizzly enhances the Glassfish project with Comet support via Asynchronous Request Processing (ARP), addressing any server-side scalability concerns with Comet. The Dojo organization provides the Bayeux Protocol, used to coordinate shared access to the Comet notification channel coming from the server.",
    "description": "In this talk the presenters will discuss scalability, security, and performance implementing support for Enterprise Comet using GWT, Bayeux, Comet, and Grizzly.",
    "language": "en",
    "speakers": [
      {
        "name": "Jonas Jacobi",
        "biography": "VP of Product Management ( Kaazing Corporation ) Jonas Jacobi recently worked as VP of Product Management responsible for the product management and marketing strategy for Brane Corporation, a startup company in Silicon Valley. A native of Sweden, Jonas has worked in the software industry for more than fifteen years. Prior to his appointment as vice president for Brane, he worked 8 years for Oracle as a Java EE and open source Evangelist, and product manager responsible for the product management of JavaServer Faces, Oracle ADF Faces, and Oracle ADF Faces Rich Client in the Oracle JDeveloper team. He is a popular speaker at international conferences and has written numerous articles for leading IT magazines such as Java Developer's Journal, JavaPro, AjaxWorld, and Oracle Magazine. Jonas is co-author of the recently published book Pro JSF and Ajax: Building Rich Internet Components, (Apress). As co-founder of Kaazing Corporation, Jonas sets the company's product management and business strategy and oversees all aspects of Kaazing's operations and missions to become the world-wide leader in real-time software."
      },
      {
        "name": "John Fallows",
        "biography": "( Kaazing Corporation ) John Fallows is a pioneer in the field of rich and highly interactive user interfaces and co-founder of Kaazing Corporation. He recently worked as Architect at Brane Corporation, a startup company based in Redwood City, California. Originally from Norther Ireland, John graduated from Cambridge University in the United Kingdom and has worked in the software industry for more than ten years. Prior to joining Brane, John was a Consulting Member of Technical Staff for Server Technologies at Oracle Corporation. During his last 5 years at Oracle, John focused on designing, developing, and evolving Oracle ADF Faces to fully integrate Ajax technologies. John is a popular speaker at international conferences and has written numerous articles for leading IT magazines such as Java Developer's Journal, AjaxWorld Magazine, and JavaMagazine (DE). John is co-author of the recently published book Pro JSF and Ajax: Building Rich Internet Components, (Apress). John formulates Kaazing Corporation's vision of creating the most simplest realtime framework based on the Java standard. He defines the architecture of the Kaazing product suite and oversees its development.."
      }
    ],
    "year": 2007
  },
  {
    "title": "Java Grid Computing with AOP",
    "level": "advanced",
    "summary": "The topic of this presentation is about innovative use of AOP in open-source Java grid computing framework that is trying to change the grid computing landscape in much the same way as Spring or JBoss have changed JEE landscape in the last couple of year – removing complexity, clutter and over-engineering of traditional computational grid solutions. The presentation will concentrate around live demonstration of writing a simple application like a HelloWorld and grid enabling it to run on a small grid right in front of the audience and with audience participation. Demonstration will be performed on Windows XP using Eclipse 3.2, Java 5 and GridGain framework (LGPL open-source Java grid computing framework available at www.gridgain.org). CDs will be made available before and during presentation for anybody who would like to become a part of ad-hoc grid during demonstration (simple 1-minute installation for Windows XP/Vista or Linux is required). All coding during demonstration will be done live. Detailed and in-depth explanations will highlight that grid computing in Java can be fun, simple and productive to use in everyday applications and systems. Special attention will be paid to the fact that grid computing can be used by businesses of any size: small, medium or large. Real-life examples will be discussed. Technical content of the presentation will focus on how AOP is used in this example to achieve transparent grid-enabling or grid-enabling without even touching a source code. It will also discuss during live demonstration some of the innovative features of GridGain such as peer-to-peer deployment and hot re-deployment, resource injection, unique support for split/aggregation and Spring/JBoss integration.",
    "description": "It’s important to note that 1/2 (30 minutes) of the entire presentation will be devoted to a live coding demonstration and slides only support introduction and conclusion parts of the presentation. Introduction o Nikita Ivanov o GridGain, www.gridgain.org o Live demonstration Why is Grid Computing? o Grid computing o Huge potential o However, compute grids today are o Leading to Why Java? Why AOP? o Grid enabling Java application = grid enabling a Java method call o Grid enabling is a cross-cutting concern o Transparent grid enabling o AOP in GridGain Live Demo o Windows XP, Eclipse 3.2, Java 5, GridGain 1.0 o Join the grid (DVDs are available) – Win32/Linux/Mac OS X are welcome! o We will take simple HelloWorld Java app o We will grid enable it using GridGain o We will run this example on the grid right from the Eclipse Conclusion o Grid app in less than 30 minutes from scratch o Transparent grid enabling o Transparent deployment o Grid logic is separated from business logic o Fun, simple and productive :-) Required Experience: Java 5 Basics of AOP Expected Audience: Audience is expected to include developers, architects and technical managers who are interested in grid computing technology that breaks away from traditional mold and makes Java grid computing fun, simple and productive to use. We are expecting this talk to be really interesting and popular among he attendees as it includes a live end-to-end demonstration of something that not so long ago would require weeks and months of just configuration and was part of only privileged projects in the government research and large corporate sectors.",
    "language": "en",
    "speakers": [
      {
        "name": "Nikita Ivanov",
        "biography": "Mr. Ivanov has over 15 years of experience in software development and over 7 years of developing grid computing and distributed middleware, a vision and pragmatic view of where development technology is going, and high quality standards in software engineering. Prior the founding of the GridGain project Mr. Ivanov built and led R&D organization at Fitech Laboratories, Inc. that developed innovative grid computing and distributed caching middleware products. Back in 1996, Mr. Ivanov was one of the pioneers in using Java technology for server side middleware development while working at T-Systems GmbH, one of the largest European System Integrator. Mr. Ivanov has held various positions architecting and leading software product development for start-up companies and working with well-established companies such as Adaptec, Visa and BEA Systems. Mr. Ivanov is an active member of Java middleware community and is a contributor to Java specifications as a member of JSR-107. Mr. Ivanov holds a Master's degree in Electro Mechanics from Baltic State Technical University, Saint Petersburg, Russia."
      }
    ],
    "year": 2007
  },
  {
    "title": "The Sun JVM Inside and Out: Tuning for Performance",
    "level": "intermediate-advanced",
    "summary": "Java SE 6 now has over four hundred command line options that can be specified for the Sun JVM. Understanding what these options are and how they affect the performance of an application is a daunting prospect. This session will look at the major areas of tuning for the Sun JVM: garbage collection, thread synchronisation and bytecode interpretation. We'll look at how the JVM works internally, and the affect that changing various parameters can have on the JVM and, consequently how this will impact your applications performance. We'll also briefly look at freely available tools that can be used to monitor and profile an application giving you greater insight into the things that can be changed to improve performance.",
    "description": "Expected audience: developers",
    "language": "en",
    "speakers": [
      {
        "name": "Simon Ritter",
        "biography": "Java Technology Evangelist ( Sun Microsystems ) Simon Ritter is a Java Technology Evangelist at Sun Microsystems. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K. Originally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon moved to Sun in 1996. At this time he started working with Java technology and has spent time working both in Java technology development and consultancy. He now specialises in looking at emerging technologies including grid computing, RFID, robotics and wireless sensor networks. Simon and his performing LEGO robots have appeared before audiences worldwide."
      }
    ],
    "year": 2007
  },
  {
    "title": "Write Better Code, Faster, with Java Generics",
    "level": "intermediate",
    "summary": "Generics are the largest and most important change to the Java programming language since it was introduced. Although the fundamentals of generics are easy to absorb, misunderstandings persist and common use-cases are not well understood. For example, what is “migration compatibility,” and why is it central to the design of generics? What strategies do you have for migrating an existing library? What pitfalls need to be avoided when combining generics and arrays? What do wildcards really represent, and how should you use them? This session will use the ideas underlying generics to answer these and other common questions.",
    "description": "• Motivation for generics (5) o Cleaner code, stronger compile-time typing, more expressive interfaces Benefits of implementation by erasure: migration compatibility (15) o Migration strategies: surface generification, stubs, wrappers Problems with erasure (15) o Array typing vs generic typing, converting a collection to an array o Principle of Truth in Advertising , Principle of Indecent Exposure Wildcard types: what they are and how to use them (10) What next for generics? (5) Experience: Participants should be familiar with the basic ideas of generics Audience: Practising programmers working or soon to work with Java 5 or Java 6",
    "language": "en",
    "speakers": [
      {
        "name": "Maurice Naftalin",
        "biography": "( Morningside Light Ltd ) Maurice Naftalin is Technical Director at Morningside Light Ltd, a software consultancy in the UK. As an academic, he published or presented fifteen papers in the area of formal specification and refinement of programs. Amongst his commercial roles he has most recently served as an architect and mentor at NSB Retail Systems plc, and as the leader of the client development team of a major UK government social service system. He has extensive experience both as a university teacher and as a commercial trainer in Java and Object- Oriented technologies, for Sun and Learning Tree amongst others. He is co-author of 'Java Generics and Collections' (O'Reilly, 2006)"
      }
    ],
    "year": 2007
  },
  {
    "title": "Yes, but is it fast enough? Performance testing with JMeter",
    "level": "intermediate",
    "summary": "Many modern systems are riddled with performance issues. Proper performance testing helps ensure that problems with responsiveness and throughput are detected and corrected during development, before the system goes live. The presentation gives a practical overview of performance testing in an enterprise setting, and demonstrates how to utilize the popular open source tool JMeter for performance testing. The presentation also outlines some tactics on how to handle performance problems if they are found.",
    "description": "Background, speaker presentation (3 min) Definition of performance testing (3 min) Preparing for performance testing (8 min) Running the performance test (5 min) Tactics for handling performance problems (5 min) JMeter overview (3 min) Demo: Testing web applications with JMeter (5 min) Demo: Recording and parametrizing test scripts with JMeter (5 min) Demo: Distributed performance testing with JMeter (5 min) Demo: Testing web services with JMeter (5 min) Alternatives to JMeter (2 min) References (2 min) Questions and answers (10 min) Required experience: Participants should have some experience developing web applications or other enterprise systems with Java technology. Parts of the presentation are technology agnostic, and should be of interest to developers using other languages as well. Expected audience: Software architects, developers, and QA testers concerned about performance in enterprise systems.",
    "language": "en",
    "speakers": [
      {
        "name": "Markus Krüger",
        "biography": "( ErgoGroup ) Markus Krüger works as a systems consulent developing enterprise systems in Java at ErgoGroup AS, one of the largest Norwegian software companies offering operations, solutions and consultancy services. He is part of the company's Java technology group. Markus has 8 years experience in the software industry, working with various technologies and environments, including J2EE/JEE the last 5 years. Other experiences includes work on search engine technology at FAST, browser video plugins at GridMedia, and e-mail security and notary services at eNotarius. He has previously held talks, both internally and to open audiences, on various subjects such as CVS, Hibernate, and performance testing. The current presentation is based on internal talks and workshops at ErgoGroup."
      }
    ],
    "year": 2007
  },
  {
    "title": "Test'N'Groove: a breath of fresh air to your tests",
    "level": "intermediate-advanced",
    "summary": "Code testability has become the norm these days. Unit testing represents a good start towards testability, but sooner or later you will find out that more is needed. Test'N'Groove represents the happy marriage of the tools that will allow you to write more than unit tests and build trust in your code by creating functional, integration and even stress tests.",
    "description": "The session will walk you from the TestNG basics towards those most appreciated advanced features. Test'N'Groove through its Groovy nature will bring a breath of fresh air to your tests. Requirements: basic Groovy knowledge, Java knowledge",
    "language": "en",
    "speakers": [
      {
        "name": "Alexandru Popescu",
        "biography": "Alexandru is involved in many open source initiatives and bleeding-edge technologies (AOP, testing, web, etc.), being co-founder of the TestNG Framework and a committer on the Groovy, WebWork and Magnolia projects. Alexandru formerly was one of three committers on the AspectWerkz project before it merged with AspectJ. Alexandru is also the architect and co-founder of InfoQ.com."
      }
    ],
    "year": 2007
  },
  {
    "title": "Using jMaki With Server Side Frameworks",
    "level": "intermediate",
    "summary": "The jMaki framework is a client side JavaScript library that abstracts away the complexities of using various client side JavaScript widgets for Ajax and DHTML behaviors. It supports server side authoring in a variety of languages (including Java, PHP, Ruby, and server side JavaScript) and frameworks. Also available is optional tools support for NetBeans and Eclipse. This session will introduce jMaki to application developers, and demonstrate using jMaki to help you build the front end UI for your application, using a variety of technologies on the back end.",
    "description": "(1) Introduction (1.1) Setting the context (1-2 slides establishing how jMaki fits in to the Web 2.0 / Next Generation Web) (2) The Zen of jMaki (2.1) Overview (2.2) Key Features (2.3) Client Side Capabilities (2.4) Server Side Integration (2.5) The jMaki Value Proposition (3) Using jMaki With Server Side Languages (3.1) Brief demos of jMaki with server side PHP, Ruby, and Server Side Javascript (4) Using jMaki With Java Based Web Technologies (4.1) Using jMaki with JavaServer Faces (including Shale and Seam) (4.2) Using jMaki with Struts (version 1 and version 2) (4.3) Using jMaki with Other Frameworks (precise list TBD) (5) Summary Expected Audience: Attendees should have working knowledge of Java web technologies (including at least one server side web framework), a basic knowledge of client side JavaScript programming, and a basic understanding of how Ajax asynchronous interactions work. Attendees will leave with an understanding of how to use jMaki to simplify their client side UI development practices (no matter what server side technology they are comfortable with), and to expand the number of widget libraries that may comfortably used together, without having to learn new APIs and paradigms for each individual library.",
    "language": "en",
    "speakers": [
      {
        "name": "Craig R. McClanahan",
        "biography": "Senior Staff Engineer ( Sun Microsystems ) Craig R. McClanahan is the Web 2.0 Architect for Java Tools at Sun Microsystems, responsible for directing the development of tooling support for next generation web technologies. Previously, he was architect for Sun Java Studio Creator and the NetBeans Visual Web Pack, focused on visual development using JavaServer Faces components. Craig was also co-specification lead of the JavaServer Faces 1.0 specification (JSR-127), and the original creator of the Apache Struts and Apache Shale web application frameworks."
      }
    ],
    "year": 2007
  },
  {
    "title": "Aspect Oriented SOA: Injecting Aspects into Composite Applications using OpenESB",
    "level": "intermediate",
    "summary": "One of the design patterns of SOA is to move control flow to an orchestration component which connects multiple reusable services into a composite application. The result in practice is that these orchestrations, often bpel processes, tend to be a mixture of business services which offer well-defined business value, and technical services which offer technical capabilities which are always required in IT solutions – for instance authorisation, logging, etc. What is required is an aspect-oriented approach where these technical services can be injected into a composite application. This allows a business process to concentrate on business functionality, remain understandable to business analysts, and most importantly, allow different aspects to be injected within a business process thereby removing the need need to have multiple versions of the same process depending on the governance contract it is expected to meet. This talk discusses and demonstrates how an aspect-oriented approach can be implemented for composite applications which are developed and deployed to OpenESB. OpenESB is an open source, ESB implementation based on the Java Business Integration (JBI) standard. It will show two design patterns for injecting patterns into composite applications. The Facade pattern allows the user to apply a chain of aspects that serve as a façade to a deployed provisioning service. The Weaving pattern allows the user to weave an existing application with chains of aspects between services within a Composite Application. OpenESB supports different types of aspects: - Technical aspects. For instance, authentication, authorisation, and caching. - Aspects which enforce enterprise integration patterns. For instance, scatter-gatherer, queueing, auto-reconnect, and prioritisaton. - Business aspects. For instance, chargeback, audit trail, and lease management. Finally the presentation looks at how version 2.0 of JBI will include standards support for service invocation interception and policy enforcement for improve aspect orientation",
    "description": "- SOA and Composite Applications: - Patterns for injecting aspects into a Composite Application - Aspects that can be injected into composite applications - Demo + Show how to implement Caching, Data Transformations using the Gateway approach + Show how to implement Caching, Data Transformations using the Weaving approach. - Improvements to version 2.0 of the Java -Business Integration standard for supporting Aspect-Oriented Composite Applications - Summary",
    "language": "en",
    "speakers": [
      {
        "name": "Jason Baragry",
        "biography": "Solution Architect ( Sun ) Jason Baragry is a Solution Architect with Sun Microsystems in Norway. He has a PhD in software engineering and 15 years of software architecture experience in pure research, applied research, and commercial projects."
      }
    ],
    "year": 2007
  },
  {
    "title": "Contract-Aware Web Service Development",
    "level": "beginner-intermediate",
    "summary": "Web service developers have generally been limited to two different development models, each with its own advantages and disadvantages. The \"code-first\" model provides a familiar environment and a flexible development process, but has historically suffered from impaired interoperability. The \"contract-first\" development model allows for elevated interoperability, but at the cost of a high entry barrier, a steep learning curve, and a heavy development process. In an effort to leverage the best of both worlds, Web service developers are increasingly adopting a \"code-first, contract-aware\" approach. The proposed presentation will attempt to sort out the complex issues that surface when establishing a flexible, reliable development model for interoperable Web services. The Enunciate project will be introduced as a possible solution to contract-aware Web service development. A concrete demonstration of contract-aware Web service development will be provided using Enunciate. A rich set of services and domain objects will be published as a fully-documented, interoperable web application that exposes its service endpoints via SOAP, REST-XML, and JSON. Client code for multiple platforms will also be generated and exercised to demonstrate the powerful interoperability features of the deployed application. The application will be much more than a simple \"Hello, World\" service, sporting complex objects, one-way operations, and MTOM binary attachments.",
    "description": "Web service development models Code-first development, advantages and disadvantages. Contract-first development, advantages and disadvantages. The best of both worlds: code-first, contract-aware. Enunciate and its \"compiled contract\" philosophy. Enunciate's features and goals. Compiled-contract development. Demo: Publishing Your Web Service API with Enunciate Q&A /ul>",
    "language": "en",
    "speakers": [
      {
        "name": "Ryan Heaton",
        "biography": "Senior software engineer ( FamilySearch.org ) Ryan Heaton is a senior software engineer for FamilySearch.org.  Ryan specializes in the design and development of Web services, particularly for the Java platform.  He actively contributes to the effort of making Web services easy to develop and publish while maintaining an acceptable level of interoperability.  As part of his contribution to this end, Ryan engineered Enunciate, a Web service deployment framework.  Ryan is the father of four boys and currently resides in Salt Lake City."
      }
    ],
    "year": 2007
  },
  {
    "title": "Improving test maintainability",
    "level": "intermediate",
    "summary": "The benefits of automated testing are many, and a lot of programmers and teams are doing test-driven development and extensive automated testing. Yet many struggle with maintaining their test suite, and end up in situations where every little change to the code breaks some tests. Often it is not clear why the change causes the tests to break, thus requiring the programmers to spend an annoying amount of time working out whether the tests are failing for a good reason or not. This talk looks into the issue by identifying a number of test smells that contribute to this problem, and suggests some patterns and strategies that will improve the current state of practise.",
    "description": " ",
    "language": "en",
    "speakers": [
      {
        "name": "Nils Christian Haugen",
        "biography": "CTO ( Objectnet ) Nils Christian Haugen is the CTO of Objectnet and an agile developer and coach. He has been working with large distributed object-oriented applications for companies in various industries since 1998. Nils Christian has enjoyed working with XP/Agile teams at ThoughtWorks, and is an experienced speaker on topics in Java and Agile software development at national and international conferences. He holds an MSc degree in computer science from the Norwegian University of Science and Technology."
      }
    ],
    "year": 2007
  },
  {
    "title": "Bringing Life to Swing Desktop Applications",
    "level": "intermediate",
    "summary": "This session discusses advanced painting techniques in Swing that make it possible to implement many neat effects, including translucency, nonrectangular components, overlay and transition animation effects, and many more.",
    "description": "- Advanced effects - Custom components - Playing with opacity - Custom RepaintManager - GlassPane - Layering in UI delegates - Rainbow demo - Q&A Required experience: Basic knowledge of the Swing library is required Expected audience This presentation will be interesting for active Swing users as well as for people who want to discover Swing capabilities",
    "language": "en",
    "speakers": [
      {
        "name": "Alexander Potochkin",
        "biography": "( Sun Microsystems ) I am a member of the Swing team in Sun microsystems I've been working with graphical interfaces more than 5 years Currently I am maintaining and improving the Swing library Please check out my blog: http://weblogs.java.net/blog/alexfromsun/ and the SwingHelper project https://swinghelper.dev.java.net/"
      }
    ],
    "year": 2007
  },
  {
    "title": "The Top 10 Ways to Botch Enterprise Java Application Scalability and Reliability",
    "level": "intermediate-advanced",
    "summary": "This follow-on to last year's JavaOne sleeper hit \"The Top 10 Ways to Botch an Enterprise Java Technology-Based Application\" explores best practices for protecting against scalability and reliability in Java Enterprise Edition applications and compute grid environments. Starting with simple abuses of messaging and clustering technologies, this presentation navigates a wide swath of options available to enterprising architects seeking to limit the effectiveness of scale-out environments. After last year's presentation, we were disappointed that some attendees mistakenly used this information to avoid pitfalls, errors, and other common causes of project failure. We hope for better results this year.",
    "description": "   ",
    "language": "en",
    "speakers": [
      {
        "name": "Cameron Purdy",
        "biography": "Vice President of Development in Oracle's Fusion Middleware group ( Oracle ) Cameron Purdy is a Vice President of Development in Oracle's Fusion Middleware group. He was the founder, president and CEO of Tangosol and has over ten years of experience with Java and Java-related technology. Since 2000, his leadership, vision, and commitment to exceptional product quality and customer satisfaction have made Tangosol Coherence, now Oracle Coherence, the market leading in-memory caching and data grid solution to companies building and running mission critical Enterprise Java and .NET applications. Tangosol was acquired by Oracle in April 2007. As a software visionary and industry leader, Mr. Purdy is a frequent presenter at industry conferences and has received a number of awards in recognition of his contribution to the Java community. He regularly participates in industry standards development and is the specification lead for JSR 107 (jCache)."
      }
    ],
    "year": 2007
  },
  {
    "title": "Messaging and Concurrency in a Spring Environment",
    "level": "advanced",
    "summary": "Traditional Spring-based architectures focus on the notion of a central service layer, with the communication between the services designed as synchronous method invocations. Spring 2.0 introduced extensive support for \"Message-Driven Objects\" and general asynchronous task execution, allowing the use of messaging and concurrent execution within the heart of a Spring-based application. This talk provides a tour through the messaging and concurrency facilities that Spring offers, including Spring 2.1's JMS configuration namespace and JCA 1.5 support.",
    "description": "Message-Oriented Architectures: messaging versus asynchronous task execution (10 min) Synchronous JMS Messaging in Spring: JMS setup examples, JmsTemplate usage (15 min) Asynchronous JMS Messaging in Spring: message listener container examples (20 min) Spring's TaskExecutor abstraction and other related Spring facilities (10 min) Expected audience: People with an interest in Spring as well as messaging, ideally familiar with the JMS API basics as well as the Spring fundamentals. Attendees will learn about the sophisticated functionality that Spring offers in the JMS space, as well as about the general use of asynchronous execution within Spring-based application architectures.",
    "language": "en",
    "speakers": [
      {
        "name": "Juergen Hoeller",
        "biography": "( Interface 21 ) Juergen has been the most active Spring developer since the open source project began from Rod's Interface21 framework back in February 2003. Juergen and Rod together continue to provide the direction for Spring. Juergen has earned great respect in the Spring and J2EE communities for his energy, the quality of his code, his incredible attention to detail, and his huge contribution in Spring forums and mailing lists. Juergen is an experienced consultant, with outstanding expertise in web applications, transaction management, O/R mapping technologies, and lightweight remoting. He has specialized in J2EE since early 2000, having held technology leader positions in various projects ranging from enterprise application integration to web-based data visualization."
      }
    ],
    "year": 2007
  },
  {
    "title": "Building scalable, reliable, secure, RESTful services",
    "level": "intermediate",
    "summary": "While WS-deathstar may get a lot of attention in the scalability, reliability, and security areas, RESTful HTTP services have a lot to offer you that you may not be aware of. What's more, the resulting architecture may be simpler and more easily maintained. This session will examine strategies for building scalable, reliable, and secure RESTful web services for the enterprise environment, and examine the reasons for doing so. Along the way we'll cover topics such as ETags, SSL, idempotent methods, various programming toolkits, XML Encryption/Signature, and much more.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Dan Diephouse",
        "biography": "Enterprise architect ( Envois Solutions ) Mr. Diephouse is an accomplished enterprise architect and open source developer who specializes in web services and service-oriented architecture. He is a co-founder of the Apache CXF services framework, founder of XFire, and a committer on several other open source projects, including Apache ServiceMix, Apache XmlSchema, and Jettison. He is also the founder of Envoi Solutions which is dedicated to providing support, training, and consulting around SOA and web services."
      }
    ],
    "year": 2007
  },
  {
    "title": "Advanced JPA Topics",
    "level": "advanced",
    "summary": "The Java Persistence API (JPA) is fast becoming the popular choice for object-relational persistence not only in Java EE environments but also in enterprise applications that make use of other technologies, such as Spring. Since the JPA standard has taken hold, the developer base has gotten more experienced with the persistence model, and the questions that arise are now more of an intermediate or advanced nature. In this talk we will introduce a few of the common features and use them as a platform on which we can discuss some of the higher order JPA topics. As part of this discussion we will show how to use multiple persistence units, define and tune identifier generators, create and invoke native queries, and use XML mapping files for overriding annotation metadata. We will also show how JPA can be used in Java SE and Spring environments. While attendees that have some experience using JPA will profit from this talk, even those who are interested in JPA, but who have not yet started writing applications with it, could also enjoy it. Some kind of experience with Java persistence would be beneficial, though.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Mike Keith",
        "biography": "Architect ( Oracle ) Mike Keith was the co-specification lead for EJB 3.0 (JSR 220) and a member of the Java EE 5 expert group (JSR 244). He co-authored the premier JPA reference book called Pro EJB 3: Java Persistence API and has over 15 years of teaching, research and development experience in object-oriented and distributed systems, specializing in object persistence. He is currently a Java and persistence architect for Oracle and is a popular speaker at numerous conferences and events around the world."
      }
    ],
    "year": 2007
  },
  {
    "title": "Enterprise batch prosessering med Spring Batch",
    "level": "intermediate",
    "summary": "Mange applikasjoner er avhengig av batchjobber for å utføre forretningskritiske prosesser. Felles for batchjobber er at de behandler store datamengder, og utføres uten brukerinteraksjon. Batchjobber prosesserer store datamengder, formaterer inndata, utfører datavalidering og implementerer komplekse forretningsregler. Spring Batch er et omfattende lettvektsrammeverk som støtter disse prosessene. Spring Framework har lenge vært det mest populære rammeverket for utvikling av applikasjoner for Java SE og Java EE. Spring Framework legger til rette for POJO-basert utvikling og dependency injection. Spring Batch er utviklet av Accenture i samarbeid med Interface 21. Sesjonen tar sikte på å presentere Spring Batch, og vise hvordan Spring Batch flytter vanlige batchoppgaver som restart, skipping og jobpartisjonering vekk fra utvikler og inn i rammeverket. Presentasjonen vil vise Spring Batch arkitekturen og demonstrere bruken av den ved å gå igjennom en enkel eksempelapplikasjon.",
    "description": "Bakgrunn (Hvorfor et rammeverk, hvorfor open source, hvorfor Spring) Hensiktene/Målene med Spring Batch Spring Batch oversiktsbilde Gjennomgang av de forskjellige konfigurasjonsstegene Demonstrasjon av eksempelapplikasjon Spring Batch roadmap Presentasjon av folkene bak Spring Batch Required experience: Det vil være en fordel for tilhørere dersom de har en grunnleggende kunnskap om Spring Framework. Expected audience: Arkitekter og utvikelre av batchapplikasjoner",
    "language": "no",
    "speakers": [
      {
        "name": "Morten Andersen-Gott",
        "biography": "Consultant ( Accenture ) Morten er Consultant i Accenture og har jobbet med Java-/JEE-utvikling i 3 år, med spesialisering på EJB og persisteringsteknologier. Han er nå en del av applikasjonsarkitekturteamet på NAVs pensjonsprosjekt. Han har tidligere jobbet på prosjekter innen for bank og telekom."
      }
    ],
    "year": 2007
  },
  {
    "title": "Enterprise Service Bus HOWTO: From Software Selection to Mission-Critical Application Deployment",
    "level": "intermediate",
    "summary": "This is a comprehensive, hands-on tutorial to using the Mule ESB in a mission-critical production environment. This HOWTO is based on the speaker's experiences deploying Mule ESB at the largest educational toy company in the United States and at the largest company in the world. The presentation will cover such topics as: how do you select an ESB? As a developer, how do you start working with it? How do you integrate it with Spring or other frameworks? Learn how to define the business and technology requirements, compare the characteristics of several ESBs (commercial and open-source), review the ESB architecture, and participate in a short development workshop. Bring your laptop!",
    "description": "- About the speaker (qualifications) - Do you need an ESB? - Enterprise integration architecture concepts - Services-oriented architectures, messaging, and web services - Enterprise service bus evolution - Commercial ESBs - Open-source ESBs - Decision cheat sheet: commercial or open-source? - The Mule ESB - Download, installation, and configuration - Integrating third-party adapters - Application integration - Defining the endpoints - Message routers (synchronous, asynchronous) and transactions - Translators - Extending Mule to handle application-specific messages, routing, translators, and service objects - Deploying the ESB - Embedded in a custom application - As part of Spring or other framework - High-performance dedicated deployment (server selection) - Production deployment - Planning deployment - Deploying the ESB and associated applications - System monitoring - ESB and application monitoring - Disaster recovery and fail-over - Expanding the ESB from a single application to becoming the enterprise backbone - Conclusions - Q&A Expected audience: Software engineers, systems architects, and integration specialists rolling out new applications based on SOA who are in the process of selecting modern and reliable integration platforms, and who want to learn more about the differences between ESBs, their configuration requirements, development and integration effort, and operational characteristics. The attendees will learn: How to select an ESB How to integrate exisiting (Java 1.4, legacy) applications and new technologies How to integrate non-Java technologies into an enterprise application (i.e. .Net) How to extend the ESB functionality through the service managers, routers, translators, and filters written in Java How to integrate the ESB in the environment by embedding it into the application or leveraging a framework like Spring Cost control is an imperative; approaches to reduce costs How to deploy and monitor ESB-based applications (tools discussion) A list of open-source technologies that meet of exceed the feature sets of commercial applications at a fraction of the cost and that will keep the IT organization engaged by participating in a community effort",
    "language": "en",
    "speakers": [
      {
        "name": "Eugene Ciurana",
        "biography": "Director of Systems Infrastructure ( LeapFrog ) Eugene is the Director of Systems Infrastructure for LeapFrog Enterprises, the largest educational toy company in the United States. In 2006 he led the first-time adoption of Linux and other open-source technologies at Wal-Mart Stores Information Systems Division as chief liaison between Walmart.com Global and the ISD technology council. Eugene has contributed to Java. Linux, and OS X open-source projects and has architected main line of business applications, embedded platforms, and real-time systems for the largest companies in the world, including Wal-Mart, Bank One/Chase, National Oilwell Varco, Bank of America, Credit Suisse, Nortel Networks, Sun Microsystems, IBM, Univex/Celanese, Nexis/Lexis, and others. He's the author of over 50 feature articles and editorials about technology and computer programming topics for such publications as Software Guru, Computerworld, Informatique!, EE Times, Byte, PC/Tips, and OMNI, and he's a contributing editor to TheServerSide.com, the leading Java technology community and periodical worldwide. He's currently working on a book about the Mule ESB and on his second novel. Eugene may be reached on freenode IRC (##java, #awk, #esb, #security) under the /nick pr3d4t0r."
      }
    ],
    "year": 2007
  },
  {
    "title": "WS-DuckTyping with Spring Web Services",
    "level": "intermediate",
    "summary": "One of the most popular features of languages such as Smalltalk, ObjectiveC, and Ruby is duck typing. The basic thought behind duck typing is that if an object walks like a duck and talks like a duck, then the language is happy to treat it as if it a duck. In other words: the object’s type is determined by what it can do, not by its class. Web services exchange information, often in a common, interlingual format such as XML. What happens when we apply the principles behind duck typing to Web services? This talk presents WS-DuckTyping: not a new W3C standard; but rather a way to deal with XML as if it were a duck. We will give a number of practical tips to implement this Anatidaeic development style, including working with XPath to extract information from incoming Web service request, whether and how to validate XML with a schema, and more. Finally, we will show some recent improvements into Spring Web Services which facilitate WS-DuckTyping.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Arjen Poutsma",
        "biography": "Senior consultant ( Interface 21 ) Arjen Poutsma is a senior consultant at Interface21 with more than ten years' experience in commercial software environments. During this time he has worked with both J2EE and Microsoft .NET. Three years ago, Arjen started to specialise in Web Services and Service Oriented Architectures. During this period, he has worked for some of the largest organizations in the world helping them better understand enterprise Java and how SOAs fit into their organizations. In part from his experiences with these organizations, Arjen founded the open source Spring Web Services project and continues to lead the technical direction and development as the project lead for Spring Web Services. This project aims at facilitating development of document-driven web services. Arjen has also contributed to various other open source projects, including XFire, NEO and others. He is a regular speaker at Java and SOA conferences, including JavaPolis, The Spring Experience, JavaZone, W-JAX, and many others."
      }
    ],
    "year": 2007
  },
  {
    "title": "How do I invoke a method, and yes I am a senior developer",
    "level": "beginner",
    "summary": "Recently we have encountered questions such as \"How do I invoke a method\" in the context of dependency injection frameworks. The more difficult questions, like \"how to invoke invoke a static method\" has become senior developer material. The reason is of course that we are now using a ProxyFactoryBean from an XML configuration file, and not Java. The most popular tool for wiring is the Spring Framework, and it will be used in all examples. Wiring applications together using Spring may end up in a set of difficult-to-understand configuration files. There seems to be a belief among most developers that wiring of an application and the use of XML goes hand in hand, and that it is something not possible using pure Java. The speakers will present a Web project consisting of multiple dependencies, where Maven is used to help manage the dependencies. Two parallel approaches will be compared and shown using examples: One using Spring and XML, and one using pure java without a framework. We will compare the two approaches and recommend how wiring together applications using Java can be done, and may lead to a set of other nice effects as well, both in terms of testability, refactoring, and improved roundtrip time. How did we end up here?",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Bjørn Bjerkeli",
        "biography": "Konsulent ( Zenior AS ) Bjørn Bjerkeli currently works as a Senior Consultant in Zenior AS, a Norwegian consulting company. Bjørn has been implementing large-scale distributed systems in Java for insurance companies, banks and major European telecom providers since 1997. He has been working for companies like Nokia and Sybase among others. Although Bjørn often spends much of his time in design and mentoring, he enjoys it when he is engaged in serious coding and development. Bjørn has been member of the program committee for the last three years and is a board member of javaBin. Bjørn writes about his experiences at: Devperspective"
      },
      {
        "name": "Ole-Andre Ranvik",
        "biography": "Senior consultant ( Zenior AS ) Ole Andre Ranvik is a senior consultant working for Zenior AS. He has specialized in JEE development and is a Sun certified web component developer. He has previously been doing sessions at JavaZone on portlets and how to avoid plumbing for business-enriched remote clients."
      }
    ],
    "year": 2007
  },
  {
    "title": "Spring/OSGi : Future foundation for Enterprise applications or in short: OSG-what?",
    "level": "beginner",
    "summary": "OSGi is the server-side revolution that's just around the corner. Gain an early understanding of this important technology and what it can do for you. This session will shortly introduce OSGi and the benefits it offers to enterprise applications and then focus on Spring/OSGi project (Spring support for OSGi) and shows how to build an enterprise application that can take advantage of versioning support (deploy multiple versions concurrently), dynamic service discovery, runtime addition, removal, and update of modules (known as \"bundles\" in OSGi terminology) and more; all on a proven industry platform.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Costin Leau",
        "biography": "Consultant ( Interface21 ) I'm currently employed as a consultant at Interface21 where I am involved mainly with product development (Spring/OSGi, Spring JPA, Java Config and Spring Modules). I'm mainly interested in data access and AOP."
      }
    ],
    "year": 2007
  },
  {
    "title": "Taming your Java Legacy Code",
    "level": "intermediate-advanced",
    "summary": "This tutorial will outline patterns and strategies that can be used to make work easier in large existing Java codebases. An emphasis will be placed upon specific patterns that can be used to identify and break dependencies in code, allowing pieces to be pulled into test harnesses at the unit, component, and subsystem levels. You’ll also learn how to introduce permanent scaffolding in your code to make system evolution easier. The session will consist of lecture and a set of guided exercises in Java. However, we will discuss the application of the techniques in other languages and environments.",
    "description": "- What is Legacy Code? - The Life of a Large Existing Code Base - Seams and Inflection Points - Seam Identification - Component Pruning Strategies - Benefits and Drawbacks of Dependency Injection - Dependency Breaking - Characterization Testing with JUnit and Fitnesse Required experience:This tutorial is for people who have experience working in large Java code bases. Intermediate level familiarity with Java is required.",
    "language": "en",
    "speakers": [
      {
        "name": "Michael Feathers",
        "biography": "consultant ( Object Mentor ) Michael Feathers is a consultant with Object Mentor. He balances his time between working with, training and coaching various teams around the world. Prior to joining Object Mentor, Michael designed a proprietary programming language and wrote a compiler for it, he also designed a large multi-platform class library and a framework for instrumentation control. Publically, Michael developed CppUnit, the initial port of JUnit to C++, and FitCpp, a C++ port of the FIT integrated-test framework. Michael is also the author of the book 'Working Effectively with Legacy Code' (Prentice Hall 2004)."
      }
    ],
    "year": 2007
  },
  {
    "title": "Sneak peek into Spring Security",
    "level": "intermediate",
    "summary": "This talk will cover common challenges when implementing enterprise security applications, such as authentication and authorization, showing how these challenges can be solved using Acegi Security. Acegi Security is an open source project designed for Spring, that overcomes these challenges and in addition incorporates many other useful security features. The next version of Acegi is expected to become part of the popular Spring portfolio.",
    "description": "Acegi Security, authentication, authorization (5 min) Challenges: Authentication and Authorization (10 min) Why not J2EE Security or JAAS? (5 min) Acegi Security - solving the aforementioned challenges (15 min) Demonstration (10 min) Pros and Cons (5 min) Q&A (10 min) Duration: 60 min, including Q&A Required experience: Basic security knowledge. Knowledge of Java EE and Spring Framework. Expected audience: Developers and architects interested in adding security to their Spring applications",
    "language": "en",
    "speakers": [
      {
        "name": "Lars Lunde",
        "biography": "( Bekk Consulting ) Lars Lunde work at Bekk Consulting and is a member of the security competency group there. He has a special focus on security implementations in Java."
      },
      {
        "name": "Anders Østen",
        "biography": "( Bekk Consulting ) Anders Østen work at Bekk Consulting and is a member of the security competency group there. He has a special focus on security implementations in Java."
      }
    ],
    "year": 2007
  },
  {
    "title": "Java Persistence 2.0 - What's New",
    "level": "intermediate",
    "summary": "One of the key outcomes of the work on EJB 3.0 was the introduction of the Java Persistence API - a new, simplified API for POJO persistence and object/relational mapping for use both in Java EE and in Java SE environments. While the Java Persistence API has received considerable attention since its initial release, it is still missing a number of features that are available in implementations today and that have been requested by the community for inclusion in the Java Persistence standard. The purpose of Java Persistence 2.0 is to augment the Java Persistence API to further address the needs of the community, by expanding its object/relational mapping and query language capabilities, correcting areas that lead to lack of portability, standardizing features that are currently designated as optional or are underspecified, and improving integration with other Java EE platform technologies.",
    "description": "This talk will discuss work in progress on Java Persistence 2.0, currently under development through the Java Community Process program: what our goals are and why; what we have accomplished so far; and what we still need to do.",
    "language": "en",
    "speakers": [
      {
        "name": "Linda DeMichiel",
        "biography": "Senior architect ( Sun Microsystems ) Linda DeMichiel is a senior architect in the Java EE Platform group at Sun Microsystems and specification lead for Java Persistence 2.0. As the former specification lead of Enterprise JavaBeans 3.0 she was responsible for driving the radical simplification of the EJB programming model, and was recognized as the 2006 Java Community Process Outstanding Spec Lead for Java SE/EE for her leadership in this work. Linda has over 20 years of experience in the areas of databases, object persistence, and distributed computing. Before assuming responsibility for EJB, she led the team that implemented Sun's first object/relational persistence product, and worked earlier at IBM on object/relational extensions to both DB2 and the SQL99 standard. She holds a Ph.D. in Computer Science from Stanford University."
      }
    ],
    "year": 2007
  },
  {
    "title": "Code Organization Guidelines for Large Code Bases",
    "level": "intermediate",
    "summary": "Structuring a large code base maintained by multiple teams working in parallel can be a real challenge. If you are not disciplined about code structure overtime you will end up with a tangled, unmaintainable mess that cannot adapt to change and risks ossifying into legacy. In this session Juergen and Arjen will pull from their experiences working on large projects to provide important guidelines on code structure. In this session we will pull from their experiences working on large projects (including the Spring Framework) to provide general guidelines on: - Packaging and package interdependencies - Layering and module decomposition - Evolving a large code base We will also discuss how tools can play a role in enforcing architectural soundness. Attendees will leave with practical techniques to improve and sustain the overall structure of their code bases, as well as an understanding of the benefits gained by doing so.",
    "description": "After a short introduction and agenda, we go into code organization. We will explain why code organization is important, but also see that it is often ignored. Next, we will talk about package interdependencies, and show typical examples of code bases that get this wrong. This section will take approximately 10 minutes. Then, we go one step up in granularity, and we talk about module decomposition. We discuss the properties of a module, and talk about the subtle difference between layering and modules. This section will also take about 10 minutes. Then we will look into the Spring framework. We will talk about the evolution of Spring, and the challenges that were tackled when Spring 2.0 was released. This will take about 15 minutes. We will also look at some tools which help you managing such a large code base. We will show these tools in a demo. This will take about 15 minutes. Finally, we offer a summary, and have about 10 minutes left for Q&A. Required experience: Basic knowledge of basic code quality measures is useful Expected audience: Developers working on larger code bases",
    "language": "en",
    "speakers": [
      {
        "name": "Juergen Hoeller",
        "biography": "( Interface 21 ) Juergen has been the most active Spring developer since the open source project began from Rod's Interface21 framework back in February 2003. Juergen and Rod together continue to provide the direction for Spring. Juergen has earned great respect in the Spring and J2EE communities for his energy, the quality of his code, his incredible attention to detail, and his huge contribution in Spring forums and mailing lists. Juergen is an experienced consultant, with outstanding expertise in web applications, transaction management, O/R mapping technologies, and lightweight remoting. He has specialized in J2EE since early 2000, having held technology leader positions in various projects ranging from enterprise application integration to web-based data visualization."
      },
      {
        "name": "Arjen Poutsma",
        "biography": "Senior consultant ( Interface 21 ) Arjen Poutsma is a senior consultant at Interface21 with more than ten years' experience in commercial software environments. During this time he has worked with both J2EE and Microsoft .NET. Three years ago, Arjen started to specialise in Web Services and Service Oriented Architectures. During this period, he has worked for some of the largest organizations in the world helping them better understand enterprise Java and how SOAs fit into their organizations. In part from his experiences with these organizations, Arjen founded the open source Spring Web Services project and continues to lead the technical direction and development as the project lead for Spring Web Services. This project aims at facilitating development of document-driven web services. Arjen has also contributed to various other open source projects, including XFire, NEO and others. He is a regular speaker at Java and SOA conferences, including JavaPolis, The Spring Experience, JavaZone, W-JAX, and many others."
      }
    ],
    "year": 2007
  },
  {
    "title": "Refactoring the data model",
    "level": "intermediate",
    "summary": "Since Martin Fowler first wrote his seminal book on refactoring, developers have struggled to use refactoring techniques to extend a data model without spending excessive amounts of time on maintenance or introducing bugs. The talk will walk through this modification to the refactoring concept and what makes an extensible data model extensible. The testaco library and IDE plugin will be demoed during the talk as an example of the emerging tool support in this area.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Geir Hedemark",
        "biography": "Senior systems consultant ( Basefarm AS ) - M.Sc. microelectroncs, University of Oslo - Developer, architect and project manager with background as a consultant and from the communications industry."
      }
    ],
    "year": 2007
  },
  {
    "title": "POJO Scalability and Large Workloads with Terracotta",
    "level": "intermediate-advanced",
    "summary": "In this practical session you will learn how to build a highly scalable work management framework using standard JDK 1.5 and POJOs, and how to turn it into a distributed grid implementation by using Terracotta's JVM-level clustering and Network-Attached Memory. We will start with a discussion of Data Grids and the Master/Worker pattern -- one of the most useful parallel programming design patterns in use today. You will learn about the identifying characteristics of the pattern and how best to use it in the real world. Following that, we will cover the production implications of operating and scaling a reliable work management framework, and give examples on how to address real-world challenges such as dealing with very high volumes of data, handling work or worker failure, ordering, routing schemes etc.",
    "description": "You will learn: How to identify cases where the Master/Worker pattern is the right solutions How to build a scalable work management grid framework with 100% POJO-based Java How to cluster the JVM and effectively use Network-Attached Memory",
    "language": "en",
    "speakers": [
      {
        "name": "Jonas Bonér",
        "biography": "( Terracotta ) Jonas is working at Terracotta Inc. with a focus on strategy, product development & architecture and technical evangelism. If Prior to Terracotta, Jonas was a senior software engineer at the JRockit team at BEA Systems, where he was working on runtime tools, JVM support for AOP and technology evangelism. He is a committer to Terracotta, the founder of the AspectWerkz AOP framework and has been a committer to the Eclipse AspectJ 5 project and various other Open Source projects. Jonas is a frequent speaker on AOP, JVM-level clustering and other emerging technologies (JavaOne, TSSJS, TSE, JAOO, eWorld, Javapolis, SpringOne, AOSD conferences etc.). For more info, see his blog: http://jonasboner.com"
      }
    ],
    "year": 2007
  },
  {
    "title": "Space Based Architecture – Scalable as Google, Simple as Spring",
    "level": "intermediate-advanced",
    "summary": "SOA is widely adopted for easy integration, development flexibility and leverage, and business agility. However, the inherent complexities and overheads in today's common SOA platforms make the running of stateful business-critical applications seem impossible. In this session, we will demonstrate that SOA ceases to be an oxymoron to high performance when exploiting simple and open, yet powerful technologies such as Spring and Space Based Architecture as the SOA execution environment. We will outline a clear path for turning existing applications into linearly scalable architectures that scale on-demand across a pool of machines, while discussing issues such as loose versus tight coupling, event driven messaging, synchronization, SLAs and high availability, and migration of legacy applications.",
    "description": "Expected audience: Developers",
    "language": "en",
    "speakers": [
      {
        "name": "Owen Taylor",
        "biography": "Sr. Director, Worldwide Technical Communications ( GigaSpaces ) As Sr. Director, Worldwide Technical Communications with GigaSpaces Technologies Inc, Owen translates the new architectural concepts and technical capabilities of space-based solutions into accessible formats so that technologists can adapt them rapidly into their environments and gain their maximum benefit. Owens' areas of expertise include J2EE design patterns and performance tuning of J2EE applications. Prior to GigaSpaces, Owen worked as Principal J2EE Product Specialist with Identify Software. Before that Owen acted as Senior Enterprise Architect with The Middleware Company where he specialized in B2B, EJB and J2EE training and consulting with a special emphasis on webMethods B2B server and, BEA WebLogic Servers. Owen has over the years delivered architecture consulting, mentoring and training to dozens of companies and advised them on how to best architect new applications ranging from e-commerce to stock-trading. Many of his engagements involved developing application prototypes on-site. Prior to The Middleware-Company, Owen was Senior Consultant and Partner in The New Customware Company, where his duties mirrored almost exactly those he executed with the Middleware Company. Prior to CustomWare, Owen was Senior Consultant and Instructor in the Professional Services organization at Inprise (Borland) (an EJB/J2EE & CORBA vendor), where he provided consulting and mentoring to customers in not only building large applications with EJB/J2EE and CORBA, but also specifically on the instrumentation, monitoring and management of applications developed using these technologies. Publications Textual Articulations: active blog located here: http:// jroller.com/page/owentaylor Iterative Development: The Use of J2EE Best Practices: prepared for Precise Software - later to become Symantec Benefits and Market Placement of the Lutris Application Server -- Co-authored with Salil Deshpande"
      }
    ],
    "year": 2007
  },
  {
    "title": "EDRP - Håndtering av domeneobjekter i overlappende kjernesystemer",
    "level": "intermediate",
    "summary": "Har du utfordringer med koplekse data fra flere fagsystemer? Blir systemet ditt tregt fordi komplekse data krever lang tid for å lastes? Dagens virksomheter har ofte et forretningsdomene som spenner seg over flere ulike underliggende kjernesystemer, ofte referert til som silo applikasjoner. Domeneobjektene er adskilte med ulik datakvalitet og gjerne med SLA'er av varierende kvalitet. Dette medfører en arkitektur som skaper integrasjonsutfordringer og som vil får store konsekvenser i en tjeneste orientert kontekst. Typiske tilnærminger til disse integrasjonsutfordringene er master og multi-master strategier. Man har et kjernesystem som opptrer som master og er ansvarlig for å synke mellom \"slave\" systemene, eller en master for hvert kjernesystem. Enterprise Domain Repository pattern (EDRP) ser utfordringen med at samme data lever i forskjellige fagsystemer. Ved å benytte EDRP oppretter du komplekse objekter en gang. Deretter legges dette objektet i cache, for rask tilgang ved senere bruk. Når du oppdaterer data som berører objektet som ligger i cache, reflekteres dette direkte til alle brukere av tjenesten. Ved at oppdatering også går gjennom EDRP tjenesten vil alle brukere, og alle fagsystemer, ha mulighet til å få med seg oppdateringen. Vi vil i dette foredraget vise hvordan man kan ta kontroll over forretningsdomenet og integrasjonsutfordringene ved å benytte EDRP. Vi vil se nærmere på hvordan EDRP baserer seg på tjenester som korrelerer data fra flere kjernesystemer. Tjenestene vil eksponere forretningsinformasjon fra flere kilder samstilt, og i tråd med virksomhetens egne definisjoner. Ved hjelp av eksempler vil man se hvilke gevinster man får ved å benytte EDRP kontra en master/multimaster strategi.",
    "description": "Introduksjon (1 min) Målet med foredraget (1 min) Typiske integrasjonsutfordringer i dagens virksomheter (10 min) o Overlappende kjernesystemer o Master strategi o Multi-master strategi Tjeneste kategorier (5 min) Enterprise Domain Repository Pattern (20 min) o Hva er det? o Hva løser det? o Hvorfor? o Når bør man bruke det? Erfaringer med bruk av EDRP (10 min) Kilder (1 min) Q&A (10 min)",
    "language": "no",
    "speakers": [
      {
        "name": "Bård Lind",
        "biography": "Senior Konsulent ( Objectware ) Bård har vært hangaround i javaBin siden 1999. Han begynte å jobbe med Java i 1998, og har siden jobbet med integrasjon mellom Java, Stormaskin og Domino. Bård har jobbet med saksbehandlingsystemer, hovedsaklig i distribuerte finanssystemer de siste 8 årene. Objectware er hans nye arbeidsplass, der han spesiellt er aktiv innen OW sin EA/SOA faggruppe. Bård kommer til å være med å holde en rekke Spring kurs det neste året. Jobber nå mest med Spring og EA/SOA praksis. Bård trives veldig godt som mentor for \"ferske\" Java programmere. Bård er en av ildskjelen bak RFID@Conference RFIDConferenceTools"
      },
      {
        "name": "Kjartan Aanestad",
        "biography": "Kjartan is working as a senior consultant at Objectware AS and has about 6 years of programming experience primarily working with J2EE. He has lately been focusing on Service Oriented Architecture and services in specific."
      }
    ],
    "year": 2007
  },
  {
    "title": "Apache Tuscany - Building SOA Solutions With The Service Component Architecture",
    "level": "beginner",
    "summary": "Apache Tuscany provides an open-source services infrastructure for constructing SOA solutions from heterogeneous and distributed services. To make the implementation and deployment of services straightforward Apache Tuscany is based on the widely supported Service Component Architecture (SCA) specification currently being standardized at OASIS. With the Tuscany implementation of SCA, application developers can easily create, reuse and customize services in different languages, for example, Java, BPEL or various scripting languages, and then assemble and deploy them in a distributed environment. Through slides and examples this talk will introduce SCA and the Apache Tuscany project. It will show you how to get started building and connecting services and how this approach simplifies the task of building SOA solutions.",
    "description": "What’s the problem – 4 minutes What are the business drivers for SOA and what are the problems being faced when using today’s development technologies. Service Component Architecture (SCA) – 6 minutes A description of how SCA provides a programming model for SOA and how it helps solve the stated problems. Apache Tuscany – 8 minutes A description of the Apache Tuscany open source project. The features available today. An explanation of how to get the software and run the samples. Some examples of how the software could develop in the future. An invitation to get involved and an explanation of the different ways to do this. Building a Service. – 5 minutes How to build a service to expose service interfaces. This also shows how to exploit this service from client code Connecting to other services – 5 minutes How to connect the service we have just created to other services that we may create or reuse from other applications Extending the application by adding in more services – 5 minutes How functionality can be reorganized and extended using the SCA model Alternative bindings – 5 minutes SCA and Apache Tuscany is designed to support many pluggable binding technologies so we look here at how different communication protocols can be selected. Alternative data bindings – 5 minutes A variety of data formats and representations are also supported. We take a look at how different data bindings can be selected and used. Bringing it together – 5 minutes Demonstration of an example SCA application. Summary and references - 2 minutes The contents of the talk are summarized and we review the stated problem and the SCA based solution in Apache Tuscany. A set of references for further information is provided. Q&A – 10 minutes Required experience: The talk is aimed at competent developers who want to apply these skills to SOA. No prior knowledge of Tuscany or SCA is assumed but knowledge of programming languages in general and some desire to understand how to apply existing programming skills to build distributed services is assumed. Expected audience: Architects, designers and programmers faced with the challenges of building SOA solutions. This talk presents an infrastructure for building and deploying the services of an SOA using the consistent model provided by the Service Component Architecture.",
    "language": "en",
    "speakers": [
      {
        "name": "Simon Laws",
        "biography": "Simon is currently a member of the IBM Open Source SOA project team working with the open source Apache and PHP communities to build Java, C++ and PHP implementations of the Service Component Architecture (SCA) and Service Data Object (SDO) specifications. Prior to this role Simon was working in the distributed computing space building service oriented solutions for customers with a particular interest in grid computing and virtualization."
      }
    ],
    "year": 2007
  },
  {
    "title": "Measuring Up Performance, A Practitioners View",
    "level": "intermediate-advanced",
    "summary": "The key to any successful performance tuning exercise is in getting a measurement that offers the insight needed to understand the root cause of poor performance. Yet for many teams that measurement proves to be very elusive. Lacking any real evidence teams often resort to guessing at what the problem is. Although teams can successfully at guessing it is rarely an effective means to direct a tuning effort. In this seminar we will explore some of the reasons why teams fail to obtain that all revealing measurement. The session will introduce a conceptual tool that can be used to more effectively tackle performance problems. At the end of the day measuring is about tooling and so we will explore some tools that have been useful in exposing root causes of performance troubles.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Kirk Pepperdine",
        "biography": "Kirk is a principle consultant for Kodewerk where he has focused on performance tuning. Kirk has been involved with object technologies and performance for almost 20 years. In addition to being a co-author of ANT Developers Handbook, he contributes to www.javaperformancetuning.com and is an editor for TSS www.theserverside.com."
      }
    ],
    "year": 2007
  },
  {
    "title": "Plain Old Java DSLs",
    "level": "intermediate",
    "summary": "In contrast to general programming languages like Java, a Domain Specific Language is a programming language that is target towards a particular kind of problem. Even if DSLs have been around in various forms for ages, the rising popularity of dynamic languages has made them a hot topic again. Most of the attention has been on how one can use these dynamic languages constructs to craft embedded DSLs. Unfortunately, most developers cannot use Ruby or Groovy in their everyday work and the advantage a DSL has to offer remains a theoretical possibility. This talk will introduce you to a variety of design philosophies, design patterns and programming techniques you can use to define embedded DSLs using nothing but plain old Java. After attending this talk you should be able to use your Java skills to extend” the language to enable you to write code that reads like plain English.",
    "description": "A brief introduction to Domain Specific Languages Design philosophies o What makes Ruby “elegant”? o Humane Interfaces Designing DSLs in Java (Patterns & Practices) o The Builder pattern - How the builder pattern simplifies object model assembly. - Using Java 1.5 static imports to extend the Java vocabulary. - Demo: “Skipping two versions” – Language level XML support in Java 1.5 (See http://andersnoras.com/blogs/anoras/archive/2007/04/25/xml-dsl-for-java-1-5.aspx for an example) - Demo: Building a DSL for XHTML Documents. o The Fluent Interface pattern - Creating expressive APIs that read like plain English using the fluent interface pattern. - “LINQ for J” - Extending Java with a query language. (See http://andersnoras.com/blogs/anoras/archive/2 007/03/23/guess-what-i-m-up-to.aspx for an example.) - Demo: Adding query capabilities for any Iterable resource. - Demo: Extending Hibernate to support the query DSL. “There is more to Java than Java” - Using the Java 1.6 scripting features to create dynamic DSLs.",
    "language": "en",
    "speakers": [
      {
        "name": "Anders Norås",
        "biography": "Enterprise Architect ( Storebrand ) Anders Norås works as an enterprise architect for Storebrand. He hasmore than 10 years experience developing business application usinga wide variety of technologies. Anders is an experienced speaker whohas talked at numerous user group meetings and industryconferences."
      }
    ],
    "year": 2007
  },
  {
    "title": "Five Considerations for Software Developers",
    "level": "intermediate",
    "summary": "Those involved in software have a lot to keep in mind as they negotiate the worlds inside and outside of their code and the relationship between them. For those interested in improving the state of their art there are many (many) sources of specific recommendations they can use to sharpen their practice.",
    "description": "This talk takes a step back from the busy, overpopulated and often overwhelming world of such recommendations to focus on five general considerations that can inform more detailed recommendations and specific decisions.",
    "language": "en",
    "speakers": [
      {
        "name": "Kevlin Henney",
        "biography": "Kevlin Henney is an independent consultant based in the UK. He specialises in programming languages, OO design, patterns, development process and software architecture, helping teams adopt techniques and improve their software development through training, mentoring and reviewing and training. He has been a columnist for various magazines and is currently a columnist for the Reg Developer channel of The Register. He is also coauthor of two recent volumes in the Pattern-Oriented Software Architecture series."
      }
    ],
    "year": 2007
  },
  {
    "title": "Building a Service Oriented Architecture with ServiceMix",
    "level": "intermediate",
    "summary": "There is a big buzz and a lot of hype about Service Oriented Architecture (SOA) and the Enterprise Service Bus (ESB). A solid SOA architecture allows you to use standards-based, pluggable, and loosely coupled services to integrate and communicate the critical business logic from disparate systems. Apache Service Mix is one of the first ESB implementations in open source to offer a solid foundation for building SOA applications. This session will cover Apache ServiceMix and how it implements Java Business Integration (JBI - JSR208) covering Service Engines (SE), Binding Components (BC), and how the different components communicate via the Normalized Messaging Router (NMR). It will also demonstrate coding and wiring these components together to show how to begin building a SOA based application with a real world example.",
    "description": "1) Business Integration Problem 2) Past solutions 3) SOA - What is it? 4) ESB and open standards 5) JBI - What is JBI and why is it the answer? 6) JBI - The Answer 7) JBI Overview 8) ServiceEngines and Binding Components 9) WSDL 10) Messaging, Normalized Messaging Router 11) JBI Artifacts 12) ServiceMix - Opensource ESB JBI JSR-208 Compliant container 13) JBI ServiceMix Components 14) Developing and wiring a ServiceUnit 15) Xbean/Spring 16) Realworld examples 17) WSDL First 18) Loan Broker (JMS based Soap Messaging)",
    "language": "en",
    "speakers": [
      {
        "name": "Jeff Genender",
        "biography": "Software architect ( Savoir Technologies ) Jeff has over 18 years of software architecture, team lead, and development experience in multiple industries. He is a frequent speaker at such events as TheServerSide Symposium, JavaZone, Java In Action, and numerous Java User Groups on topics pertaining to Enterprise Service Bus (ESBs), Service Oriented Architectures (SOA), and application servers. Jeff is an active committer and Project Management Committee (PMC) member for Apache Geronimo, a committer on OpenTerracotta, OpenEJB, ServiceMix, and Mojo (Maven plugins). He is the author of Enterprise Java Servlets (Addison Wesley Longman, 2001), the co - author of Professional Apache Geronimo (2006, Wiley), and Professional Tomcat (2007, Wiley). Jeff also serves as a member of the Java Community Process (JCP) expert group for JSR-244 (Java Platform, Enterprise Edition 5 (Java EE 5) Specification) as a representative of the Apache Software Foundation. Jeff is an open source evangelist and has successfully brought open source development efforts, initiatives, and success stories into a number of Global 2000 companies, saving these organizations millions in licensing costs."
      }
    ],
    "year": 2007
  },
  {
    "title": "Java Persistence on the client",
    "level": "intermediate",
    "summary": "The Java platform comes with plenty of tools to ease software development. Since version 6, the JDK now includes Java DB, a 100% Java powered database. Leveraging the ease of use of the Java Persistence API, now also available in a Java SE environment, developers can easily take advantage of the power of these systems in their desktop applications. During this presentation we will cover what is needed to integrate these tools within a Swing application and demonstrate the benefits in term of speed and features both technologies can bring to your desktop software at almost no cost. Besides persisting your domain model, you'll also see how to persist your application state, enabling instant recovery from expected as well as unexpected terminations. Finally, beyond the desktop local data, we'll introduce remoting, synchronizing data with a remote Java EE application: on top of synchronizing modified data on both ends, it also export new instances to each database.",
    "description": "+ The application before: - Presentation; - Serialization; - Querying. + Java DB: - Quick intro; - Packaging within the app. + JPA - Quick intro; - Packaging within the app. + Refactoring the app - Your model as entities; - Life-cycle and tx management; - Querying; - Persisting your application's own state. + Beyond the desktop - Introducing remoting; - synching both sides; - Dynamic proxies. + Conclusion + Q&A",
    "language": "en",
    "speakers": [
      {
        "name": "Alexander Snaps",
        "biography": "Software engineer and Java EE specialist ( 101 Solutions ) It is in 1987 in Munich, Germany that Alexandre Snaps discovers his natural ability for computer languages and starts their studies and gets involved in different Open Source projects. In 1999, he plunges into web development and three years later, he starts his own business, 101 Solutions (formely known as DOG7), focused on enterprise integration. He is developing web-applications for over ten years and using Java for more than seven years."
      }
    ],
    "year": 2007
  },
  {
    "title": "Deploying Maven in the Enterprise",
    "level": "beginner-intermediate",
    "summary": "Deploying Maven in large organizations is not an easy task. Primarily it requires a change in mindset on how to create and maintain your software codebase over time. In order to successfully introduce Maven it is important to setup the necessary infrastructure components correctly. This includes the installation of Maven, a company internal artifact repository, establishing project object models and continuous integration, integrated with the company source control system. Also an internal Maven Proxy should be set up, in order to build on top of external repositories if this behaviour is desired. The presentation takes a practical approach to establishing all the required infrastructure components based on best practices and real-life project experience within large enterprise projects. I will address common challenges when deploying Maven and related products. Maven requires a somewhat different mindset than traditional solutions, like using Ant for purposes of build and committing binary artifacts to version control. Traditionally, many companies have invested lots of time into developing their own build scripts on a per project basis and these are very rarely reused. With Maven, the approach is different - the idea is to deploy a company-wide infrastructure which should be reused by all projects. Also, when reusing in a large enterprise context, the advantage of common rules for placing source code and configuration files are truly helpful as they secure an enterprise-wide point of standardization. Internal frameworks are much easier to reuse than before by continuously deploying company internal snapshots thus making them available for clients. Also, automation of code metrics and different types of reports are easy to publish. Other challenges one typically faces, of which will be addressed as part of the presentation are: - Implicit plugin versioning often causes problems. Without explicitly setting versions, the latest/greatest snapshot will always be downloaded and the quality of those can vary. - Many third party frameworks are distributed with poor dependency definitions, causing many unnecessary artifacts to be downloaded and deployed through transitive dependencies. - From time to time, people make mistakes like redeploying new versions of artifacts based on existing versions. This will cause clients to never download the new versions of those artifacts. - When introducing many frameworks at the same time, one risk that several artifacts have dependencies to different versions of the same artifacts and this can cause some difficult to solve side-effects in the runtime. - Many companies carry legacy build solutions and it is possible to integrate those with Maven. However, a mix of Ant, Maven1 and Maven2 is never a good idea in real-life.",
    "description": "Why Maven is useful in an enterprise context beyond building and developing standalone applications. Establishing an enterprise-wide artifact repository based on available open source products, like Maven proxies. Configuring the project object model to integrate the repository and source control. Establishing continous integration with Continuum. Q&A",
    "language": "en",
    "speakers": [
      {
        "name": "Kristoffer Moum",
        "biography": "Senior developer ( Arktekk ) Kristoffer Moum is a senior developer with more than six years of development with enterprise Java. He likes agile principles and currently works as a Scrum master in a large enterprise project. Also, Kristoffer has done mentoring and architecture review as well as courses and various presentations."
      }
    ],
    "year": 2007
  },
  {
    "title": "Farewell to the application server: The server container anti-pattern and how to avoid it",
    "level": "intermediate-advanced",
    "summary": "After fighting complexity in configuration management, packaging, bureaucracy and deployment with Java EE servers for longer than we thought was humanly possibly, my team finally decided to go back to basics. Instead of a complex Java EE application server, we have put together a 100% open source application stack that runs in a standard Java SE environment, and addresses the development life cycle from programming and unit testing into production and operations. The solution has given us simplicity and control over the whole life cycle from development and unit testing, through continuous integration, packaging and configuration management, into staging and production environments. The presentation will focus around a practical demonstration of this life cycle. Our new solution, internally dubbed \"the Java SE server\", is a custom-built assembly of stable and widely used open source components like Maven, Jetty, Spring and Hibernate running on a standard Java VM. We are currently in the process of rolling out the solution on four systems, three of which are business critical, and more will follow. (Some roll-outs will be before JavaZone, some after)",
    "description": "What am I going to show you, and why? Semi-practical demonstration: Production deployment Releasing Continuous deployment Packaging Unit testing Benefits we experienced with this approach How it is done Challenges: Technical, organizational and legal Results: Performance and operational characteristics Q&A /ul>",
    "language": "en",
    "speakers": [
      {
        "name": "Johannes Brodwall",
        "biography": "Software Architect ( BBS ) Johannes Brodwall is lead software architect in BBS. He has been working with Java in enterprise environments for a number of years and is a veteran speaker at JavaZone. At BBS, he espouses simple applications with focus on domain-objects and a set of infrastructure components which are light-weight enough to be within the grasp of mere mortals. He has written two (soon to be three) articles describing elements of this architecture for Java.net ( http://today.java.net/pub/a/today/2005/10/11/testing-hibernate-mapping.html, http://today.java.net/pub/a/today/2006/07/13/lazy-loading-is-easy.html) and on his blog (http://brodwall.com/johannes/blog/ )"
      }
    ],
    "year": 2007
  },
  {
    "title": "Open source Enterprise Integration with Mule",
    "level": "advanced",
    "summary": "Besides the wide variety of open source tools and frameworks for application development, the support for open source enterprise integration is growing fast. This presentation will provide the attendees with a selection of Open source Enterprise Integration tools and frameworks and will show these tools and frameworks with demos. The foundation of this presentation will be based on Mule. This Open source integration platform shows that implementing an ESB doesn't have to be complex and expensive. A more lightweight approach can be very benificiary in a lot of cases. To show that Mule can be used in enterprise integration scenarios, a number of the Enterprise Integration Patterns of Hohpe and Woolf are implemented. By using these patterns we can show the attendees a structured approach from designing an integration solution to the real implementation of the solution.",
    "description": "Goal of this presentation (overview of open source enterprise integration, structured approach from design to implementation) 3 min Overview of Mule (Mule history, architecture and UMO components) 5 min Hello world demo with Mule (Show the open source tools and frameworks) 10 min Case study (show a simple case study) 2 min In action demo (coding the solution during the presentation) building up the case study in parts (30 min) Start with a simple message channel (point-to-point and pub-sub) Show content enricher, canonical data model and message transformation with integration of NASA Map Show content-based routing with integration of Flicker",
    "language": "en",
    "speakers": [
      {
        "name": "Tijs Rademaker",
        "biography": "Software architect ( Atos Origin ) Tijs Rademakers is a software architect with over 6 years of experience in designing and developing Java and J(2)EE applications. In the last years he has designed and implemented large process and application integration solutions, primarly focussed on open standards. He has extensive product knowledge of open source as well as commercial integration solutions including WebSphere Process Server, WebSphere Message Broker, Mule and Synapse. Tijs is an active member of the Apache Synapse project."
      },
      {
        "name": "Jos Dirkson",
        "biography": "Software Architect ( Atos Origin ) Jos Dirksen has been working with Java and J2EE applications for more then 6 years as a software architect. The last couple of years his focus has been open source, security and quality. He has worked a lot with the various open source and commercial integration solutions, mostly in the government and the healthcare areas. Jos has a lot of experience working with mule, synapse and Axis2 in commercial projects and has also completed projects based on the integration tooling from IBM. Jos regulary gives presentation on open source, mule and other related topics."
      }
    ],
    "year": 2007
  },
  {
    "title": "Refactoring HTML",
    "level": "intermediate",
    "summary": "As web sites transition from simple content to full-blown, two-way applications the legacy cruft of the past ten years is becoming apparent. There are millions of sites and billions of pages that have been around since the 1990s. Many of these pages were designed for browsers like Netscape 3, Internet Explorer 2, or even Mosaic. They may have been redesigned several times, but the underlying structure and markup remains the same; and this is becoming a problem. These pages don’t work well with modern technologies and tools like AJAX, DOM, E4X, JavaScript, and more. Consequently, many web developers and designers find themselves faced with legacy code for the first time. Until recently most sites and pages just weren’t old enough for legacy issues to be a major concern. While legacy issues and the tools and techniques for managing them are well known to programmers, web folks are just now learning about these problems. As web designers begin to grapple with the legacy issues that have hampered programmers for so long, they’ll need to learn the same refactoring techniques programmers have used to manage these problems.",
    "description": "This talk help web designers, web authors, web programmers, and webmasters learn the tools and skills they need to clean up their sites so they can take them to the next level. Specific goals include improving accessibility and usability, optimizing search engine placement, and reducing the overall cost of development for web sites. by converting sites to web standards: XHTML, CSS, and REST.",
    "language": "en",
    "speakers": [
      {
        "name": "Elliotte Harold",
        "biography": "Elliotte is originally from New Orleans to which he returns periodically in search of a decent bowl of gumbo. However, he currently resides in the Prospect Heights neighborhood of Brooklyn with his wife Beth, dog Shayna, and cats Charm (named after the quark) and Marjorie (named after his mother-in-law). He's an adjunct professor of computer science at Polytechnic University where he teaches Java, XML, and object oriented programming. His books include Java I/O, Java Network Programming, the XML Bible, and XML in a Nutshell. His next book will be Refactoring HTMl from Addison-Wesley."
      }
    ],
    "year": 2007
  },
  {
    "title": "Forretningsprosesser og brukerinteraksjon",
    "level": "intermediate",
    "summary": "It bransjen har gjennom ”SOA bølgen” hatt stor fokus på forretningsprosesser, noe som vises ved at mange produktleverandører fronter prosessmotorløsninger, gjerne sammen med deres ESB løsninger. Tradisjonelt sett har prosessmotorløsninger vært brukt til styring av backend integrasjon. Nå ønsker flere kunder en nærmere kobling mellom brukerne og forretningsprosessene, slik at it- systemene faktisk støtter hele forretningsdriften. I denne sammenheng finnes det mye uklarheter om hvordan man på best måte kan gjøre dette. En av utfordringene er hvordan brukerens skjermbiler og skjermflyt kan samspille med den overordnede forretningsprosessen. Vi oppklarer forskjellen mellom skjermflyt og forretningsprosesser, med å presentere scenarioer hvor dette samspillet demonstreres. Vi viser hvordan man pragmatisk og enkelt kan integrere en forretningsprosess med en Spring Web-applikasjon. Vi demonstrerer prosesser som spiller sammen med skjermbilder og forretningslogikk implementert i en Javaapplikasjon. Videre går vi inn på hvilke fordeler og bruksområder man har ved å la en forretningsprosess styre en brukerapplikasjon, og når man bør gjøre dette. Vi vil diskutere forskjellen mellom skjermfløytverktøy som Spring WebFlow og prosessverktøy som BPEL. Scenarioene i som presenteres er basert på erfaringer fra store norske prosjekter.",
    "description": "Introduksjon  Presentasjon av speakers Problemstilling: foretningsprosesser og skjermflyt Problemstilling: Pragmatisk implementasjon Presentasjon av teknologi Prosessmotor(ESB)- teknologi benyttet Rammeverk og annen teknologi Scenario 1: Bookingsystem Presentasjon av en avansert bookingprosess Interaksjon mellom forretningsprosess og skjermbilder Scenario 2: Saksbehandlingsprosess Presentasjon av en to-trinns saksbehandlingsprosess Applikasjonsarkitektur Interaksjon mellom forretningsprosess og skjermbilder Demonstrasjon av forretningsprosessen i benyttet verktøy Demoapplikasjon  Spørsmål / diskusjon Required experience: Grunnleggende forståelse av integrasjon og J2EE utvikling. Expected audience: Utviklere og arkitekter med interesse for enerprise arkitekturer.",
    "language": "no",
    "speakers": [
      {
        "name": "Mario Aparicio",
        "biography": "Consultant ( Ciber ) Mario is currently working with Java development and Integration at CIBER Norway, an acknowledged consulting company, delivering mission critical solutions with strong focus on Java, and related technologies. He holds a Master of Computer Science from Norwegian University of Science and Technology. Mario's interests are integration, Web Services and SOA using the Java platform. "
      },
      {
        "name": "Tor Arne Kvaløy",
        "biography": "Developer ( Tarantell ) Tor Arne is java developer at Tarantell, a leading company in user friendly web systems. He has a Master in Computational Science, and has worked for IBM Netherland Center for Advanced Studies, where he did research on grid and semantic web services, which has been published on conferences. His main experience and interest is in the field enterprise architectures, integration and web systems.   "
      }
    ],
    "year": 2007
  },
  {
    "title": "The State of Ajax",
    "level": "beginner",
    "summary": "Join Ben and Dion as they walk attendees through the rapidly evolving and often confusing Ajax landscape, covering the important topics and trends that will affect how you develop web applications. Far from a fickle fashion, Ajax is continuing to revolutionize the way software is built, from providing the new model for desktop applications to the new model for mobile applications. The Ajaxians will start the keynote analyzing the large impacts Ajax is having on the development landscape, including the latest in end-to-end JavaScript (i.e., JavaScript serving up JavaScript to the client) and server-less Ajax. They'll next discuss how the frameworks are changing to make development easier and it better address the challenges of cross- browser development. The final part of the talk discusses the state of the browsers, the Ajax community, and the future.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Ben Galbraith",
        "biography": "co-founder of Ajaxian.com Ben is a frequent technical speaker, occasional consultant, and author of several Java-related books. He is a co-founder of Ajaxian.com, was recently Chief Technical Officer for Amirsys, and is presently a consultant specializing in enterprise architecture and Swing/Ajax development. Ben wrote his first computer program when he was six years old, started his first business at ten, and entered the IT workforce just after turning twelve. For the past few years, he's been professionally coding in Java. Ben presides over the Utah Java User's Group, is active in the Java Community Process, and tinkers on various open-source projects from time to time. He delivered over eighty technical presentations in 2004 at venues including JavaOne, O'Reilly Open Source Conference (OSCON), and the No Fluff Just Stuff Java Symposiums."
      },
      {
        "name": "Dion Almaer",
        "biography": "co-founder ( Ajaxian.com ) Dion is the co-founder of Ajaxian.com, the leading Ajax community, and \"Audible Ajax\" the popular podcast. He is a columnist on Enterprise Java topics at openxource.com, onjava.com and of course his blog at almaer.com/blog. He enjoys writing, and speaking at events such as JavaOne, JavaPolis, TheServerSide Java Symposium, and the No Fluff Just Stuff symposium tour. He also participates on JCP expert groups, and the open source community as a whole."
      }
    ],
    "year": 2007
  },
  {
    "title": "Comparing Java Web Frameworks",
    "level": "intermediate",
    "summary": "One of the most difficult things to do (in Java web development) today is pick which web framework to use when development an application. The Apache Software foundation hosts most of the popular Java web frameworks: Struts, MyFaces, Tapestry and Wicket. This session will compare these different web frameworks, as well as Spring MVC and Stripes. It will briefly explain how each works and the strengths and weaknesses of each. Tips, tricks and gotcha's will be plentiful. Lastly, it will provide attendees with a sample application that utilizes all 6 frameworks, so they can compare line-by-line how the frameworks are different. This sample application will include the following features: sortable/pageable list, client and server-side validation, success and error messages as well as some Ajax functionality. The frameworks will be rated on how easy they make it to implement these features.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Matt Raible",
        "biography": "Consultant ( Raibledesigns ) Matt Raible resides in Denver, Colorado, where he runs Raible Designs, a consultancy that specializes in open source Java frameworks and Ajax development. Matt has been surrounded by computers for most of his life, even though he grew up without electricity in the backwoods of Montana. Matt is an author (Spring Live, Pro JSP), active Java open-source contributor, and blogger on raibledesigns.com. He is the founder of AppFuse, a project which allows you to get started quickly with Java frameworks, as well as a committer on the Apache Roller project."
      }
    ],
    "year": 2007
  },
  {
    "title": "Rich Applications using JavaFX Script",
    "level": "beginner-intermediate",
    "summary": "This session provides an introduction to GUI development with JavaFX Script, an object-oriented, declarative Java scripting language.",
    "description": "JavaFX Script is a statically typed language that allows good integrated development environment (IDE) support and compile-time error reporting and has type inference, declarative syntax, and automatic data binding with full support for 2-D graphics and standard Swing components as well as declarative animation. You can also import Java class files, create new objects for the Java platform, call their methods, and implement interfaces for the Java platform. IDE plug-ins are available for both the NetBeans IDE and Eclipse. Both plug-ins support as-you-type validation, code completion, syntax highlighting, and hyperlink navigation (with Control-mouseover). JavaFX Script attempts to demonstrate that we're not exploiting the full capabilities of the Java platform for GUI development and that, together with supporting tools, the Java platform is highly competitive with or superior to competing GUI development platforms such as Adobe Apollo, Ajax/DHMTL Macromedia Flash/Flex/Open Laszlo, Microsoft WPF/XAML, and Mozilla XUL.",
    "language": "en",
    "speakers": [
      {
        "name": "Raghavan 'Rags' N. Srinivas",
        "biography": "CTO of Technology Evangelism at Sun Microsystems Raghavan \"Rags\" Srinivas is the CTO of Technology Evangelism at Sun Microsystems looking at new technology directions and trends. His general focus area is in distributed systems, with a specialization in interoperability, mobility and security. He has spoken on a variety of technical topics at conferences around the world and teaches graduate classes in the evening. He publishes a standards column and has represented Sun at a number of standards bodies. He also serves in the organizing committee for several industry-wide technical conferences. Rags brings with him about 20 years of software development and about 7 years of technology evangelism experience. He worked for Digital Equipment Corporation before joining Sun. He has worked on several technology areas, including internals of VMS, Unix and NT. He has evangelized a number of technology areas including the early releases of Java, Java EE, Java and XML, Java ME, AJAX and Web 2.0 and so on. Rags holds a Masters degree in Computer Science from the Center of Advanced Computer Studies at the University of Louisiana at Lafayette. He enjoys running, hiking and eating, especially spicy food."
      }
    ],
    "year": 2007
  },
  {
    "title": "Eliminate waste in Java development with Adobe Flex",
    "level": "intermediate",
    "summary": "Norwegian start-up company Ezmo used Adobe Flex to eliminate waste from an early beta-release to enable a quick delivery with waste improvements. By removing JavaScript, Direct Web Remoting, Spring MVC and replacing them with Adobe Flex Ezmo was able to deliver what had taken 4 months in less than four weeks. Due to the support for rapid application development and the removal of architectural components which did not provide any added value. Developing web applications on the Java platform usually involves a lot of different frameworks, tools and platforms. In many projects all of these components are usually chosen before the requirements or scope has been determined for the project. Introducing the Adobe Flex framework enables developers to get a better understanding of requirements and scope without too much effort. Adobe Flex enables development teams to have designers and programmers work together in the same IDE. This makes the development faster and enables all team members to do what they know best. Introducing Life Cycle Data Services (LCDS) into Java development enables developer to create collaborative software straight out of the box. With push capabilities, support for partially connected applications, built in pagination and scalability LCDS is a powerful platform for Java application development",
    "description": "Reduce waste and complexity by removing your frameworks     Reduce use of complex patterns  Better User Experience with data driven applications      Experience and design matters, not frameworks. Live Cycle Data Services Data push  Reduce network traffic XML, foe not friend Rapid prototyping Functionality where it belongs Ezmo success story Required experience: none Expected audience: System architects, java-, web- and application developers.",
    "language": "en",
    "speakers": [
      {
        "name": "Espen Dalløkken",
        "biography": "Chief Technical Officer ( Ezmo ) Work three years at Razorfish before joining Bekk Consulting As for 5 years as an Interface Developer working with webapplication in Java and .Net. Joined Fast Search & Transfer in 2006 and moved on to Ezmo in 2007. Helped Ezmo move from an old style HTML/AJAX based solution to a Adobe Flex based solution in 2007."
      },
      {
        "name": "Børre Wessel",
        "biography": "Senior Consultant ( Adobe Consulting ) Worked with Perl and Java development for 3 years before joining Bekk Consulting in 2003 as an Interface and Java developer. Started with Flex development in 2005, and joined Adobe Consulting in April 2007"
      }
    ],
    "year": 2007
  },
  {
    "title": "Struts2 - Et testbart alternativ!",
    "level": "intermediate-advanced",
    "summary": "Testing havner veldig ofte i annen rekke når man utvikler web-relaterte applikasjoner i Java. Dette er gjerne på grunn av tett knytting mellom de(t) rammeverk som benyttes og selve web-containeren. Alle som har prøvd å lage mock-objects e.l. for Servlet-klasser kjenner seg mest sannsynlig igjen i dette. Ofte ender man opp med å si at \"vårt servlet-lag er så tynt, så vi trenger ikke teste det\", en påstand som gjerne er mer en unnskyldning enn realitet. Dette foredraget vil vise hvor lett det er å komme i gang og bruke Struts2/WebWork, med fokus på testing av webløsningen. Ved hjelp av verktøy som Maven2, FitNesse og Spring kan man bygge opp et svært fleksibelt og oversiktlig system, basert på automatiserte kravtester. Det blir utstrakt bruk av eksempler og kode.",
    "description": "Introduksjon til problemstilling - problemer med testing av web-applikasjoner (5 min) Oversikt over Struts2 (10 min) - Oversikt over Struts2 - Installasjon og oppsett - Hva er nytt fra forrige versjon? Oversikt over støtteverktøy (10 min) - FitNesse - Spring - Maven2 Testing av Struts2 applikasjon - vise ved hjelp av eksempler hvordan man bygger og tester Struts2 applikasjoner (20 min) - Enhetstest - Integrasjonstest - Kravtesting/akseptansetest Oppsummering & konklusjon (5 min) Q&A (10 min) Required experience: Erfaring med utvikling av web-relaterte Java-applikasjoner (JSP/Servlet). Gjerne noe erfaring med forskjellige web-rammeverk. Expected audience: Alle som jobber med utvikling av web-applikasjoner i Java. Både nye og mer erfarne brukere av Struts2 vil ha glede av foredraget!",
    "language": "no",
    "speakers": [
      {
        "name": "Eivind Waaler",
        "biography": "( BEKK ) Eivind Waaler har 8 års erfaring med utvikling og testing av Java og J2EE applikasjoner, hovedsaklig med et web-relatert fokus. Han har erfaring med de fleste største Java-baserte web-rammeverkene som brukes, og har de siste 3-4 årene vært en aktiv bruker av WebWork (nå Struts2). Eivind jobber til daglig som faggruppeleder og systemutvikler/arkitekt i BEKK, og har holdt foredrag på JavaZone de 4 siste årene."
      }
    ],
    "year": 2007
  },
  {
    "title": "Web 2.5 development with Java",
    "level": "intermediate",
    "summary": "Web 2.0 is one of the most important buzzwords in the last years, however what does this mean for Enterprise Java developers? Based on the practical case-study \"Parleys.com\" (a web 2.0 video streaming eLearning site) we'll have a closer look at which Java API's and frameworks are available to develop such a project. This first part of the presentation will start with an introduction on what Web 2.0 really is, followed with some Java related technologies used within the Parleys.com case-study. More specific we'll have a detail look at the state of the Dojo toolkit, how Flash with JavaScript integration can be accomplished, JSON and Confluence as a web 2.0 development platform. Ajax do's and don't s will also get covered based on the practical experience of several web 2.0 projects. The third part of the presentation will look at emerging Web 2.5 technologies that are appearing from vendors like Sun Microsystems, Google and Adobe focusing specifically on JavaFX, Flex2/Apollo and Gears.",
    "description": "Expected audience: Developers",
    "language": "en",
    "speakers": [
      {
        "name": "Stephan Janssen",
        "biography": "Stephan is the founder and chairman of the Belgian Java User Group since 1996 and founder of JavaPolis in 2002. He has been using Java since its early releases in 1995 with experience of developing and implementing real world Java solutions in the finance and manufacturing industries. He also founder and managing director of JCS Int. a Sun authorized Java Center with an exclusive focus on J2ME, J2SE and J2EE since 1997. JCS is also the very first Belgian Java company to speak at JavaOne 2003. He was selected by BEA Systems as the first European (independant) BEA Technical Director. He has also been recognized by the Server Side as one of the 54 Who is Who in Enterprise Java 2004. Sun has recognized in 2005 his efforts for the Java Community and has engaged me in the Java Champion project. He has spoken at numerous Java and JUG conferences including Java '98 (UK), JAOO '99 (Denmark), JavaDays 2000 (Norway), TMAB (Belgium), JavaPolis 2002-04-05, JavaOne 2003, SpringOne 2006, SAI, IT Works etc."
      }
    ],
    "year": 2007
  },
  {
    "title": "JavaScript Puzzlers - Is your IDE a Fifth Wheel or the Sixth Sense?",
    "level": "intermediate",
    "summary": "During this session Mike will challenge you with several JavaScript puzzlers. You will investigate some tricky parts of error-laden JavaScript code and see for yourself whether an IDE is just a useless \"5th wheel\" when struggling with errors like these, or if it could serve as your 6th sense and provide extra insight into code problems.",
    "description": "Expected audience: Developers.",
    "language": "en",
    "speakers": [
      {
        "name": "Mike Aizatsky",
        "biography": "( Jetbrains ) Mike Aizatsky is an accomplished speaker and advanced developer with nine years of Java Development experience to draw from. In his presentations, he has developed a knack for expressing challenging concepts in simple ways, so that his audiences walk away with new knowledge and a lot of ideas on how to apply it. Aizatsky received his Masters Degree with Honors in Mathematics in 2000, and now leads the Web and Enterprise Development Department of the IntelliJ IDEA project at JetBrains. He is a certified SCRUM master, and when he's not in front of a computer screen, enjoys playing jazz piano, hiking, and slalom rollerskating."
      }
    ],
    "year": 2007
  },
  {
    "title": "Apache Wicket: web applications with Just Java",
    "level": "intermediate",
    "summary": "Why stop object oriented programming at the web tier? Why settle for legacy ridden, prematurely optimizing, mind numbing frameworks when instead you could be having fun coding again? Enter Apache Wicket!",
    "description": "In this session, I will show you how you can use Apache Wicket to develop web applications with Just Java and Just HTML. I'll talk a bit about Wicket's philosophy and why it's developers believe it is important to take a novel approach. And then, because only code really talks, we'll take a deep dive to look at how to develop some custom, reusable components.",
    "language": "en",
    "speakers": [
      {
        "name": "Xavier Hanin",
        "biography": "Xavier Hanin is an independent software architect, developer and teacher based in Bordeaux, a beautiful city of France well known for its famous red wines. Over the years, Xavier has worked on a large spectrum of projects, mostly in Java, both private and open source. He is the creator of Ivy, currently incubating at the ASF, and Xooctory, a continuous integration server using Apache Wicket as web framework. He is also actively involved in the Wicket community, contributing to wicketstuff-push, databinder and wicketstuff-jquery."
      }
    ],
    "year": 2007
  },
  {
    "title": "AJAX made easy with DWR",
    "level": "beginner-intermediate",
    "summary": "Direct Web Remoting (DWR) is an open source AJAX library. Its focus is on the core of Asynchronous JavaScript and XML(AJAX) programming; communication between client and server without having to load a whole page for each interaction. DWR basically lets JavaScript invoke Java functions on a server just as they were JavaScript functions running on the browser. The library supports a wide range of frameworks like Spring, JSF and Hibernate. For more advanced applications it also supports reverse AJAX. This means that the server can “push” data to web browsers instead of just having to respond to requests from the browser. Despite all its features DWR is quite easy to use and get started with and fits well into most Java Web applications. Therefore it is one of the most widely used AJAX frameworks around. This presentation is meant as an introduction to DWR. Its first focus is on DWR's features with examples on how they can be used in web applications. The second focus is on how to set up and to create an application. This will be accompanied with a few hits and tips from the use of DWR on real world applications. The purpose is for the attendants to be able to start using the basic features of DWR after the presentation.",
    "description": "Introduction – 5-7 min About the presentation About the speaker A DWR teaser Presentation outline Features - 6 minutes Possibilities Examples – 9 minutes Exploring the features What can we use DWR for Set up – 6 minutes Getting ready for creating the application Demonstration – 12 minutes Creating a little application Some tips along the way – 5 minutes Learn from some common mistakes Summary – 2-3 minutes Questions and Answers - 10 minutes Required experience: Basic knowledge about HTML, JavaScript and Java Web application development. Expected audience: The presentation is for those that want to get an introduction to one of the best known AJAX frameworks we have today and have some knowledge about Java Web development. They will know how to start using DWR on AJAX applications.",
    "language": "en",
    "speakers": [
      {
        "name": "Stein Kåre Skytteren",
        "biography": "( Comperio ) Stein Kåre Skytteren have worked on several different projects using DWR. The largest spanning a year and taking DWR and AJAX to its limits. Transforming it from a good old thick client application with multiple simultaneous pages to a “thin” JavaScript application. All in order to making it easier for users to interact with web applications. His interests also involves testing web applications as he is one of the founders of CubicTest - an open source web testing tool. Stein Kåre is currently working as a consultant at Comperio. He's got a Master of Technology degree in Computer Science from NTNU and Bachelor of Business and Administration degree from TØH/HiST."
      }
    ],
    "year": 2007
  },
  {
    "title": "Building Enterprise Applications with JavaServer Faces, Spring, and JPA",
    "level": "intermediate",
    "summary": "For developers who are currently using Spring and JavaServer Faces together, this session explains how to handle common application development concerns such as conversational scope, transaction management, and application partitioning.",
    "description": "Specific tools such as Apache MyFaces Orchestra, Spring Annotations, and Spring WebFlow will be discussed. At the end of this session, developers will understand how to build a full-stack JavaServer Faces/Spring/JPA application with features similar to those of JBoss Seam.",
    "language": "en",
    "speakers": [
      {
        "name": "Kito D. Mann",
        "biography": "Kito D. Mann is editor-in-chief of JSF Central ( www.jsfcentral.com) and the author of JavaServer Faces in Action (Manning). He is a member of several Java Community Process expert groups (including JSF and Portlets), and an internationally recognized speaker. Mann is also the Principal Consultant at Virtua, Inc., specializing in enterprise application architecture, training, development, mentoring, and JSF product strategy. He holds a BA in Computer Science from Johns Hopkins University."
      }
    ],
    "year": 2007
  },
  {
    "title": "mBricks – effektiv utvikling av applikasjoner for mobilen",
    "level": "intermediate",
    "summary": "Gjennom dette foredraget vil dere få kunnskap om utvikling av applikasjoner for mobilen. Hvordan håndtere generelle problemstillinger som terminalforskjeller, minneforbruk, brukervennlighet osv. Vi ønsker å presentere hvordan vi i mBricks plattformen håndterer dette slik at du som applikasjonsutvikler blir mest mulig effektiv.",
    "description": "Innleding: mBricks, mobilmarkedet, produktet (5 min) Terminalforskjeller: Utfordringer, løsninger, en kode for alle terminaler, ulike implementasjoner av JSR’er (5 min) Minneforbruk: Begrenset minne, tips og triks for å holde minneforbruket på et minimum (5min) Brukervennlighet: Små skjermer, begrenset input muligheter, branding og pixelkontroll (5 min) Kommunikasjon: HTTP, TCP, UDP (5 min) Sikkerhet: Mobilkryptografi, lagring av sensitive data (5 min) J2ME vs. J2SE: Hovedforskjell mellom J2ME og J2SE (5 min) WAP vs. Java: Fordeler/ulemper (5 min) mBricks – en ny standard for mobilapplikasjonsutvikling: Hvorfor mener vi at mBricks bør bli en ny standard og hvordan har vi tenkt å gå frem for å få dette til å skje (5 min) Demonstrasjon: Kodeeksempler (5 min) Demonstrasjon: Applikasjoner utviklet vha. mBricks (5 min) Q & A (10 min) Required experience: J2ME og J2SE kunnskap Expected audience: Who should attend: Java utviklere, forretningsutviklere og personer med interesse for mobilapplikasjoner Benefits from attending: Økt kunnskap om J2ME, innsikt i utvikling av mobilapplikasjoner og markedet rundt dette.",
    "language": "no",
    "speakers": [
      {
        "name": "Pål Berg",
        "biography": "Product manager ( Teleplan – mBricks ) Pål Berg er produktleder for mBricks – et software bibliotek for utvikling av applikasjoner for mobilen. Han har en Siv. Ing. grad i fra NTNU og har ti års erfaring innen softwareutvikling i forskjellige programmeringsspråk. De siste tre årene har interessen vært på utvikling av applikasjoner for mobilen i Java. Spesielt har fokuset vært på å lage mobile entreprise applikasjoner."
      }
    ],
    "year": 2007
  },
  {
    "title": "Java mobile gaming API in enterprise applications",
    "level": "intermediate",
    "summary": "The JME/Canvas API has been a preferred API for mobile games due to responsitivity and total control over the mobile screen. Several Canvas frameworks have been made to speed up UI development. Some of these have been very successful and have resulted in superior applications, even for mobile enterprise applications. This presentation will focus on why the Canvas-platform is the best choice for mobile applications with rich user interfaces, and how strong authentication and secure communication can be integrated, forming an easy-to-use framework for enterprise mobility The presentation cover the JME client architecture in general and the Canvas API in special. Available Canvas frameworks will be explained, and there will be live demonstrations of example applications. A security architecture for banking and enterprise applications will be exploited, based on a Canvas framework and commercially available Java/JME security components",
    "description": "J2ME evolution (5 min) The JME client architecture (10 min) The Canvas API (10 min) Canvas Frameworks(10 min) Integrated security (5 min) Example applications and demo (10 min)",
    "language": "en",
    "speakers": [
      {
        "name": "Bjørn Sloth",
        "biography": "( Systek ) Bjørn Sloth works as a consultant and also as marketing manager in Systek. He holds a bachelor’s degree in Computer Science from University of Colorado and in economics from Norwegian School of Management. Bjørn has, since 1982, been involved in numerous development projects for Norwegian industry, the telecom sector and the bank/finance sector. He has been involved in mobile and mCommerce projects for the past 5 years and ”knows a lot about how the adoption of a mobile service can fail”."
      }
    ],
    "year": 2007
  },
  {
    "title": "Rapid 3d Game development with Java",
    "level": "intermediate-advanced",
    "summary": "Java has penetrated most areas in software engineering today, from small embedded device to large, distributed enterprise systems. However, one area where Java still is absent is 3D desktop games. This session will demonstrate how easy it is to write a complete 3D game using Java and show that it is a viable platform for writing real, commercial desktop games. It will focus more on the different software components and less on 3D APIs, so very little knowledge about OpenGL and 3D programming is required.",
    "description": "Presentation agenda Introduction to game demo Tools, APIs and frameworks Java OpenGL Custom scene-graph and loading of 3D models 3D navigation Collision detection Multi-player solution Required experience: Intermediate Java experience Expected audience: Anyone interested in writing 3D applications and/or games using Java Additional information: The game will be a very simple third-person shooter with multi-player support. The entire game, source code, models and textures included, will be available as open-source online after the conference.",
    "language": "en",
    "speakers": [
      {
        "name": "Erik Hellman",
        "biography": "( IBS JavaSolutions AB ) Erik Hellman is working as a Java Consultant for IBS JavaSolutions AB in Gothenburg, Sweden. He is a frequent speaker at JavaForum in Sweden and has also given a session on the Java bindings for the OpenGL API (JOGL) at JFokus 2007 (http://www.jfokus.se) and a session on rapid game development in Java at JavaOne 2007 (Session TS-3073)."
      }
    ],
    "year": 2007
  },
  {
    "title": "High performance Java with limited CPU and memory resources",
    "level": "intermediate",
    "summary": "Running Java with limited resources takes a different approax to selecting frameworks and getting good responsiveness from the applicaiton. Key decisions: Do not use persistence frameworks, database or other out of process storage Use the tools in in java.util.concurrency library for nonblocking algorithms To avoid locking and deadlocks, use message driven and asyncron Traditionally Java is used in areas with lots of memeory, CPU and disk, but there is no reason for not using Java when resources are limited.",
    "description": "What we mean by Embedded Software in TANDBERG The embedded setting A short introduction to video conferencing and protocols What consequences have limited CPU and memory and no harddrive Early decissions Benefits of Java outweights the negatives, e.g Garbage Collection hits and no predictable performance We need Java5 (wasn't available at decisions time, but SUN promissed later) Create a simple message driven asynchronose framework Fast, soft realtime and hard realtime What is Real time java, JSR-1? What is fast compared to real time Why we choose not to use JSR-1 What can be learnt from looking into a real time Java runtime. Challenges What is fast enough? How to handle large amount of messages? How to introduce Java in a C/C++ shop? The beauty of lean principles? Defer commitment and deliver fast Experience Java can be very fast The Java toolset is excelent Spring2 and JPA are not for everyone",
    "language": "en",
    "speakers": [
      {
        "name": "Espen Berger",
        "biography": "Software Architect ( Tandberg ) Espen Berger is working as a developer and software architect in TANDBERG. He has 10 years of experience and is currently responsible for defining the Java architecture for a TANDBERG project. Special interest are asynchronous, multithreaded and light weight programming."
      }
    ],
    "year": 2007
  },
  {
    "title": "Building Real Swing Applications",
    "level": "beginner-intermediate",
    "summary": "There is plenty of literature on Swing. However, we feel it pays too much attention to low-level technical details, and specific, isolated problem domains. This presentation will focus on the greater picture, the key design issues and their collaboration essential to creating viable applications; real applications. We will present our view on the essential design issues that need to be addressed and how all the pieces fit together. Even though we will talk about Swing, the presentation is suitable for anyone involved in rich application development. With more than twenty years of Java experience between them, this presentation will be given by Escenic's Harald Kuhr, part of the core team developing Escenic Content Studio, and Bouvet's Swing expert Yngvar Sørensen. Agenda Introduction Demo The essentials Application life-cycle Configuration and resource management Actions/commands and execution strategies Data binding Input validation Undo and redo Data transfer (cut/copy/paste, drag/drop) Other things to keep in mind Summary Q & A NOTE: The presentation will be given in Norwegian only.",
    "description": "Required experience: Some Swing programming preferred",
    "language": "no",
    "speakers": [
      {
        "name": "Harald Kuhr",
        "biography": "Senior Systemutvikler ( Escenic ) Harald jobber til daglig som senior utvikler i Escenic. Han har nesten 10 års erfaring med server-side Java-utvikling, både som konsulent og innen produktutvikling, men har gjenoppdaget gleden med å programmere etter at han begynte med klient-side Swing- programmering for rundt et år siden. Harald er med i javaBin styret, og har vært med å arrangere JavaZone de siste årene."
      },
      {
        "name": "Yngvar Sørensen",
        "biography": "Bouvet ( Bouvet ) Yngvar currently works as a consultant for Bouvet AS with Java experience since 1997. His primary fields of interests within the Java sphere are AOP and UI development, especially the combination of the two. In the past he has held talks on these subjects for javaBin as well as workshops and courses with customers across the country."
      }
    ],
    "year": 2007
  },
  {
    "title": "Experiences on using Spring WebFlow with JSF",
    "level": "intermediate",
    "summary": "When making large web application controlling page flow is traditionally not very flexible or maintainable in mainstream web framework like STRUTS or JSF. This talk shows how to use Spring Web Flow (SWF) to control flow and what benefits and problems we experienced on a large JSF-based project. The benefits include richer model for the lifecycle of objects and more configurable flow between web pages. The problems ranged from the usual headaches of using XML closely tied to Java classes, bugs in the current implementation and the need to make a good design for how the flow should be. The talk will discuss some of the limitations in SWF, like no support for inheritance, and provide some work-around’s. Description of SWD taken from www.springframework.org: “Spring Web Flow is a next generation Java web application controller framework. The framework provides a powerful system for implementing navigation logic and managing application state consistently across a variety of environments. Spring Web Flow is a component of the Spring Framework's web stack focused on the definition and execution of UI flow within a web application. The system allows you to capture a logical flow of your web application as a self-contained module that can be reused in different situations. Such a flow guides a single user through the implementation of a business task, and represents a single user conversation. Flows often execute across HTTP requests, have state, exhibit transactional characteristics, and may be dynamic and/or long-running in nature. “",
    "description": "Required Experience: Knowledge of JSF",
    "language": "en",
    "speakers": [
      {
        "name": "Holger Zobel",
        "biography": "Senior Manager ( Accenture ) Holger is a senior manager in Accenture’s Technology Architecture group and has worked with enterprise Java solutions for over 7 years. He is now leading the architecture group on the Norwegian Pension Project, which is one of Norway’s largest Java and SOA projects. The project is using Spring WebFlow and JSF to create an internet self service solution for government pensions."
      }
    ],
    "year": 2007
  },
  {
    "title": "How to develop an insurance sales web application in 6 months",
    "level": "intermediate",
    "summary": "This talk will explain how it was possible to develop an advanced and easy to use insurance sales web application in only 6 months, and at the same time ensuring adherence to good architecture principles and software development practices. The factors that that made the project a success and the lessons learnt in the following areas will be presented: Methodology and project organization GUI design and usability Architecture and technology Development tools and process The audience should gain a better understanding of how to set up and run a successful enterprise Java project.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Per Spilling",
        "biography": "Principal Consultant ( Objectware ) Per Spilling is a developer/architect/process mentor with 19 years experience in working with object technology (C++, Ada, Python, Actor, Concurrent C++, CORBA, Java). He is currently working as a principal consultant at Objectware in Oslo where he is responsible for the Core Java technology group and associated course and mentoring services. His main work related interests are lightweight architectures, DDD, agile methods and agile development tools. Per was ScrumMaster and hands-on architect on the Storebrand Skade project, and has been a member of the JavaZone program committee for the last 3 years."
      },
      {
        "name": "Kjartan Aanestad",
        "biography": "Kjartan is working as a senior consultant at Objectware AS and has about 6 years of programming experience primarily working with J2EE. He has lately been focusing on Service Oriented Architecture and services in specific."
      }
    ],
    "year": 2007
  },
  {
    "title": "Service Oriented Architecture – A Case Study",
    "level": "intermediate",
    "summary": "If you havent lived in a cave the last 2-3 years you have no doubt felt the buzz around SOA – Service Oriented Architecture. Perhaps you’ve seen the slides and white papers from evangelists and thought ’Thats all nice but what does it all mean?’. The talk aims to highlight that issue from a developers/architects standpoint and with basis in real life project experiences. The SCA (Service Component Architecture) initiative is quickly picking up speed as the best-practice way to implement service-oriented enterprise applications. Or put another way: SOA is growing up and getting a life. Get the dirt on SCA and find out how you can adapt to this step in the evolution of enterprise applications today by leveraging existing Java technologies.",
    "description": "Overview of SOA, challenges and visions, 5 mins Overview of the Service Component Architecture (Service Data Objects, SCA modules, Technologies etc), 15 mins Architectural Case Study – Real project experiences from adoption of SOA/SCA concepts within automotive, 30 mins Q & A, 10 mins Duration: 50 mins, 10 min Q&A Required Experience: The conceptual parts of the talk can benefit anyone involved in service-oriented development but to get full benefit of the case study part a good general working knowledge of Java Enterprise development is preferred. Expected Audience: Developers, Designers and Architects of Enterprise Applications with service-oriented ambitions. Although SCA is largely technology agnostic this talk is geared towards Java-based implementions.",
    "language": "en",
    "speakers": [
      {
        "name": "Mårten Haglind",
        "biography": "( Haglind Datakonsult ) Mårten Haglind has been active as an independent senior Java Enterprise application architect and mentor for over ten years. For the last two years contracted as Solution Architect for a large scale development effort of a new generation of production systems for a major swedish car manufacturer using Java, Spring and SOA. Based in Gothenburg, Sweden he also works internationally. Other engagements include speaking assignments, co-authoring books and a long standing relation as a much appreciated Java and Agile course author and instructor for Programutvikling of Oslo."
      }
    ],
    "year": 2007
  },
  {
    "title": "Simplicity - Lessons learned from enterprise application development",
    "level": "beginner",
    "summary": "Simplicity is perhaps the most important quality of software development. This session provides lessons learned from simplifications in an enterprise application development project. After more than two years of development the program seemed increasingly far from completion. Multiple re-planning exercises turned out to be futile. The projects were weighed down by complexity, preventing progress and destroying morale. The presentation will give concrete examples of how things can be done in a simple manner - as well as hideous examples of complexity - in areas such as platform and infrastructure, methodology and documentation as well as development, testing and change management. Why do you need a Business Process Engine when the standard Java Runtime is sufficient? How many people should be involved in deploying an application to system test? Should you roll your own component instead of acquiring a third-party library? Seeking simplicity in all areas is likely to result in considerable increased velocity, and arguably lead to increased maintainability and testability.",
    "description": "- Introduction - Simplicity is the opposite of complexity (5 min) - Simple platform - The JRE and lightweight frameworks (5 min) - Simple infrastructure - Redundancy, scalability and transactions (5 min) - Simple deployment - Self-contained and automated (5 min) - Simple design - Domain-Driven Design can lead to Big Design Up Front (5 min) - Simple documentation - Travel as light as you possibly can (5 min) - Simple functional testing - Tester Developers and Developer Testers (5 min) - Simple technical tests - The unit test from Hell, and other tests to avoid (5 min) - Simple code - Threading madness, and how TDD keeps you honest (5 min) - Simple development environment - Shrink-wrapped and ready to roll (5 min) - Simple operations - Start, stop, rollback and monitor (5 min) - Simple configuration management - Lists are waste; prevent bugs from slipping in (5 min) Required experience: The presentation will touch many areas of enterprise application development, from testing and development to infrastructure and deployment. Experience from a Java development project is recommended, but except a few examples the presentation does not require deep technical knowledge. Expected audience: The presentation is from an architects perspective, and should be relevant for developers, testers, project managers and architects.",
    "language": "en",
    "speakers": [
      {
        "name": "Trond Arve Wasskog",
        "biography": "Architect and Technology Competency Lead ( Bekk Consulting ) Trond Arve Wasskog is an architect and Technology Competency Lead at Bekk Consulting. He has been involved in Java and JEE application development for more than ten years, focusing on agile software development, testing and quality. Currently he is the architect of the NICS project at BBS"
      }
    ],
    "year": 2007
  },
  {
    "title": "Ajax i praksis -- en hvit tornado?",
    "level": "intermediate-advanced",
    "summary": "Ajax-teknikker gjør det mulig å gi web-applikasjoner et brukergrensesnitt som ikke tidligere lot seg realisere i en nettleser. 'Bygg for alle'-prosjektet har brukt Ajax for å realisere et svært dynamisk brukergrensesnitt for registrering og publisering av informasjon om tilgjengelighet i offentlige bygg. Dette erfaringsforedraget diskuterer hvordan Ajax påvirker MVC-arkitekturen til systemet, samt demonstrerer hvilke utfordringer man står ovenfor ved bruk og testing av Ajax-funksjonalitet.",
    "description": "- Bakgrunn og motivasjon for løsningen (5 min) - Arkitekturen i løsningen (10 min) - Datadrevet metamodell m/ dynamiske dialoger - Ajax og MVC - omfattende bruk av Ajax og asynkronitet i web-løsning - treeview er Ajax - alle dialoger under er Ajax-basert - Ajax og web-rammeverk - mister mye web-rammeverk funksjonalitet v/ bruk av ajax - hva vi valgte - Yahoo UI Library - Velocity - Spring MVC - Servlet - Hva vi ikke valgte - GWT - hot, men ferskt når vi startet prosjektet - metadatastrukturen vår kunne bli en utfordring - Erfaringer og gotchas (20 min) - Ivaretakelse av tilstand på flere nivåer i klienten - Asynkront kommandogrensesnitt basert på XML - Divider/scroll-bar problematikk - Enkoding-problematikk v/ dynamiske skjermbilder - Feilhåndtering og validering, tilbakemelding - Asynkront kommandogrensesnitt basert på XML - Retur av html til placeholdere - Nyttige utviklingsverktøy - Testing av Ajax-funksjonalitet (10 min) - Utfordringen med testing av JavaScript - Selenium + Fit - Testing mot flere browsere - Spørsmål (10 min) NØDVENDIG ERFARING: Noe erfaring med utvikling av web-løsninger er fordelaktig PUBLIKUM: Alle med interesse for moderne web-utvikling",
    "language": "no",
    "speakers": [
      {
        "name": "Christian Egeberg",
        "biography": "Seniorkonsulent ( Objectnet ) Christian har lang erfaring og kjernekompetanse innenfor mobile enheter, databaser, objektorientert utvikling, .Net og Open Source teknologi. Han har lang erfaring fra utvikling av trelags applikasjoner, web applikasjoner, web tjenester og SMS / MMS tjenester i Java og C#."
      },
      {
        "name": "Asbjørn Willersrud",
        "biography": "Konsulent ( Objectnet ) Asbjørn er konsulent og utvikler i Objectnet og har spisskompetanse innenfor objektorientert utvikling og utvikling av moderne webapplikasjoner. Asbjørn har mestergrad i informatikk fra Universitetet i Oslo."
      }
    ],
    "year": 2007
  },
  {
    "title": "High Availability through Simplicity",
    "level": "intermediate",
    "summary": "BBS develops and operates the systems behind the electronic payment methods that are available between and through the banks in Norway. We have a number of batch applications for processing transactions between accounts and banks, that communicate by sending messages. Clusterability, fail-over and total transactional integrity are natural requirements for both the applications and the communication infrastructure. We have developed a simple messaging solution with inherent fail-over capability and some load balancing, all running in the same transaction as the application's database access. Originally we started out with a commercial XA-compliant JMS solution, thinking it was the simplest thing that could possibly work. As we employed features such as fail-over, load-balancing and distributed transactions complexity and internal errors sky-rocketed. After about a year we gave up JMS and developed our own very simple solution. We think the reason for the success of our solution is simplicity and the fact that we only keep state the one place it belongs: the database. The talk will present how and why the BBS \"message pump\" works in unit tests and when clustered, and also why we think the JMS solution becomes more error-prone the more fail-over servers you add.",
    "description": "- Hello and intro - \"What do we do\": Bird's eye view of BBS's services and the Norwegian inter-bank infrastructure - Our base architecture/service abstraction: communicating void-method java interfaces - Mediating communication asynchronously with message-passing and claim-check pattern - The need for clusters, transactional integrity and guaranteed execution. - BBS Message pump: A simple pojo-based solution: design overview, state-management - Contrast: setting up and using High-Availability JMS - (if time allows: experience from development and operation of advanced JMS solutions) - Transaction state management with XA/distributed transactions and our experience from how it's solved in JMS - \"HA Transactional\" JMS will be less stable the more redundant servers you add - Conclusion: A note on how and where to manage execution state in transactional clustered solutions, and where NOT to keep it. Required experience General knowledge of distributed systems and transactions are required. Expected audience Developers and architects working with enterprise integration and/or systems including batch processing or order processing solutions.",
    "language": "en",
    "speakers": [
      {
        "name": "Erik Maus",
        "biography": "Developer ( BBS ) Eirik Maus is a developer at BBS since 2005, and a research scientist at Norsk Regnesentral before that."
      }
    ],
    "year": 2007
  },
  {
    "title": "Scripting in Java 6",
    "level": "beginner-intermediate",
    "summary": "Java SE 6.0 introduces Java Specification Request (JSR) 223, the Scripting for the Java Platform API, which allows you to evaluate scripts from within a Java application. Scripting languages have the advantage of being dynamically typed; they are in most cases interpreted, and do not require variable declaration or compilation. We will look into Project Phobos - a lightweight, scripting-friendly, web application environment running on the JavaTM platform. With Phobos, you can write web applications using several different scripting languages. The interactive development environment allows you to avoid explicit compilation and deployment steps, but still retain the power of the Java platform. After attending this session you should be able to harvest some of the advantages of the scripting API -for instance by starting to use the Phobos web application framework in your projects.",
    "description": "Outline Introduction (5min) ° JSR223 Examples of script programming on the Java platform (20min) ° JRuby ° JavaScript ° Velocity Phobos (20min) ° Lightweight, scripting-friendly, web application environment ° Demonstration Conclusions (5min) ° Summary ° Benefits Q&A (10min) Level Introductory / intermediate Required experience Curiosity Expected audience If you want to learn more about the scripting abilities in Java you should definitely attend this session",
    "language": "en",
    "speakers": [
      {
        "name": "Per Mengshoel",
        "biography": "Developer, architect ( Bekk ) Per Mengshoel works as a developer and architect for BEKK. With valuable experience from working with enterprise Java for nearly 10 years, he is now focusing on dynamic languages. He heads the Systems development competency group in BEKK"
      },
      {
        "name": "Thomas Heiberg",
        "biography": "Developer, architect ( Bekk ) Thomas Heiberg works as a developer and architect for BEKK and heads the Web architecture competency group in BEKK. His primary focus is simplifying web development in Java."
      }
    ],
    "year": 2007
  },
  {
    "title": "JavaScript erstattet med GWT. Hvordan gikk det?",
    "level": "beginner-intermediate",
    "summary": "Foredraget drøfter i hovedsak hvilke utfordringer som kan oppstå ved innføring av AJAX i en webapplikasjon, og hvordan disse ble løst ved bruk av Google Web Toolkit (GWT). Vi vil presentere versjon 1.0 av applikasjonen basert på JavaScript og tredjeparts AJAX biblioteker, samt endringene i versjon 2.0 ved innføring av GWT. Erfaringene fra versjon 1.0 sammen med nye krav gjorde at vi måtte velge en annen strategi for utvikling av versjon 2.0 av applikasjonen. Spesifikke områder som vil bli belyst er integrasjon mellom Spring MVC og Google Web Toolkit, og hvilke implikasjoner det får for systemets arkitektur. Vi vil også ta for oss kodeeksempler, byggstøtte, feilsøking og testmuligheter for begge versjonene. Siste del av foredraget tar for seg hvilke fordeler og ulemper vi ser ved innføring av GWT, og hvilke utfordringer vi står ovenfor ved videre utvikling av produktet.",
    "description": "1. Introduksjon - Foredragsholdere og introduksjon til prosjektet 2. Hovedinnhold - Versjon 1.0: Krav, valg av teknologi, arkitektur og utfordringer dette gav. - Versjon 2.0: Nye krav, nye valg av teknologier og ny arkitektur - Integrasjon mellom GWT og Spring. - Verktøy-/byggstøtte - Demo. - Fordeler og ulemper med valgt GWT løsning 3. Spørsmål og svar Required experience: Det kan være en fordel å kjenne til JavaScript. Tilhørere bør ha grunnleggende kunnskaper om AJAX, samt Google Web Toolkit. Det er også en fordel å ha kjennskap til Spring. Expected audience: Personer som har interesse av AJAX-løsninger.",
    "language": "no",
    "speakers": [
      {
        "name": "Kenneth Stigen",
        "biography": "Konsulent ( Accenture ) Kenneth jobber til daglig som konsulent i Accenture. Han har erfaring med Java/J2EE siden 2004 med fokus på mellomvare. Har vært utvikler på store prosjekter hovedsakelig innenfor telekom. Har jobbet med Google Web Toolkit siden oktober 2006."
      },
      {
        "name": "Håvard Timland",
        "biography": "Konsulent ( Bouvet ) Håvard jobber til daglig som konsulent i Bouvet ASA. Han har Java erfaring siden 2001 med fokus på webbaserte applikasjoner. Har vært utvikler i flere store Java prosjekter, hovedsaklig innenfor telekom."
      }
    ],
    "year": 2007
  },
  {
    "title": "Looking back to the future. Were is the industry 5 years from now, where do we want it to be?",
    "level": "beginner",
    "summary": "In this _interactive_ session we try to analyze where the industry is going in the next five years. Together we identify issues and enlighten them by using Edward de Bono’s thinking hats.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Martine Devos",
        "biography": "Organizational development consultant Martine Devos is organizational development consultant and trainer with comprehensive business background. She brought many projects and product development efforts back on track in both government and services sector. She has extensive managerial experience in both traditional and agile environments. She mastered successive waves of technology innovation to conceptualize, design and deploy mission critical business-focused ICT solutions in Fortune 500 companies and in the public sector. She trains and coaches teams in agile principles and practices of Scrum, Extreme Programming and Lean Software Engineering. For her first Scrum project – for the Belgian department of education, involving 500 schools -- she got the title of ICT manager of the year in 1998. She initiated and successfully implemented organizational and cultural change initiatives at both companywide and team level in multicultural environments. She has been Program Chair of EuroPlop, and frequent speaker at OOPSLA, ECOOP, TOOLS and JAOO conferences. She continues her research in the dynamics of projects and multi release product development and the impact of agile methods and estimation practices together with MIT and WPI graduate students."
      }
    ],
    "year": 2007
  },
  {
    "title": "Style and Taste in Writing FIT Documents",
    "level": "intermediate",
    "summary": "FIT is a framework that comes in various guises (Fit, Fitnesse, Fitlibrary), and can be used in different ways. The core principle behind writing FIT documents is to promote better communication between the stakeholders of a system. By using FIT, we can get our customers more involved in the design and specification. With the help of FIT documents, we will collaborate more closely and evolve a better shared understanding. As the system evolves, the collective set of FIT documents will provide a living specification - the place that everyone refers back to, to understand what the system actually does. In principle, using FIT is a good thing, but in practice we find that some teams struggle to use FIT documents effectively. Based on our experience, we provide our advice on what to focus on, and what to steer clear of when writing FIT documents in your team.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Mike Hill",
        "biography": "Mike is an Agile coach and software developer who has been developing software applications since 1993. He has been practicing Example-Driven Development for several years, and has a deep understanding of how to use FIT effectively. Originally Mike studied Maths at Oxford University before getting into computing during his MSc in Fluid Mechanics at Bristol University. He spent the first few years of his career learning how to make money on fixed price projects at Logica (now LogicaCMG). Since 2001 he has been helping Agile software development teams deliver working software. Mike is a presenter at international industry conferences and helps organize London XpDay."
      },
      {
        "name": "Steve Freeman",
        "biography": "Steve was a pioneer of Agile software development in the UK, he has built applications for banks, ISPs, financial data providers, and specialist software companies. He has given training courses in Europe , America, and Asia. Previously, he worked in research labs, software houses, earned a PhD, and wrote shrink-wrap software for IBM. Steve also teaches in the Computer Science department at University College London. He is a presenter and organizer at international industry conferences, and was conference chair for the first London XpDay."
      }
    ],
    "year": 2007
  },
  {
    "title": "Teaching Computers to Drive",
    "level": "beginner",
    "summary": "Imagine that you are responsible for driving a truck across America, along highways, through cities and around detours, dealing with whatever idiosyncrasies that weather and traffic might throw at you. Now imagine that your job is not to drive the truck, but program a computer to drive the truck for you. How would you go about turning over everything you know about driving to computer? Trying to plan a large software development effort is not much different than trying to plan the development of a software package to drive a truck across America – without access to the truck. In software development, we have been asked to solve too many truck-driving problems. And when it turns out that we have been handed an impossible problem, it’s usually the developers – not the process or the scale of the problem – that are held responsible for the failure. At its core, software development is the process of gradually finding ways to turn over more and more of what we know to computers so that we have more space left in our minds to discover ever more interesting things. This talk will look at successful development efforts on the scale of the truck-driving problem – the development of the Internet, for example – and offer a proven but neglected theory about how to develop complex software.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Mary Poppendieck",
        "biography": "Mary Poppendieck has been in the Information Technology industry for over thirty years. She has managed software development, supply chain management, manufacturing operations, and new product development. She spearheaded the implementation of a Just-in-Time system in a 3M video tape manufacturing plant and led new product development teams, commercializing products ranging from digital controllers to 3M Light Fiber™. Mary is a popular writer and speaker, and coauthor of the book Lean Software Development, which was awarded the Software Development Productivity Award in 2004. A sequel, Implementing Lean Software Development, was published in 2006."
      }
    ],
    "year": 2007
  },
  {
    "title": "Agile system development and standard contracts – practical experiences from large development projects",
    "level": "intermediate-advanced",
    "summary": "During the past 3-4 years BEKK has delivered many software development projects using an agile software development process - the majority contractually regulated by “Statens Standardavtale” or “PS2000”, but also regulated by other “proprietary” contracts. Agile and standard contracts have a very different approach to how some of the key processes should be organized and handled, and this can be a mine field if the parties involved are unaware and neglect spending the necessary time initially regulating those areas especially. In this presentation we will give the audience an insight in the knowledge and experience we have accumulated from both small and large engagements.",
    "description": "Introduction – key elements of standard contracts (5 min) Potential conflicts between standard contracts and agile software development (15 min) Pitfalls and experiences (30 min) Q&A (10 min) Required experience: Experience from software development in general, and agile software development in special. A basic understanding of the most common contracts used in Norway is also required to benefit most from this presentation. Expected audience: Anyone who is in the process of adapting agile software development where “Contract Negotiation” still is a significant part of the work involved.",
    "language": "en",
    "speakers": [
      {
        "name": "Reidar Sande",
        "biography": "COO ( BEKK ) Reidar Sande is COO at Bekk Consulting and has 14 years experience from complex system development and integration engagements -- the last five years focusing on agile software development. He is a PMP-certified project manager and a CSP."
      },
      {
        "name": "Frithjof Frederiksen",
        "biography": "Sales Director ( Bekk Consulting ) Frithjof Frederiksen is Sales Director at Bekk Consulting and responsible for sales, account management and contract negotiations. He has 12 years of experience from consulting in UK, USA and Norway. Frithjof is also an active member of various industry committees in Oslo."
      }
    ],
    "year": 2007
  },
  {
    "title": "From Bestimate to Estimate – techniques and perception management for estimators and their customers",
    "level": "beginner-intermediate",
    "summary": "Our reputation as estimators –even when we us agile methods -- is bad. Agile methods provide useful techniques and practices for teams and their customers to improve accuracy without creating illusions of precision. Many of our estimation problems come from misunderstanding and miscommunication about what estimates are and confusion with other related concepts like planning and targets. Where do errors come from, what can we promise and how do we best serve the primary purpose of software estimation process?",
    "description": "Intro – a typical conversation about estimates. 5 min What is an estimate (accuracy, precision, … a glossary) (15 minutes with quiz) Estimation purpose and how much estimation do we need (10 min) Techniques for estimation (10 min) Techniques to talk about talk about our estimates  – perception management (10 minutes) Q and A – capita selecta Required experience: All levels interested in estimation – as estimator and as customer of estimates. Expected audience: All involved in estimation and planning processes and sales, managers and executives who expect and use the results of that process.",
    "language": "en",
    "speakers": [
      {
        "name": "Martine Devos",
        "biography": "Organizational development consultant Martine Devos is organizational development consultant and trainer with comprehensive business background. She brought many projects and product development efforts back on track in both government and services sector. She has extensive managerial experience in both traditional and agile environments. She mastered successive waves of technology innovation to conceptualize, design and deploy mission critical business-focused ICT solutions in Fortune 500 companies and in the public sector. She trains and coaches teams in agile principles and practices of Scrum, Extreme Programming and Lean Software Engineering. For her first Scrum project – for the Belgian department of education, involving 500 schools -- she got the title of ICT manager of the year in 1998. She initiated and successfully implemented organizational and cultural change initiatives at both companywide and team level in multicultural environments. She has been Program Chair of EuroPlop, and frequent speaker at OOPSLA, ECOOP, TOOLS and JAOO conferences. She continues her research in the dynamics of projects and multi release product development and the impact of agile methods and estimation practices together with MIT and WPI graduate students."
      }
    ],
    "year": 2007
  },
  {
    "title": "An Agile Approach to Requirement Specification",
    "level": "beginner",
    "summary": "We started of with a brief project description sounding something like this: “Our current intranet is out of date and we need a new one to meet our current needs”. Together with the customers project manager we toured the company and performed a number of workshops and interviews, gathering only the high level information we needed to specify and prioritize the “most wanted” requirements as User Stories. Using techniques as Behavior Driven Development, User Stories, MoSCoW prioritization, Planning Poker and a lot of facilitation we developed the requirement specification, without tons of documentation and months of work. No thick documents. No nitty gritty details. Only simple and clearly defined goals, user stories, estimates and a high-level plan for the project well anchored with the sponsors – and employees. The project is accepted and will now continue with the detailing of user stories to acceptance tests for implementation along the iterations - until the customer has the intranet they need. This talk is about how an agile specification approach and a team based on trust can specify the necessary requirement in a few weeks with same – or better – results, as opposed to spending months on detailed documentation. By the time Tom does his talk the project will be done and he will share the actual results with you. Was this agile requirement specification approach really that good? What could have been improved?",
    "description": "OUTLINE Project background - (5min) The Challenge – “Our intranet is falling apart – we have no time to loose!” (10min) The Process – “We need to prioritize and figure out where we can start – without knowing all the details” (25min) The Result – “20 hand written user stories – will it do?” (10min) Q & A (10min)    Required experience: Experience from system development projects   Expected audience: Systems Developers, Project Managers, Technical Project Managers, Business Analyst",
    "language": "en",
    "speakers": [
      {
        "name": "Tom J. Bang",
        "biography": "project manager ( Bekk Consulting ) Tom J. Bang is a project manager and co-founder of Bekk Consulting (Norwegian IT- and management consulting company with 160 employees). He has 10 years project leadership experience from software development and started his career as a systems developer. He also has years of experience in roles like technical project manager, functional advisor and information architect. As a project manager and coach he has ten years experience with implementing IT-systems into organizations and was responsible for adapting agile methodologies into his company."
      }
    ],
    "year": 2007
  },
  {
    "title": "Five practical solutions to Agile myths",
    "level": "intermediate",
    "summary": "The results are in ... Many ideas in the Agile canon and folklore can actually decrease your velocity or can slowly posion your code. Other contemporary fads have well-known pitfalls that have been forgotten since their last round of popularity. In this talk I look at five of these common practices, why they are harmful, and how to avoid their pitfalls:",
    "description": "TDD: Use lightweight architecture and an appropriate scope of testing to avoid architecture rot, high test maintenance cost, and usability problems. YAGNI: Use Case Slices and lightweight architecture can help avoid being blind-sided On-Site Customer: Add a product owner to avoid burning out both the customer and the team. User Stories: Instead of deferring detailed scenario development to your development during TDD, use Use Cases to bring the analysis out to the person who matters: the market constituency Domain-Specific Languages: Take the value from the analysis and run with it; sometimes, building a domain engineering environment buys you only cost and headaches These remedies work well with each other. Required experience : Some level of immersion in an industrial software development project. Expected Audience and Benefits : These simple tips will help the audience think about and avoid common pitfalls. It's not rocket science, but it's solid information that can help projects avoid getting into trouble.",
    "language": "en",
    "speakers": [
      {
        "name": "James O. Coplien",
        "biography": "Senior Agile Coach ( Nordija ) James Coplien is Senior Agile Coach at Nordija and has recently been making focused inquiries into the failures of TDD in numerous consulting clients, and through focuses workshops and Open Space sessions at conferences such as QCon and the ACCU Conference."
      }
    ],
    "year": 2007
  },
  {
    "title": "Scalable, Distributed, Outsourced, and CMMI Level 5: Some of the best scrums",
    "level": "intermediate",
    "summary": "The most productive large software project ever documented with over 1,000,000 lines of code was delivered by distributed, outsourced Scrum teams based in the U.S. and Russia. It was linearly scalable, directly contradicting the \"Mythical Man Month\" assertion that adding more people to a project that was late makes it go slower. A CMMI Level 5 company has gone totally to Scrum achieving linear scalability, doubling productivity, and deliverling 40% fewer defects with higher customer satisfaction. This presentation will make the case that the larger and more complex the project, the more benefits achievable with Scrum.",
    "description": "Expected audience: People interested in hearing about the best scrums in the world.",
    "language": "en",
    "speakers": [
      {
        "name": "Jeff Sutherland",
        "biography": "CTO & Worldwide Scrum Consulting Practice Manager ( PatientKeeper, Inc ) Certified Scrum Trainer and Co-Creator of the Scrum Development Process See: http://www.infoq.com/presentations/The-Roots-of-Scrum"
      }
    ],
    "year": 2007
  },
  {
    "title": "Java Community Process and Open Source",
    "level": "beginner",
    "summary": "This session will bring some clarity into the myths and reality of JCP and Open Source. - The \"Magic Triangle\" of a JSR - Licensing a Reference Implementation - Open JDK and JCP are just some examples of the topics that will be presented during this session.",
    "description": "Expected audience: all delegates",
    "language": "en",
    "speakers": [
      {
        "name": "Massimo Lanfranconi",
        "biography": "( Sun Microsystems )"
      }
    ],
    "year": 2007
  },
  {
    "title": "Enough of Processes -- Let’s Do Practices",
    "level": "intermediate",
    "summary": "The world of software development is constantly changing and evolving. New ideas arise all the time and existing ideas go in and out of fashion. Software development processes find it very hard to keep up with this rapid rate of change, especially as they find themselves quickly going of fashion or becoming bloated as they bolt on more and more information. Teams find themselves struggling as they try to mix-and-match practices from various sources into a coherent way-of-working or work out where to start their improvements.",
    "description": "A new approach to capturing and sharing experience is required, one where: 1. Practices are First Class Citizens, 2. Practices can be made smart to truly help the developers in their work, 3. Practices can be used individually or in a multitude of combinations 4. Process is just a composition of Practices, and 5. Teams compose the process they need by selecting just the practice that they want to use To enable this a number of innovations are required: innovations related to the way that practices are collected, presented and applied. We will introduce the new paradigm and its support by EssWork which is an environment for working with practices. In doing so we will demonstrate how the Essential Unified Process is composed as a collection of eight separate practices. This talk promises to explore the outer limits of modern software development practices whether they come from the software engineering camp or from the social engineering (agile) camp.",
    "language": "en",
    "speakers": [
      {
        "name": "Ivar Jacobson",
        "biography": "( Ivar Jacobson International ) Dr. Ivar Jacobson is a father of components and component architecture, use cases, aspect-oriented software development, the Unified Modelling Language and the Rational Unified Process. He is the principal author of six influential and best-selling books. Ivar Jacobson is the chairman of Ivar Jacobson International which has subsidiaries in the US, UK, Korea, China, Singapore, Australia, Norway and Sweden. Ivar Jacobson Consulting, USA, UK, Korea, China, Singapore, Australia and Sweden"
      }
    ],
    "year": 2007
  },
  {
    "title": "Rasjonelle beslutninger ved valg av metoder, teknikker og verktøy",
    "level": "intermediate",
    "summary": "Dårlige valg av metoder, teknikker og verktøy i systemutviklingsprosjekt kan ha alvorlige konsekvenser, for eksempel i form av lav produktivitet og kvalitet. Beslutninger ved valg av metoder og verktøy bør derfor i størst mulig grad være basert på gyldige forskningsresultater og systematisk innhenting og kritisk vurdering av erfaringer, dvs beslutningene bør være ”evidensbaserte”. Utgangspunktet for presentasjonen er at hyppig benyttede informasjonskilder, slik som guru-uttalelser, demonstrasjoner og referansekunder, lett gir et feilaktig bilde av gevinster og ikke minst at svært få innen IT-bransjen har fått opplæring i bruk av evidensbaserte beslutningsprosesser. Presentasjonen vil inneholde praktiske øvelser med formål å bedre deltakernes evne til å:1) formulere problemstillinger som utgangspunkt for valg av metoder, teknikker og verktøy, 2) innhente relevant og balansert informasjon fra forskning og praksis, og 3) vurdere informasjonens og argumentasjonens gyldighet i forhold til valg problemstilling.",
    "description": "1) Øvelsesoppgaver (10 minutter) 2) Eksempler på typiske prosessmangler ved valg av metoder, teknikker og verktøy. (5 minutter) 3) Kort øvelse relatert til vurdering av argumentasjon i tekst skrevet av høyt profilert XP-aktør. Brukes til å illustrere mangler mhp hvordan vi leser og vurderer argumentasjon, og hvor lett vi dermed blir påvirke av retoriske og markedsføringsmessige virkemidler. Gjennomgang av sjekklister og gode råd for hvordan vi bør vurdere argumentasjon av denne typen. (15 minutter) 4) Gjennomgang av stegene for evidensbasert systemutvikling. Applisert på valg av metoder og verktøy. (15 minutter) 5) Gjennomgang av øvelsesoppgaver fra 1) + spørsmål. (15 minutter) Expected audience: Utviklere, arkitekter og prosjektledere som ønsker å ta bedre beslutninger.",
    "language": "no",
    "speakers": [
      {
        "name": "Magne Jørgensen",
        "biography": "( Simula Research Laboratory ) Magne Jørgensen er utdannet sivilingeniør fra Universitetet i Karlsruhe og har en doktorgrad i informatikk fra Universitetet i Oslo. Han har tidligere jobbet som programmerer, prosessforbedringsleder og prosjektleder i Telenor og Storebrand, og er nå professor ved Simula Research Laboratory. Forskningsfokus er på estimering av IT-prosjekter og på ekspertvurderinger. Sammen med Barbara Kitchenham og Tore Dybå har han lansert metoden \"Evidence-based software engineering\". Han underviser i denne metoden både på Høgskolen i Rena og Universitetet i Oslo."
      }
    ],
    "year": 2007
  },
  {
    "title": "Contributing to Open Source - What's in it for me",
    "level": "beginner",
    "summary": "Open source software is used in almost all new software development projects. However, a strategy for contributing back to the open source communites is often missing. When talking to business managers and developers, one of the key questions is often \"what is in it for me?\". In this presentation I will address this question both from a programmer's and from a manager's perspective. I will also debate licensing and intellectual property issues and the process of how to get involved in open source development.",
    "description": "Outline Why contribute from a developer perspective from a business perspective The contribution process, how to get involved To fork or not to fork, that is the question Creating patches How to maintain patches while awaiting committer approval Licensing and IP issues Q&A - 10 min Expected audience This session targets business managers, project managers and software architects and/or developers curious of how to embedd Open Source in their business stragegies",
    "language": "en",
    "speakers": [
      {
        "name": "Kaare Nilsen",
        "biography": "Kaare Nilsen is a software developer and architect. He has more than 10 years of programming experience and currently focuses on Open Source, AOP and lightweight component containers. He is a frequent presenter on various Java and Open Source topics, and is a active member in the Open Source community focused on the maven ecosystem hosted at codehaus.org"
      }
    ],
    "year": 2007
  },
  {
    "title": "Governing in a SOA world - a role play",
    "level": "intermediate-advanced",
    "summary": "PS: Send mail til totto@objectware.no dersom du har tenkt å delta på denne BOF-en!! Her blir det Governance in action, med både Govenors, Auditers, Policy Advisory Board, IT-sjefer, stressa prosjektledere og overarbeidete utviklere - og en vil få demonstrert effektene av brudd på viktige policy regler for både løsning og arkitektur. Med andre ord, så har vi et klassisk rollespill rundt arkitektur, design og konsekvenser i den virkelige verdenen.",
    "description": "Agenda: Utdeling av rollebeskrivelser til deltakerene Gjennomgang/intro av caset I: Designmøte rundt nytt krav o quick-fix strategien blir valgt II: Governance QA-møte, o nytt design i tråd med Governance Policies blir påtvungt prosjektet III: Prosjektmøte: o krisemaksimering fra prosjektleder, krigen starter IV: Prosjekteiermøte: o Governance policy blir klaget inn til Policy Advisory Board (PAB) V: Møte i PAB, o policy blir videreutviklet, incentiver og begrunnelse for regel blir forvaltet/videreutviklet VI: Prosjektmøte, o Policy blir ignorert av prosjektleder VII: Project retrospect o Gjennomgang av tid/kost viser sterkt svekket endringsdyktighet, og høy feilrate rundt implementering av det nye kravet",
    "language": "no",
    "speakers": [
      {
        "name": "Thor Henning Hetland",
        "biography": "Sjefskonsulent ,Java Champion og president i javaBin ( Objectware AS ) President of the very successful Norwegian JUG javaBin. Sun Java Champion and Community Leader on java.net. Totto's leadership the JUG has built a very strong Java community in Norway, with hundreds of active members. javaBin has monthly meetings with international and local experts, runs one of the very best non-English Java sites (www.java.no) and annually hosts the JavaZone conference (www.javazone.no). Speaker on several conferences including JavaZone, OMG Information Days, the Software conference and various others. With over 20 years of professional programming experience spanning quite a few programming languages he has contributed in both international and domnestic projects in various roles, including project leader, technology mentor, software architect, lead developer, technology strategist and trainer. In total Totto probably is the premier Java Champion in Scandinavia..."
      }
    ],
    "year": 2007
  },
  {
    "title": "Avansert kontinuerlig integrasjon for å få mer stabile tjenester og realisere gjenbruk",
    "level": "intermediate",
    "summary": "Som utvikler av en tjeneste er man interessert i når endringer gjør den inkompatibel med prosjekter som avhenger av tidligere versjoner. Vi vil presentere et konsept som går ut på å få bedre kontroll over slike endringer. Dette gjøres ved å kontinuerlig bygge prosjekter med flere versjoner av en tjeneste. Automatisering blir nødvending når antall prosjekter som er avhengig av tjenesten øker, og/eller vi ønsker å se på avhengigheter til flere tjenester. En Proof-of-Concept implementasjon basert på Continuum vil bli demonstrert. Tilhørerne kan forvente å lære hvordan avansert kontinuerlig integrasjon kan gi mer stabile tjenester. Vi vil også beskrive hvordan, og hvorfor, denne teknikken kan gi høyere tjenestekvalitet og bidra til økt gjenbruk. Stikkord: Kontinuerlig integrasjon, Continuum, Maven, komponent-orientert utvikling, versjonering",
    "description": "Skissere bruksområdet - Hvorfor er automatisering nyttig? (5min) Forklare konseptet - vise avhengighetsgrafer (10min) Svært kort introduksjon til teknologien utnyttet i PoC-en (Maven, Continuum og versjonering i Maven) (5min) o Egenskaper ved Maven og Continuum som legger til rette for implementasjon av konseptet Implementasjonen i grove trekk (10min) Vise demo (PoC) (10min) Nytteverdi (10min) Required experience: Grunnleggende kjennskap til Mavens Project Object Model (POM) og kontinuerlig integrasjon (CI). Expected audience: Utviklere og prosjektledere som ønsker å lære en ny CI teknikk.",
    "language": "no",
    "speakers": [
      {
        "name": "Erik Drolshammer",
        "biography": "Konsulent ( Objectware ) Erik er utdannet: Sivilingeniør i Datateknikk ved NTNU. (Ferdig juni 2007.) Han har gjennom to år hatt et frivillig verv som utvikler og prosjektleder hvor jeg har fått erfaring med bruk av Maven, Ant, Continuum, Spring og Hibernate."
      }
    ],
    "year": 2007
  },
  {
    "title": "Modelldrevet (MDD) og Agile prosesser – ”perfect match”.. eller... ?",
    "level": "intermediate",
    "summary": "Agile utviklingsprosesser har som utgangspunkt å tilby applikasjoner som er designet for å håndtere hyppige endringer i forretningsprosessene de skal støtte. Et av hovedpunktene i det agile manifestet, er å ønske endringer velkommen. Gjennom en iterativ utviklingsprosess skal applikasjoner utviklet gjennom en agile prosess raskt kunne tilbys kunden. En modelldrevet utviklingsprosess har som målsetting at man gjennom modellering skal kunne beskrive forretningsområdet som applikasjonen skal støtte. Videre skal man gjennom automasjon kunne transformere teknologiuavhengige løsninger over i et teknologispesifikt miljø, som så danner grunnlaget for genereringen av basisfunksjonaliteten i applikasjonen. Der den agile metodikken ønsker mest mulig ”hands on” gjennom hele utviklingsprosessen, baserer den modelldrevede metodikken seg i stor grad på automasjon. Dette er på mange måter to tankesett som står langt fra hverandre i innhold. Uansett, den uttalte målsettingen til begge utviklingsmetodikkene er å forbedre effektiviteten i prosessen og kvaliteten av det endelige resultatet. Siden begge metodikkene har den samme målsettingen, er det interessant å se hvordan man eventuelt kan bruke disse metodikkene - i en og samme prosses. Målsettingen til dette fordraget er derfor å se de på mulighetene man oppnår gjennom å kombinere agile utvikling med modelldrevet utvikling. Videre hvordan man kan nyttegjøre seg det beste fra begge ”leire”. Samtidig vil det bli rettet spørsmålstegn ved noen av de tradisjonelle ankepunktene knyttet til modelldrevet utvikling. Som f.eks at man trenger et veldig omfattende designarbeide i forkant av utviklingen, eller at kodegenerering tar bort friheten til den enkelte utvikleren.",
    "description": "",
    "language": "no",
    "speakers": [
      {
        "name": "Christoffer Daae-Qvale",
        "biography": "Seniorkonsulent ( Mesan ) Som student ved UiO skrev Christoffer hovedfagsoppgave om modelldrevet utvikling og verktøystøtte til dette. Videre har han vært foredragsholder for Matergradsstudenter ved UiO om samme tema. Han har også holdt foredrag i Dataforeningen om dette fagområdet. Gjennom ulike utviklingsprosjekter i Mesan, har Daae-Qvale også opparbeidet seg en interesse for Agile utviklingsmetodikk og hvordan man best kan tilpasse denne til det enkelte prosjektet. I løpet av våren vil Daae-Qvale ta en sertifisering som Scrum master"
      }
    ],
    "year": 2007
  },
  {
    "title": "NM i estimering 2007",
    "level": "beginner",
    "summary": "Fjorårets norgesmester, Sindre Mehus, forsvarer tittelen i denne sesjonen hvor forskerne fra Simula kårer årets Norgesmester i estimering. Som i fjor blir det en interaktiv sesjon med intrikate oppgaver, og finalistene kan glede seg over gavekort fra byens bedre restauranter. Det blir også en kort demonstrasjon av hvor lett det er å manipulere anbudsrunder.",
    "description": "Expected audience: Ingen forkunnskaper er nødvendig.",
    "language": "no",
    "speakers": [
      {
        "name": "Stein Grimstad",
        "biography": "Key Account Manager Stein Grimstad received the PhD degree in Informatics from the University of Oslo, Norway in 2006. He has 10 years' industry experience as software developer and solution architect. He is now a research scientist at Simula Research Laboratory in Oslo, Norway and an adviser at Objectnet AS. His research interests are software engineering and, in particular, software cost estimation."
      }
    ],
    "year": 2007
  },
  {
    "title": "JRuby on Rails",
    "level": "beginner",
    "summary": "Did you know you can run a Ruby on Rails application inside a Java Servlet container with the help of JRuby? Aslak will give a quick demo of how it's done and facilitate a discussion about why this is important for traditional Java shops",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Aslak Hellesøy",
        "biography": "CTO ( Bekk ) Aslak Hellesøy is the CTO of BEKK Consulting. Aslak has contributed to over a dozen Java and Ruby open source projects and is a passionate practitioner of agile development."
      }
    ],
    "year": 2007
  },
  {
    "title": "Maven, mer enn et byggesystem",
    "level": "intermediate",
    "summary": "Maven er mer enn et vanlig byggesystem - det er et verktøy som kan gi merverdi rundt firmaets forettningsregler og krav. Ved å benytte de mer avanserte mulighetene Maven tilbyr er det for en organisasjon mulig å implementere og automatisere foretningsregler, som en integrert del av utviklingsprosessen. En sentral del av Maven er muligheten til å utvide funksjonaliteten ved bruk av plugins. Jeg vil i dette foredraget gi en introduksjon til hvordan man kan, med å skrive egne og/eller benytte seg av eksterne plugins støtte oppunder bedriftens byggebehov og forretningsregler. Eksempler på dette er kontrollering av lisenser, innføre krav til pakking av programvaren og validere/godkjenne tredjepartsbiblioteker. Jeg vil gi en oversikt over den utviklingen som skjer av Maven 2-plugins idag og hvordan man kan ta del i miljøet. I løpet av foredraget vil jeg gå i gjennom plugin-APIet og vise hvordan dette kan brukes til å utvikle plugins, som muliggjør praktisk inføring og garantering av regler som en del av en utviklingsprosess.",
    "description": "",
    "language": "no",
    "speakers": [
      {
        "name": "Kristian Nordal",
        "biography": "Developer ( Arktekk ) Kristian Nordal jobber til daglig hos Arktekk, som Java-utvikler med hovedfokus på open source og smidig utvikling. Han er commiter på Codehaus sitt prosjekt for Maven-plugins og har i flere år deltatt i utviklingen av Maven 2-plugins, som for eksempel den første pluginen for Jetty5 og appassembler-pluginen."
      }
    ],
    "year": 2007
  },
  {
    "title": "Choosing the right framework for your web-application",
    "level": "intermediate",
    "summary": "Ever since Struts, Web application development has changed : Web 2.0, and especially Ajax, has a big momentum, the introduction of JavaServer Faces in the new Java EE 5 stack has brought us new frameworks and concepts, while RAD has become a major factor to decision makers... Frameworks and tools available today have become more powerful, but also more complex. Hence choosing a framework for your web application has never been as difficult and important as today. Besides all these new functionalities, browser compatibility, URL friendliness, session management and the like remain as important to public web application developer as before. This session aims at sharing the information and experiences on frameworks available today, whether they builds upon Servlets or JavaServer Faces, but also those that will emerge in the future. We will emphasis on all the aspects of web application development and illustrate how different framework (such as Shale, WebWork aka Struts 2 and Rife among others) address those aspects in order to ease your web application development. This session will try to cover all different aspects of today's web-application development. Each aspect will be illustrated by how one of the available frameworks approaches it and solves it to enable the developer to focus on his part of the job: developing a high-quality web-application.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Alexander Snaps",
        "biography": "Software engineer and Java EE specialist ( 101 Solutions ) It is in 1987 in Munich, Germany that Alexandre Snaps discovers his natural ability for computer languages and starts their studies and gets involved in different Open Source projects. In 1999, he plunges into web development and three years later, he starts his own business, 101 Solutions (formely known as DOG7), focused on enterprise integration. He is developing web-applications for over ten years and using Java for more than seven years."
      }
    ],
    "year": 2007
  },
  {
    "title": "Hvordan holde seg oppdatert på Java fronten",
    "level": "beginner",
    "summary": "Hver 17. mnd kommer det en ny versjon av Java. Java Community Process er aktiv som aldri før - 700 personer/firmaer bidrar kontinuerlig til Java Spesification Requests. Nye språk kommer inn i den offisielle platformen (Groovy, JRuby, Scala) og et hav av rammeverk er tilgjenglig for deg som utvikler. Hvilke av de 323,000 treffene på \"Java framework\" i google er relevante? Hvilke av de 272,000,000 linkene om Java burde DU ha lest?",
    "description": "Sitter du i tidsklemma og sliter med å følge med? Få gode tips og kilder på hvordan henge med. Etter en kort innledning prøver vi i fellesskap å finne de beste metodene for å finne informasjonen, slik at du kan beholde nattesøvnen intakt.",
    "language": "no",
    "speakers": [
      {
        "name": "Knut Erik Borgen",
        "biography": "Konsulent ( Objectnet ) Degree in computer science (Cand. Scient.) from University of Oslo, Insititute for Informatics. Full time Java consultant since 2000. Currently employed by Unified Consulting. Passionate interest in computer science, particularly computer languages, with Java in particular."
      }
    ],
    "year": 2007
  },
  {
    "title": "Analyzing Complex Project Structure with Dependency Matrix",
    "level": "beginner-intermediate",
    "summary": "Development tools, Software engineering lifecycle Being able to understand and maintain good project structure is the major requirement in large and healthy projects. At this BOF you will be presented a Dependency Structure Matrix - a scalable and highly efficient tool for visualizing and analyzing complex project dependencies. Various dependency patterns will be shown together with methods for coping with them.",
    "description": "Required experience: none",
    "language": "en",
    "speakers": [
      {
        "name": "Mike Aizatsky",
        "biography": "( Jetbrains ) Mike Aizatsky is an accomplished speaker and advanced developer with nine years of Java Development experience to draw from. In his presentations, he has developed a knack for expressing challenging concepts in simple ways, so that his audiences walk away with new knowledge and a lot of ideas on how to apply it. Aizatsky received his Masters Degree with Honors in Mathematics in 2000, and now leads the Web and Enterprise Development Department of the IntelliJ IDEA project at JetBrains. He is a certified SCRUM master, and when he's not in front of a computer screen, enjoys playing jazz piano, hiking, and slalom rollerskating."
      }
    ],
    "year": 2007
  }
]
