[
  {
    "title": "A software craftsman gets things done!",
    "level": "beginner",
    "intendedAudience": "Any aspiring software craftsmen who want to be more organized with their daily routines as well as their professional and personal development. Participants will get an introduction to the GTD workflow and useful tips for GTD tools. No prior knowledge is expected.",
    "summary": "Software craftsmen learn continuously to keep adding value to his current work and repertoire. Getting Things Done (GTD) workflow helps software craftsmen to get organized with their responsibilities as well as their professional and personal development in a stress free way.",
    "description": "As aspiring software craftsmen you learn continuously, catching up with the existing and new things that can add value to your current work and repertoire. Let’s say you read a tech article or listen to an episode of your favorite podcast and find yourselves with references that inspire you to check further. What do you do to make sure that you will give those ideas enough attention to decide effectively whether you want to act on it or not? Do you keep a mental “check-later” list and never actually check them because you simply forget it or too busy to get back to it? Getting Things Done (GTD) system presents a workflow that will help us get organized with our responsibilities as well as our professional and personal development, based on the natural way we deal with our work: we (1) \"collect\" things that command our attention; (2) \"process\" them to know what they mean and what to do about them; and (3) \"organize\" the results, which we (4) \"review\" as options for what we choose to (5) \"do\". One of the challenges to get organized in the conventional ways, like making list and schedules, is that we tend to do all the five phases at one time. Selecting too early will list out things we consider unimportant relative to other “critical” things on the list or simply because we don’t know how to act on it now. Leaving things open will take up energy and prevent us from having a totally effective, clear focus of what is important. Since the first time GTD was invented, tools have been created to make it easier to implement GTD as part of our daily life with the least interruption. We will have a look at some of the available tools in comparison.",
    "room": "Room 7",
    "keyWords": [
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Irwan Syahrir",
        "biography": "A Java developer, born in Java island of Indonesia, with 6 years of development experience in various projects. A software craftsmanship enthusiast. A user of GTD since my student days."
      }
    ],
    "year": 2013
  },
  {
    "title": "Anxious Cows in ClojureScript",
    "level": "advanced",
    "intendedAudience": "Clojure developers will benefit from an exploration of ClojureScript and a detailed explanation of an agent model written in the language. Developers interested in Clojure or ClojureScript will benefit by seeing how a real program is structured, and looking at the tools and techniques used to build it.",
    "summary": "ClojureScript is a dialect of Clojure built especially for rich front-end applications in the browser. What better application to show than an agent model of cows inside an electric fence? We'll take a good look at an exciting language and learn useful principles to help us keep the anxiety level of our herd as low as possible.",
    "description": "ClojureScript is a dialect of Clojure that compiles to JavaScript, and targets the JavaScript runtimes of the web as a deployment environment. It offers the unparalleled expressiveness of Lisp, the performance and space efficiency of the Google Closure Compiler, interoperability with the in-browser object model, and natural integration with server-side Clojure applications. In a time of proliferating JavaScript extensions and client-side development frameworks, this is a compelling vision of how client-side web development should be done. It's also a great language in which to write an agent model. In this talk, we'll dissect an entirely client-side simulation of a pen full of cows inside an electric fence. Each cow moves around randomly, and is sensitive to the stress level of the cows around it. When a cow wanders into the electric fence, we can explore simulation parameters that determine how stress moves through the herd. We'll learn how to write ClojureScript, and draw fascinating parallels to human behavior in real-life emotional systems.",
    "room": "Room 3",
    "keyWords": [
      "Alternative languages",
      "Frontend",
      "Functional Programming",
      "Research and Trends"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Tim Berglund",
        "biography": "Tim is a full-stack generalist and passionate teacher who loves working with people as much as he loves to code. He is a GitHubber (https://github.com/blog/1216-tim-berglund-is-a-githubber) whose mission is to make it easy for everybody in the world to use Git. He is a speaker internationally and on the No Fluff Just Stuff (http://nofluffjuststuff.com) tour in the United States, and loves to speak on Git and a variety of other topics. He is co-president of the Denver Open Source User Group (http://denveropensource.org), co-presenter of the best-selling O'Reilly Git Master Class (http://bit.ly/ogitvid), co-author of Building and Testing with Gradle (http://www.amazon.com/dp/144930463X), a member of the O'Reilly Expert Network (http://oreilly.com/pub/expert/timberglund), and a member of the GigOM Pro Analyst Network (http://pro.gigaom.com/members/timberglund/profile). He occasionally blogs at timberglund.com. He lives in Littleton, CO, USA with the wife of his youth and their three children."
      }
    ],
    "year": 2013
  },
  {
    "title": "Hva tenker publikum?",
    "level": "beginner",
    "intendedAudience": "Alle som har lyst til å få en kul opplevelse av praktisk teknologi.",
    "summary": "Demonstrasjon: Foredragsholderen stiller et spørsmål og publikum svarer, hele publikum. Ved hjelp av en webapp på mobilen kan svarene vises direkte på slidene.",
    "description": "De fleste som hadde fjernsyn på nitti-tallet har hørt om Tande-P og \"mentometerknappen\". Hva om man kunne ha en \"mentometerknapp\" i en presentasjon, der publikum gir direkte tilbakemeldinger vha smarttelefonen sin? Ideen er ikke ny, men det er foreløpig ingen som har benyttet den på et så intelligent publikum (så møt opp)! Her får du en demonstrasjon av noen av de fantastiske mulighetene som ligger i dette!",
    "room": "Room 7",
    "keyWords": [
      "Experience report",
      "Mobile"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Truls Fretland",
        "biography": "Truls har tidligere jobbet som foreleser for dataingeniører og sett behovet for å få tilbakemelding fra publikum underveis i en presentasjon."
      }
    ],
    "year": 2013
  },
  {
    "title": "Har du lyst å bli kommandolinjeninja?",
    "level": "intermediate",
    "intendedAudience": "Alle. Dette foredraget vil passe for både dem som har en grunnleggende kjennskap til bruk av kommandolinjen og de som allerede har en del erfaring.",
    "summary": "Hvem av oss kan si at vi aldri har drømt om å ha superkrefter? Kommandolinjeninjakrefter! Slik at du kan bevege deg raskt og lydløst over tastaturet, ha et stort arsenal av effektive verktøy og ha muligheten til å gjøre de kjedelige rutineoppgavene om til noe som er gøy?",
    "description": "Blir du satt ut når noen knoter ned noen kryptiske kommandoer i konsollet? Tenker du - DET DER - DET vil jeg også lære? Har du lyst til å lære nye triks eller gjenoppdage lure kommandoer du har glemt? Kanskje du bare har lyst å bli mer effektiv, eller trenger et nytt samtaleemne til neste familiemiddag? Kom til live kommandolinjeninjashow og ta svart belte i kommandolinjetriks! Du kan også bidra og briljere med dine skills! Det blir noen små premier for bidrag fra salen og en overraskelse på slutten.",
    "room": "Room 2",
    "keyWords": [
      "Experience report",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Rustam Mehmandarov",
        "biography": "Rustam Mehmandarov har mange års erfaring som utvikler, teknisk prosjektleder og leveranseansvarlig. Han har interesse for smidig utvikling, webutvikling, arkitektur og geografiske informasjonssystemer. På fritiden er han veldig glad i å trene, når han ikke sitter i en mørk kjeller og koder Python og Java. Ellers er han over gjennomsnittet glad i Linux, selv om han også er på en veldig god fot med Windows."
      }
    ],
    "year": 2013
  },
  {
    "title": "Build True Native Apps for iOS, Android, Windows and More in Java",
    "level": "beginner",
    "intendedAudience": "Java developers & advocates interested in mobile should attend this talk. Participation will give you a glimpse into what Java can do today on mobile devices without resorting to HTML5/PhoneGap. Participants need to be familiar with Java and with basics of Java software development on Eclipse/NetBeans.",
    "summary": "Want to program to iOS but don't want to deal with Objective-C? Don't want to buy a Mac just to build iPhone apps? Want to build Windows Phone apps but don't want to switch to Windows or port to C#? Java to the rescue! Make WORA real again for mobile programming thanks to the open source community.",
    "description": "Thanks to the open source community it is now entirely possible to use Java in order to build native applications for iOS, Android, RIM, Windows Phone etc. without the compromises that HTML5 imposes. The talk focuses on the open source Codename One project, which started its life within Sun Microsystems and eventually grew into a full grassroots project as its founders left Sun. As part of the talk we will build an application live on stage and demonstrate how it can be instantly deployed to devices. The talk is based on two highly attended talks that were given in Java One 2012 covering this very subject.",
    "room": "Room 5",
    "keyWords": [
      "Core Java",
      "Frontend",
      "Mobile",
      "Innovation and Startups"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Shai Almog",
        "biography": "Shai has been developing software professionally for the past 20 years and worked with Sun Microsystems since 2000. He has worked on countless projects from enterprise to desktop/consumer to mobile with many major corporations around the world. In mobile Shai was on the team that worked on the first DoCoMo Java Phone, the first mobile development kit from Sun and as the co-founder of the open source Codename One project."
      }
    ],
    "year": 2013
  },
  {
    "title": "Dart and Web Components - Scalable, Structured Web Apps",
    "level": "intermediate",
    "intendedAudience": "Any developer interested in building modern web apps. They will learn they can develop web apps with a familiar and powerful language, and use future web standards *today*. The audience should know the basics of web programming. No Dart or Web Components experience required.",
    "summary": "Like chocolate and peanut butter, Dart and Web Components go great together. Learn how to build structured, declarative apps with modern web platform features, and deploy them across the modern web today. Don't wait for all browsers to implement the great new Web Components specs, let Dart and its Web UI framework make it a reality today.",
    "description": "Like chocolate and peanut butter, Dart and Web Components go great together. Learn how to build structured, declarative apps with modern web platform features, and deploy them across the modern web today. Don't wait for all browsers to implement the great new Web Components specs, let Dart and its Web UI framework make it a reality today. Dart's language features such as classes, static types, and libraries brings order and scalability to the chaos. Web Components' features such as encapsulation, reusability, and declarative semantics helps you \"say what you mean\" and avoid soup. Web UI's declarative and dynamic two-way data binding efficiently wires up your app. Best part: it all compiles to vanilla HTML and JavaScript to bring you the best of the future web today so you can deploy access the modern web browsers.",
    "room": "Room 1",
    "keyWords": [
      "Alternative languages",
      "Frontend"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Seth Ladd",
        "biography": "Seth is a web engineer and works on the Dart team as a Developer Advocate for Google. He has produced conferences, written books, and he loves badminton."
      }
    ],
    "year": 2013
  },
  {
    "title": "www.NoSQL.com",
    "level": "beginner",
    "intendedAudience": "Architects and developers. Level from the beginner to intermediate. Knowledge of Java, JEE (basic/intermediate level).",
    "summary": "The talk, split into two sections and drawing from a real implementation covers potential NoSQL architectures and the features they offer in the quest to reach the Holy Grail AKA linear scalability. Presentation will describe a real-world implementation delivered for a global on-line travel agency using Infinispan.",
    "description": "The talk, split into two sections and drawing from a real implementation covers potential NoSQL architectures and the features they offer in the quest to reach the Holy Grail AKA linear scalability. First we examine an existing traditional replicated cache running at full capacity and how replacement with a distributed solution allowed the application to scale dramatically with a performance improvement to boot. Secondly we look at one of the pitfalls of distributed caching and how, using an essential tool from the Data Grid functionality armory, namely grid-execution we can provide massive scale out and low latencies. Both parts describe a real-world implementation delivered for a global on-line travel agency using Infinispan.",
    "room": "Room 4",
    "keyWords": [
      "Big Data and NoSQL",
      "Experience report"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Mark Addy",
        "biography": "Mark Addy currently works as a Senior Consultant at C2B2 a UK Java consultancy which specializes in building fast, scalable and reliable systems. He has extensive experience delivering development, troubleshooting, problem analysis and performance tuning services to clients spanning a wide range of industries. Mark has spoken at JUDCon Boston and the London JBoss User Group and will be speaking at GeeCon 2013 in May."
      }
    ],
    "year": 2013
  },
  {
    "title": "Going Reactive: Event-Driven, Scalable & Resilient Systems",
    "level": "intermediate",
    "intendedAudience": "Programmers, architects, CIO/CTOs and wannabes with a desire challenge status quo and expand their horizons on how to tackle the current and future challenges in the computing industry.",
    "summary": "Learn how to building modern, scalable, reactive and resilient applications, ready for the real-time web.",
    "description": "The skills of building Event-Driven, Highly Concurrent, Scalable & Resilient Systems are becoming increasingly important in our new world of Cloud Computing, multi-core processors, Big Data and Real-Time Web. Unfortunately, many people are still doing it wrong; using the wrong tools, techniques, habits and ideas. In this talk we will look at what it means to 'Go Reactive' and discuss some of the most common (and some not so common but superior) practices; what works - what doesn't work - and why.",
    "room": "Room 3",
    "keyWords": [
      "Architecture in practice",
      "Big Data and NoSQL",
      "Distributed systems and cloud",
      "Enterprise"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jonas Bonér",
        "biography": "Jonas Bonér is a geek, programmer, speaker, musician, writer and Java Champion. He is the CTO and co-founder of Typesafe and is an active contributor to the Open Source community; most notably founded the Akka Project and the AspectWerkz AOP compiler (now AspectJ). Learn more at: http://jonasboner.com"
      }
    ],
    "year": 2013
  },
  {
    "title": "Unit test enforced database delta scripts",
    "level": "beginner",
    "intendedAudience": "developers and testers working with applications that use SQL databases",
    "summary": "Never ever experience schema validaition errors on startup again.",
    "description": "Numerous tools exists to help you deploy database schema change scripts, provided you've remembered to create them. To help you remember, we have employed unit tests that break the build immediately if you add new persistent fields without also writing a correct delta script. In this talk I'll show you how to make that fly.",
    "room": "Room 7",
    "keyWords": [
      "Continous delivery",
      "Enterprise",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Eirik Berg Maus",
        "biography": "Eirik Berg Maus is a senior developer at Nets, and has presented at Javazone several times."
      }
    ],
    "year": 2013
  },
  {
    "title": "First, Kill All the Product Owners",
    "level": "intermediate",
    "intendedAudience": "Developers, product managers, agile coaches, team leaders",
    "summary": "Do you have a product manager? Maybe it's time to stop. Come explore the idea that we should do away with \"Product Manager\" as a defined role, and ask developers to be the masters of their own domain.",
    "description": "By now, we are all comfortable with the orthodoxy: the product owner discerns the needs of the customer and feeds them to developers in the form a prioritized backlog. Developers pull work from that backlog, always confident that they're working on the highest-priority feature at the moment, and never having to worry about how those priorities are allocated. This system is simple, efficient, and has helped many teams function better than they used to. It's also time for the system to die. A few revolutionary companies are experimenting with the idea that developers should be in charge not only of when they build new features, but _what_ features to build. Rather than mere code technicians following the will of a product and marketplace expert, developers themselves become experts in their product domain, building the tools users need—by conceiving of those tools themselves. Dispensing with the product owner creates an entirely new organizational tenor: one in which everyone is encouraged to master the business's domain, to organize their work in autonomous ways, and to take ownership of the purpose for which the organization exists.",
    "room": "Room 1",
    "keyWords": [
      "Enterprise",
      "Innovation and Startups",
      "Research and Trends",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Tim Berglund",
        "biography": "Tim is a full-stack generalist and passionate teacher who loves working with people as much as he loves to code. He is a [GitHubber](https://github.com/blog/1216-tim-berglund-is-a-githubber) whose mission is to make it easy for everybody in the world to use Git. He is a speaker internationally and on the [No Fluff Just Stuff](http://nofluffjuststuff.com) tour in the United States, and loves to speak on Git and a variety of other topics. He is co-president of the [Denver Open Source User Group](http://denveropensource.org), co-presenter of the best-selling [O&apos;Reilly Git Master Class](http://bit.ly/ogitvid), co-author of [Building and Testing with Gradle](http://www.amazon.com/dp/144930463X), a member of the [O&apos;Reilly Expert Network](http://oreilly.com/pub/expert/timberglund), and a member of the [GigOM Pro Analyst Network](http://pro.gigaom.com/members/timberglund/profile). He occasionally blogs at [timberglund.com](http://timberglund.com). He lives in Littleton, CO, USA with the wife of his youth and their three children."
      }
    ],
    "year": 2013
  },
  {
    "title": "So SQL",
    "level": "intermediate",
    "intendedAudience": "I hope to reach people who don't enjoy plugging together other peoples frameworks, but feel they have to. To appreciate the contents properly you should have experience with using Hibernate, and spring in an enterprise-like coding environment.",
    "summary": "I'll show you a fully functional web application built using java 8, without JPA/Hibernate or CDI/Spring. I hope you'll come away inspired by the realization that you have the power to create your own solutions, instead of blindly consuming other people's frameworks.",
    "description": "When it comes to storing data, we've gone from direct communication with relational databases, to standardized ORMs and now we seem to be moving on to No SQL storage solutions. While I fully understand the desire to get away from ORMs like hibernate (here's my rant on that subject from 2011: http://vimeo.com/28885655), I think we're moving in the wrong direction. Instead of moving away from RDBs we should be moving towards them. ORMs let you abstract yourself away from the database. But why would you want to do that? Relational databases are great! Much better for storing data than your typical object oriented domain model. I'm not going to show you the next big framework everybody should be using to communicate with databases, but I want to demonstrate how thinking differently about database access can lead to some pretty decent solutions. You can get a lot done, quite painlessly, with plain old java. And by writing things from scratch, for a particular application, you can get away with much simpler code than you could if you were writing a fancy generic framework. Most importantly though, you learn so much more and have tons more fun. I'll be showing you a fully functional application, and the code behind it. While the code will be freely accessible online, I hope nobody uses it, but instead feel inspired to go off and write their own solutions. It's by trying new things that the world moves forwards. I want us to become creators again, not simply consumers of other people's frameworks.",
    "room": "Room 3",
    "keyWords": [
      "Architecture in practice",
      "Big Data and NoSQL",
      "Core Java",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Christin Gorman",
        "biography": "Hi, I'm Christin. I'm married, have 2 kids, a dog and a rabbit. I live in Drammen and work at Husbanken. I've been programming for money for 13 years now in all sorts of environments. I've worked for startups and large international companies. As a consultant and a full time employee. Building code from scratch and using standard frameworks. I enjoy sharing my experiences (http://vimeo.com/28885655, http://vimeo.com/49484333), I hope you'll enjoy listening."
      }
    ],
    "year": 2013
  },
  {
    "title": "Gitk og git gui : To kraftige git-verktøy du burde kunne",
    "level": "beginner",
    "intendedAudience": "Passer for nybegynnere som akkurat har startet med git, men kan også være til hjelp for mer erfarne git-brukere.",
    "summary": "Lag gode commits, og ta kontroll over commit-historien. Gjennomgang av to kraftige verktøy for å hjelpe deg på veien.",
    "description": "Om du jobber med git til hverdags så er det enkelte operasjoner som gjøres veldig ofte: lage små gode commits, skaffe seg oversikt og manipulere commit-historien. Med kun kommandolinjen kan det være lett å miste oversikten, her finnes det nyttige verktøy som kan være til hjelp. Dette blir en praktisk gjennomgang av gitk og git gui som kan hjelpe deg med å bli tryggere og mer effektiv med disse oppgavene.",
    "room": "Room 7",
    "keyWords": [
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Ivar Fredriksen",
        "biography": "Utvikler i Iterate, synes det er viktig at versjonskontroll blir gjort på en god måte og da er ikke veien langt til en stor interesse for git. Ivar har i flere prosjekter hjulpet andre utviklere til en bedre forståelse og bruk av git."
      }
    ],
    "year": 2013
  },
  {
    "title": "Breaking the monolith: Towards a system-of-systems architecture",
    "level": "intermediate",
    "intendedAudience": "Anyone building systems with more than trivial size, developers and architects tasked with maintaining large systems. Benefits might include a change in the way one approaches designing systems from the beginning.",
    "summary": "We'll question the initial architecture decisions in building large systems, and discuss how to approach design differently. Allow for diversity while maintaining integrity, and avoid falling into the trap of making technology choices with too much rigor.",
    "description": "In any system of significant size, the same problem occurs again and again: What starts out as a light-weight, modern, efficient development effort using the technology of the day – be it Java and Java EE or Spring, Microsoft .NET, Ruby on Rails or any other of the well-known development stacks – ends up as a hard to change, monolithic, maintenance-intensive behemoth that everybody wants to get away from. But what are the core reason for this recurring pattern? In this session, we will discuss how and why things always seem to end up this way, and what strategies we can use to avoid this from the start.",
    "room": "Room 1",
    "keyWords": [
      "Architecture in practice",
      "Distributed systems and cloud"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Stefan Tilkov",
        "biography": "Stefan is a founder and principal consultant at innoQ, where he spends his time alternating between advising customers on new technologies and taking the blame from his co-workers for doing so. He is a frequent speaker at conferences and author of numerous articles. Twitter: @stilkov"
      }
    ],
    "year": 2013
  },
  {
    "title": "Authorization: it's not just about who you are!",
    "level": "intermediate",
    "intendedAudience": "1. Developers: developers will learn how to quickly apply fine-grained authorization to their applications. 2. security architects: architects will learn about the benefits of externalized authorization that can be applied and reused across the entire enterprise Attendees should have some understanding of the Identity & Access Management space.",
    "summary": "Worried about who's getting access to your app? Sprinkle in XACML and get access control that is both context-aware, externalized and dynamic.",
    "description": "Need to add more than basic access control to your application? Existing authorization frameworks including their pros and cons, but are typically quite limited. This talk will introduce XACML, the eXtensible Access Control Markup Language, an authorization standard from OASIS that defines fine-grained access control based on attributes. The XACML standard enables much more dynamic authorization that not only focuses on the user but also on resources, actions, and the context. XACML enables policy-based and attribute-based access control. The talk with then look at how XACML can be used to apply authorization business rules to any Java application and even beyond (.NET, Ruby...). This is known as “any-breadth authorization”. XACML also enables consistent authorization across multiple layers (presentation tier; web tier; business tier; and data tier). It becomes possible to apply the same authorization logic in a JSF page as in a jdbc connection. This is also known as “any-depth authorization” During the talk, we will look at live examples of applications using XACML. For instance, we will demonstrate the use of XACML and Java servlets, JAX-WS web services, and APIs as a whole. Attendees will also be able to write their own XACML policies, provided they download the ALFA plugin for Eclipse, an add-on for XACML policy authoring. In January 2013, XACML 3.0 was approved as a formal standard and there are several implementations available (open-source, free, and commercial) for developers to get started. The talk will illustrate how developers can leverage XACML to quickly apply authorization to new and existing applications. After this session, you will easily be able to add standards-based authorization to your application - and simplify your life!",
    "room": "Room 5",
    "keyWords": [
      "Distributed systems and cloud",
      "Innovation and Startups",
      "Security"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "David Brossard",
        "biography": "David joined Axiomatics in January 2010 to focus on customer deployments and pre-sales. Previously, he had worked for 5 years at BT (British Telecom) in the United Kingdom in the Security Architectures Center. His main area of expertise is SOA security and governance. David has published several papers and contributed to several books on the topic of SOA security and governance. David has been a member of the XACML Technical Committee and the Trust Elevation Committee at OASIS since 2010. In the XACML TC, David is focusing on developer adoption through the development of a JSON-based profile for XACML. David holds a Master’s of Engineering from the French National Institute of Applied Sciences, INSA Lyon. He is also a Sun Certified Architect (SCEA) and a Certified Security Testing Professional (CSTP)."
      }
    ],
    "year": 2013
  },
  {
    "title": "Enterprisesystem organisert som et open source githubprosjekt",
    "level": "beginner",
    "intendedAudience": "Jobber du på et prosjekt der veien fra ferdig kode til produksjonssatt kode er lang og smertefull? Få inspirasjon til å endre din egen arbeidsflyt ved å se hvordan vi shipper kode i Oslo Kommunes integrasjonsprosjekt, et stort enterprise Javasystem.",
    "summary": "Forvaltning av enterprisesystemer behøver ikke å bety kjipe verktøy og tungrodd prosess . En enkel arbeidsflyt som likner et Open Source-prosjekt, sammen med tett integrasjon mellom verktøyene i utviklingsmiljøet kan gjøre selv noe så kjedelig som obligatorisk code review før merge til en positiv ting.",
    "description": "Forvaltning av enterprisesystemer trenger ikke å bety kjipe verktøy og en tungrodd prosess som gjør alle involverte misfornøyde. I Oslo Kommunes integrasjonsprosjekt sjonglerer vi nesten 100 komponenter på en integrasjonsbuss, men organiserer arbeidet som om det skulle vært et vilkårlig github Open Source-prosjekt. Tett integrasjon mellom verktøyene i utviklingsmiljøet sentrert rundt Jira, Github og Jenkins har gjort selv noe så banalt som obligatorisk codereview før merge til en postitiv del av hverdagen som utvikler.",
    "room": "Room 7",
    "keyWords": [
      "Enterprise",
      "Experience report",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Øyvind Ingebrigtsen Øvergaard",
        "biography": "Øyvind jobber som utvikler hos Knowit i Oslo. I ca. to år har han jobbet på et stort offentlig enterprise Javaprosjekt hvor han mellom vanlige utviklingsoppgaver har brukt tid på å strømlinjeforme utviklingsmiljøet."
      }
    ],
    "year": 2013
  },
  {
    "title": "Visualize your architecture and information",
    "level": "intermediate",
    "intendedAudience": "Developers, designers and architects who wants to communicate better and to explore software and information in order to improve it.",
    "summary": "Do you want to communicate more effectively? Do you want create better maintainable software? If so, come and listen to this presentation to get some hands on tips on techniques and tools.",
    "description": "Visualization is an effective method of communication and there is more than UML. Peter will present methods and tools to visualize your system's architecture and design (or lack of it) and the theories behind. Using the methods and tools you will be able to prove a technical debt and to justify a refactoring for example. You will also be able to visualize how the data in the system looks like from different perspectives in order to detect \"information debt\" or how the system behaves in operation. The purpose of the presentation is to inspire you to use visualization as a technique to communicate better and to improve the quality of your software.",
    "room": "Room 4",
    "keyWords": [
      "Architecture in practice",
      "Experience report",
      "Research and Trends",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Peter Norrhall",
        "biography": "Peter Norrhall is Chief Architect at Extenda where he continuously tries to improve the software products, processes and people. Peter has been working for 20 years with software and system development and architecture with a broad range of technologies."
      }
    ],
    "year": 2013
  },
  {
    "title": "Data, Visibility, and Abstraction",
    "level": "intermediate",
    "intendedAudience": "This is a high-level design talk with an emphasis on functional programming. No prior experience with functional programming is necessary. Some familiarity with Clojure syntax will be beneficial but not essential to understanding the examples. Attendees will receive and introduction to functional programming concepts, how they are expressed in Clojure, and how they apply to real-world systems.",
    "summary": "How can we apply the lessons of functional programming to the design of software systems? How can we make software more transparent to developers? Using examples in Clojure, this talk will discuss ways to think about data, processes, isolation, and visibility.",
    "description": "One reason programming is hard is because it is so difficult to observe what is happening when a program runs. Programming languages and libraries rely on abstractions which either hide important details or produce too much information to consume. Developers come to depend on ever-more-sophisticated tools to examine programs and diagnose failures. However, with a little care and design, it is possible to build systems which lend themselves to easier comprehension. This talk will introduce some general guidelines for designing systems which make their data and abstractions more transparent to developers, using code examples in Clojure.",
    "room": "Room 1",
    "keyWords": [
      "Alternative languages",
      "Architecture in practice",
      "Functional Programming"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Stuart Sierra",
        "biography": "Stuart Sierra is a developer at Relevance, Inc., a member of Clojure/core, and the co-author of &quot;Practical Clojure&quot; (Apress, 2010) and &quot;ClojureScript: Up and Running&quot; (O&apos;Reilly, 2012). He has been involved with many open-source technologies including Clojure, ClojureScript, Ruby on Rails, Hadoop, and Solr."
      }
    ],
    "year": 2013
  },
  {
    "title": "Phaser and StampedLock Concurrency Synchronizers",
    "level": "advanced",
    "intendedAudience": "Java programmers interested in concurrency and performance.",
    "summary": "Come and find out how the Java 8 StampedLock can be used to make your locking 1000x faster and how to use Phaser together with Fork/Join.",
    "description": "The Phaser is a Java 7 synchronizer used to coordinate repeated tasks between several threads. It is very flexible and the interface is easier to use than the older constructs such as CountDownLatch. The StampedLock is a Java 8 optimistic lock mechanism, which allows us to get much better throughput on the reading and even on the writing.",
    "room": "Room 1",
    "keyWords": [
      "Core Java"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Heinz Kabutz",
        "biography": "Heinz Kabutz is the author of the Java Specialists Newsletter, where he researches Java constructs. He regularly investigates techniques for writing better, faster concurrent Java code. He has also published courses on Java and specifically on concurrency."
      }
    ],
    "year": 2013
  },
  {
    "title": "Eliminer Null med Option",
    "level": "intermediate",
    "intendedAudience": "Javautviklere som er lei av NullPonterExceptions",
    "summary": "Null har ingen semantisk verdi, er ikke typesikkert, og årsaken til verdens vanligste Exception. Lær hvordan man kan erstatte Null med Option og sov bedre om natten.",
    "description": "Null er en mare og en pest og en plage i java. Null har ingen semantisk informasjon i seg selv, og er årsaken til verdens mest utbredte Exception. Dogmatisk og aggresiv fjerning av null i kildekoden skaper mer robuste applikasjoner som er lettere å vedlikeholde. Lyntalen viser korte eksempler på hvordan man kan gjøre dette i Java ved hjelp av functionalajava sin fj.data.Option.",
    "room": "Room 7",
    "keyWords": [
      "Core Java",
      "Functional Programming"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Atle Prange",
        "biography": "Atle Prange er senior systemutvikler i Kantega. Han har 10 år som profesjonell java-utivkler bak seg, og har de siste årene krydret hverdagen sin med Scala og CoffeeScript."
      }
    ],
    "year": 2013
  },
  {
    "title": "Søk gjort riktig! - Intro til Elasticsearch",
    "level": "beginner",
    "intendedAudience": "Målgruppa for lyntalen er utviklere og arkitekter som har behov for søk i prosjektet sitt. Målet er at etter å ha sett presentasjonen, skal det være klart for alle kva som er den beste søkeløsninga. Ingen spesiell forhåndskunnskap trengs.",
    "summary": "Lyntalen gir ein introduksjon til søkeløsninga Elasticsearch og viser korleis du enkelt kan implementere det i ditt prosjekt.",
    "description": "Skal du innføre søk i løsninga di er det ofte to open source prosjekt som peiker seg ut. Dette er ein intro til det nyaste, og etter mi meining det beste alternativet, Elasticsearch.",
    "room": "Room 7",
    "keyWords": [
      "Big Data and NoSQL",
      "Distributed systems and cloud",
      "Enterprise"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Gunnar Velle",
        "biography": "Eg har jobba i Knowit i 12 år, og har i denne perioden jobbet med vidt forskjellige prosjekter og kunder. Veldig mykje store statlige og halvstatlige bedrifter som NSB, Statens Vegvesen og DSB. De siste tre årene har eg jobba med den aktuelle kunden, og har hatt daglig forvaltning av systemet, og har vore sentral i analysefasen av prosjektet."
      }
    ],
    "year": 2013
  },
  {
    "title": "Mocking, Stub and Spying with Spock",
    "level": "intermediate",
    "intendedAudience": "Developers working on Java and/or Groovy applications who want to learn how to write expressive tests using a state-of-the-art testing framework. Working knowledge of Java and JUnit is assumed. Familiarity with Groovy knowledge is a plus but not required.",
    "summary": "Spock is a developer testing and specification framework for Java and Groovy applications. This talk will take you on a fast-paced, demo-driven tour covering Spock fundamentals, data-driven testing, stubbing and mocking, Spock extensions, and more. Fasten your seat belts, and enjoy the ride!",
    "description": "Spock is a developer testing and specification framework for Java and Groovy applications. Used by open-source projects such as Grails and Apache Tapestry, and companies such as BSkyB and Netflix, its fan base is growing inside and outside the Groovy community. This talk will take you on a fast-paced, demo-driven tour covering Spock fundamentals, data-driven testing, stubbing and mocking, Spock extensions, and more. Shortly before landing, we'll be serving the latest developments in Spock 1.0. Fasten your seat belts, and enjoy the ride!",
    "room": "Room 5",
    "keyWords": [
      "Alternative languages",
      "Core Java",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Ken Sipe",
        "biography": "Ken Sipe is a Sr. Principal at Trexin, an application architect, frequent technical speaker, author of several articles and courses, and software and methodology mentor. He is founder of CodeMentor, Inc., focusing on training and mentor in distributed computing technologies. Ken has delivered hundreds of private and public presentations including JavaOne, JavaZone and NFJS."
      }
    ],
    "year": 2013
  },
  {
    "title": "Fun with JavaFX on Raspberry Pi and BeagleBoard xM",
    "level": "beginner",
    "intendedAudience": "Java developers that are interested in the Internet of Things and that would like to use Java(FX) on a Raspberry Pi or BeagleBoard xM.",
    "summary": "Use Java(FX) on embedded devices like the Raspberry Pi or the BeagleBoard xM to do something useful with it like monitoring the temperature.",
    "description": "Usually Java developers do not create code for embedded devices because there was no good Java support on these devices. Oracle figured out that there is a huge market for embedded devices and decided to support Java and JavaFX on hardware like the very popular Raspberry Pi and the BeagleBoard xM. With Java technology available on these platforms it's very interesting to see what you can do with this. This session will give you a short overview on the available technologies and will explain the interaction between different technologies and where they make sense. As an example a temperature monitoring application will be shown using JavaFX on a Raspberry Pi, a BeagleBoard xM and on the Desktop. In addition a little HTML5 page for mobile will be presented too.",
    "room": "Room 2",
    "keyWords": [
      "Experience report",
      "Frontend"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Gerrit Grunwald",
        "biography": "Gerrit is a software engineer with more than 8 years of experience in software development. His current interests include JavaFX, HTML5 and Swing especially development of custom controls in one of these technologies. He is also interested in Java driven embedded technologies like BeagleBoard and Raspberry PI. He is a true believer in open source and has participated in popular projects like JFXtras as well as his own projects (SteelSeries Swing, SteelSeries Canvas). He is an active member of the Java community, where he founded and lead the Java User Group MÃ¼nster (Germany) and co leads the JavaFX community. He is an international speaker at conferences and user groups."
      }
    ],
    "year": 2013
  },
  {
    "title": "En nybegynners introduksjon til Scalaz",
    "level": "intermediate",
    "intendedAudience": "Utviklere som er nysgjerrig på funksjonell programmering og abstrakt tenking, gjerne med noe erfaring med Scala.",
    "summary": "Er du redd for Scalaz? Har du hørt skrekkhistorier og fått velmenende råd om å holde deg unna? La meg stilne frykten og vise hvordan jeg som nybegynner tok tak i Scalaz, hvordan jeg utforsket funksjonell programmering og hva det gir meg i dag!",
    "description": "Få biblioteker er så myteomspunne som Scalaz. Det florerer med skrekkhistorier om uforståelige metodenavn med fylte og åpne stjerner, abstraksjoner som kun fungerer i en streng matematisk verden og strukturer du ikke finner igjen i kildekode. Sitater av typen \"hold deg unna hvis du vil beholde fornuften\". Jeg må innrømme det - jeg var livredd første gang jeg så på Scalaz. Samtidig hadde jeg hørt at \"validering med Scalaz er fantastisk\" og \"bare man kommer over kneika\" - og kjente nysgjerrigheten pirret. Dette måtte bare sjekkes ut! Spør meg i dag om det var verdt det! Gjett… La meg stilne frykten og vise hvordan jeg som nybegynner tok tak i Scalaz, hvordan jeg utforsket funksjonell programmering og hva det gir meg i dag!",
    "room": "Room 5",
    "keyWords": [
      "Alternative languages",
      "Experience report",
      "Functional Programming"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Trond Marius Øvstetun",
        "biography": "Trond Marius jobber som utvikler, teamleder, teknolog og sjefskonsulent i Mesan. Han har lang erfaring med Javabasert systemutvikling. De siste årene har han fulgt Scala tett og har brukt språket i flere prosjekter. Trond Marius leter konstant etter effektive løsninger og ny teknologi som gjør hverdagen som utvikler enklere."
      }
    ],
    "year": 2013
  },
  {
    "title": "Dr. Low Latency or: How I Learned to Stop Worrying about Pauses and Love the Memory",
    "level": "intermediate",
    "intendedAudience": "Architects and developers. Level from the beginner to intermediate. Knowledge of Java, JEE (basic/intermediate level). You will find out more about the approaches to how to use the off-heap memory, you will learn the strategies for accessing off-heap memory and using the advantage of large RAM without paying the performance penalty.",
    "summary": "This session will show different strategies for accessing off-heap memory and using the advantage of large RAM without paying the performance penalty.",
    "description": "Cheap RAM means we can use more memory than an average disk size was not that long time ago. It's very tempting to increase size of our JVM heap and store more data in-memory. As always, there is a trade-off: Large heaps lead to higher latencies due to Garbage Collector overhead. This session will show different strategies for accessing off-heap memory and using the advantage of large RAM without paying the performance penalty.",
    "room": "Room 6",
    "keyWords": [
      "Core Java",
      "Enterprise",
      "Experience report"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jaromir Hamala",
        "biography": "Jaromir Hamala is a Senior Consultant at C2B2 Consulting Ltd. – Java middleware consultancy focusing on non-functional requirements of systems. Jaromir wrote his first line of code when he was 7 years old. Since then, he was always interested in &quot;How this system works under the hood?’. Jaromir is an expert on JVM, Spring Framework and Liferay. He has spoken at Devoxx 2012, Liferay Conference Prague 2012, Software Summer Camp 2011 and JBoss User Group London."
      }
    ],
    "year": 2013
  },
  {
    "title": "En neve Android-devicer: Den gode, den onde og den grusomme",
    "level": "intermediate",
    "intendedAudience": "Ingen kjennskap til Android-utvikling er nødvendig, men er helt klart en fordel. Retter seg primært mot folk som lurer på hvilke problem man møter i hverdagen som Android-utvikler. Etter sesjonen vil publikum forhåpentlig vis ha en litt større forståelse for hvilke problemer vi i NRK møter, hva vi tenker å gjøre videre, og hvilke produsenter som synder mest i veien mot en mer standardisert og enklere hverdag for oss utviklere.",
    "summary": "En utviklers sukk over udokumentert oppførsel og manglende standardisering på Android-plattformen, og hvilke problemer dette medfører.",
    "description": "Android-plattformen møter stadig nye utfordringer når det gjelder det å få applikasjoner og nettsider til å se og oppføre seg riktig på ulike devices og skjermstørrelser. Jeg ønsker å ta publikum på en kort tur gjennom egne erfaringer på området, vise hvor ille det kan bli, og fortelle litt om hva man kan gjøre for å få en litt lettere hverdag. Vendor-spesifikke tilpasninger og stygge hacks må ofte til for å få applikasjonen til å gjøre det man ønsker og framstå på ønsket måte for alle enheter. Disse problemene kan minne om nettleserproblematikken for ti-femten år siden, der varierende grad av støtte og ulike tolkninger av standarder gjorde livet vanskelig for web-utvikling.",
    "room": "Room 7",
    "keyWords": [
      "Experience report",
      "Mobile"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Ola Nordbryhn",
        "biography": "Etter tre år som konsulent der arbeidet handlet om alt fra tunge, databasesentrerte serverside-applikasjoner til javascript frontend, har Ola det siste året slått seg ned i NRK. Der har han jobbet med mobiltilpasning av websider og apputvikling for iOS og Android. Som litt over gjennomsnittlig interessert i både gadgets og media har han funnet seg godt til rette og hadde hatt en perfekt hverdag dersom det ikke var for disse hersens brukerene og de idiotiske dingsene de insisterer på å bruke."
      }
    ],
    "year": 2013
  },
  {
    "title": "Why and how we do mobile native apps at FINN.no",
    "level": "beginner",
    "intendedAudience": "Everyone interested in mobile and mobile development. (Which should be everyone).",
    "summary": "In this talk Alf Thomas explains why FINN.no develop native mobile applications, what they learned from developing and maintaining their first apps and how they applied that knowledge when developing their next generation native apps.",
    "description": "FINN.no is Norway's biggest classifieds site and nearly half of all visits are from mobile devices. FINN develops native mobile apps for iOS and Android, mobile web and has adopted a mobile first strategy. This talk will explain why FINN has chosen to develop native mobile applications, and how their architecture enables them to roll out both minor and some major features to all users without requiring a client update.",
    "room": "Room 4",
    "keyWords": [
      "Architecture in practice",
      "Continous delivery",
      "Experience report",
      "Mobile"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Alf Thomas Nilsen",
        "biography": "Alf Thomas is the Tech Lead for FINN.no's mobile apps team. He has worked at FINN.no for three years and has a total of eight years experience as a Java developer."
      }
    ],
    "year": 2013
  },
  {
    "title": "Design is a Process, not a Document",
    "level": "intermediate",
    "intendedAudience": "Developers of all levels who are looking to learn about how to create better software. Although this is a presentation using the MongoDB Java Driver as an example, no previous knowledge of MongoDB is required, nor will you necessarily learn anything specific to MongoDB. However, if you ever wanted to contribute to the design of the MongoDB Java Driver, this session is a good chance to make your views heard.",
    "summary": "Is Software Design dead? How does development differ between application development and library development? And how do you not alienate your users when they're actually other developers?",
    "description": "Agile methodologies have had us moving away from Big Up Front Design to evolutionary, emergent design. But how does that work in the real world? Using experiences gained when creating the new Java driver for MongoDB, Trisha takes us on a design journey, where the answer to every question is It Depends, the users of the system and their use cases are unknown, and lurking at the back of every decision is the question âbut will it be backwards compatible?â Weâve all been there, trying to work out how to implement requirements, but have we really thought about the process of design? Beware Monsters.",
    "room": "Room 1",
    "keyWords": [
      "Architecture in practice",
      "Core Java"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Trisha Gee",
        "biography": "Trisha is a developer at MongoDB, where she maintains the Java driver. She has expertise in Java high performance systems, is passionate about enabling developer productivity, and has a wide breadth of industry experience from the 12 years she's been a professional developer. Trisha is a leader in the London Java Community, and involved in the Graduate Development Community, she believes we shouldn't all have to make the same mistakes again and again."
      }
    ],
    "year": 2013
  },
  {
    "title": "Vi har en Krevende Kaos-Kråke på server-rommet",
    "level": "intermediate",
    "intendedAudience": "Developers Architects System Responsibles",
    "summary": "Vi har en Krevende Kaos-Kråke (KKK) på server-rommet. Den ble født der og vi er dens foreldre. Skal man levere sikre og stabile systemer så må man håndtere solskinnsdager like bra som Kråke-dager.",
    "description": "Vi har en Krevende Kaos-Kråke (KKK) på server-rommet. Den ble født der og vi er dens foreldre. Skal man levere sikre og stabile systemer så må man håndtere solskinnsdager like bra som Kråke-dager. Vi kjører systemene våre i miljøer der Kråka skrur klokken tilbake, fyller opp disker, minne og databasen. Den bytter encoding, gjerne midt i en fil, og gjerne flere encodinger flere ganger i samme fil. Kråka roter også til kundeutvekslingene - når den flyr så mottar vi duplikater, triplikater og kråkeskit. Vi har stor tro på fri kråkeoppdragelse - vi ønsker ikke å oppdra Kråka, men heller tilpasse verden slik at vi kan leve med en kråke i server-rommet.",
    "room": "Room 6",
    "keyWords": [
      "Architecture in practice",
      "Enterprise",
      "Experience report",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Rune Peter Bjørnstad",
        "biography": "Jobber hos Nets Norway AS som arkitekt og ornitolog og er ansvarlig for å levere sikre og stabile systemer med høy endringsgrad. Skyter fugl på fritiden."
      },
      {
        "name": "Steingrim Dovland",
        "biography": "Jobber hos Nets Norway AS som utvikler og taxidermist og jobber daglig med å introdusere feil i systemet for å holde Kråka aktiv. Har planer om å ta jegerprøven."
      }
    ],
    "year": 2013
  },
  {
    "title": "Skalerbart søk med SolrCloud",
    "level": "intermediate",
    "intendedAudience": "De med interesse for søk og/eller skalerbarhet og distribuerte systemer. Liten forkunnskap kreves, selv om helt fundamental kunnskap om hva solr gjør og hvordan horisontal skalering fungerer kan være en fordel. Tilhørere vil få en innsikt i hvordan en kan sette opp et skalerbart søk med SolrCloud, og terskelen vil forhåpentligvis senkes for at de selv kan teste ut mulighetene.",
    "summary": "Hva er mulighetene når trafikken og datamengden i Solr blir for mye å håndtere? SolrCloud lar deg distribuere søket så du får utnyttet hele clusteret ditt.",
    "description": "Søk har blitt et forventet interface til mange typer applikasjoner. Hva skjer når trafikken og datamengden blir vanskelig å håndtere? SolrCloud er samlebegrepet for de distribuerte mulighetene som ble introdusert i Solr 4. Vi ser på konseptene som utgjør SolrCloud og hvordan oppsettet gjøres i praksis. Vi går også gjennom resultatene av ytelsestester for å se hva man kan forvente.",
    "room": "Room 7",
    "keyWords": [
      "Big Data and NoSQL",
      "Distributed systems and cloud"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Alexander Sagen",
        "biography": "Alexander har nylig begynt som utvikler i FINN. Før det har han jobbet som konsulent med internsystemer innen forsikring. Han har en mastergrad ved Monash University i Melbourne hvor han spesialiserte seg innen distribuerte systemer og var involvert i forskning innen trådløse sensornettverk."
      }
    ],
    "year": 2013
  },
  {
    "title": "Integrering av lua i Java",
    "level": "beginner",
    "intendedAudience": "Alle som utvilker Java applikasjoner vil ha nytte av å kunne integrere et scriptspråk i sin applikasjon for å gjøre det fleksibelt. Man vil få nok lua/java kunnskap til å kunne integrere lua i egen applikasjon, og kanskje få noen nye idèer om hvordan lua kan forenkle og løskoble eksisterende applikasjoner. Man trenger ingen forkunnskaper om Lua. Det forventes grunnleggende kunnskap om Java (swing, sockets, events), og at man forstår terminologier som refleksjon.",
    "summary": "Gjør en applikasjon dynamisk ved å integrere scriptspråket lua!",
    "description": "Lua er et elegant og kompakt scriptspråk som har blitt brukt til å skreddersy spill som Sim City og World of Warcraft. Hvorfor ikke gjøre det samme med Java-applikasjonen din? Å gi vertsskap til et scriptspråk gir uante muligheter til å lage fleksible og tilpasningsdyktige løsninger. I denne presentasjonen får du se hvor lett det er å komme igang med Lua-scripting av Java-applikasjoner. Gjennom praktiske og visuelle kodeeksempler får du se hvordan Lua kan gi dynamisk liv til et statisk Java-GUI ved å tilordne forretningsregler til grafiske komponenter. Reglene lar seg enkelt laste på nytt mens applikasjonen kjører; det er ingen grunn til å rekompilere og redeployere. Nye lag av funksjonalitet kan enkelt legges på etterhvert, for en stadig rikere applikasjon. Med Lua i verktøykassen blir GUI-programmering i Java morsomt igjen!",
    "room": "Room 5",
    "keyWords": [
      "Alternative languages",
      "Core Java",
      "Frontend"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Anders Elton",
        "biography": "Har 9 års erfaring fra spillbransjen og har utviklet titler som Conan og The secret World. Begynte som konsulent i Computas i 2013 og ser klare paralleller mellom de to bransjene. Er opptatt av innovasjon, nye teknologier og liker å gjøre programmering kult. Kommer fra en bransje der brukerne har ekstreme krav til fleksibilitet, noe som farger hans syn på hvordan ting skal gjøres."
      }
    ],
    "year": 2013
  },
  {
    "title": "Hvordan optimalisere webapps med HTTP/2.0, SPDY Push og Jetty",
    "level": "intermediate",
    "intendedAudience": "Du er en Java programmerer som er nysgjerrig på HTTP/2.0.",
    "summary": "Via eksempel kode ser jeg på hvordan en webapplikasjon kan få redusert forsinkelse ved sidelasting med HTTP/2.0, SPDY Push og Jetty.",
    "description": "Uansett om du bygger webapplikasjonen din for 10 eller 10 millioner brukere, så er utfordringene med forsinkelse ved sidelasting den samme. HTTP/2.0 (tidligere kjent som SPDY) er laget for å gjøre lasting av sider raskere. Dette oppnås ved å bygge mer intelligens inn i måten man leverer ressurser på. Via eksempler vil jeg se på hvordan Jetty implementerer HTTP/2.0 på server- og klientside. Dette inkluderer: * Hvordan utføre enkel HTTP/2.0 kommunikasjon * Multipleksing av ressurser * Intelligent push av ressurser før de blir etterspurt. Lyntalen vil være nyttig for alle som er nysgjerrige på HTTP/2.0 , og ønsker å se hvordan det fungerer i praksis.",
    "room": "Room 7",
    "keyWords": [
      "Frontend",
      "Innovation and Startups",
      "Research and Trends",
      "Security"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Espen A. Fossen",
        "biography": "Espen Fossen jobber som sikkerhetssjef og utvikler i Kantega. Har de siste årene jobbet med sikkerhet og utvikling for flere større virksomheter i Norge. Ved siden av sikkerhet er Espen er opptatt av å prøve ut ny teknologi, og spesielt den som kan by på bedre og sikrere løsninger. Espen sitter for tiden som leder for programkomiteen for Sikkerhet og Sårbarhet, en sikkerhetskonferanse som arrangeres årlig i regi av Dataforeningen."
      }
    ],
    "year": 2013
  },
  {
    "title": "Fra Grid til Akka!",
    "level": "advanced",
    "intendedAudience": "Arkitekter og utviklere som ønsker å forstå hvordan de kan utnytte produkter som Hazelcast og Akka på best mulig måte.",
    "summary": "Man hører stadig om nye teknikker for å utnytte moderne flerkjerne-prosessorer og problemer knyttet til parallell programmering. Denne presentasjonen viser hvordan vi har løst en del slike problemer ved hjelp av grid-teknologi og viser hvordan noe av dette kunne vært løst på en bedre måte med å bruke Akka og actors.",
    "description": "Det siste året har vi jobbet med å bygge systemer basert på en egenutviklet prosessmotor som kjører på grid-produktet Hazelcast. Tanken er å kunne definere oversiktlige prosesser for mottak og prosessering av data på en distribuert data-grid. Parallellitet og asynkrone operasjoner løses med en kombinasjon av distribuerte jobb-kjøringer og distribuering av data på flere noder. Etterhvert som vi har implementert fler prosesser har vi støtt på et økende behov for mer fleksibilitet med tanke på å definere asynkrone prosesseringssteg og bedre utnyttelse av ressurser. Vi ønsker å bygge fleksible systemer som enkelt kan tilpasses ulike behov og som kan skaleres dynamisk for å maksimere ytelsen. Dette er grunnen til at vi har begynt å se på Akka som alternativ/supplement til Hazelcast der målet er å få bedre utnyttelse av ressurser kombinert med fleksibel feilhåndtering og skalering. Gjennom en rekke konkrete eksempel viser vi hvordan Akka kan gi stor verdi på Java-prosjekter som har behov for parallellitet på serversiden :)",
    "room": "Room 5",
    "keyWords": [
      "Functional Programming",
      "Research and Trends",
      "Experience report",
      "Architecture in practice",
      "Big Data and NoSQL",
      "Distributed systems and cloud",
      "Enterprise"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Eivind Barstad Waaler",
        "biography": "Eivind jobber som fagsjef for Java i BEKK og har mange års erfaring som arkitekt og utvikler for Java-baserte løsninger. De siste årene har han jobbet hovedsaklig med systemer for mottak og prosessering av store datamengder. Eivind er lidenskapelig opptatt av programmering og hvordan man kan løse tekniske utfordringer på best mulig måte. Han har holdt presentasjoner på mange tidligere JavaZone-konferanser."
      }
    ],
    "year": 2013
  },
  {
    "title": "Hvorfor stole på E-valg 2011/13?",
    "level": "beginner",
    "intendedAudience": "Utviklere som lurer på om vi kan stole på e-valg, og ønsker å få et kort innblikk i hvordan det er mulig å få til en ekstern verifikasjon av e-valget uten å kunne se hvem som har stemt på hvilket parti. Skeptikkere mot e-valg er spesielt invitert :-)",
    "summary": "Skeptisk mot e-valg? Da bør du i hvert fall vite hvilke sikkerhetstiltak som faktisk er på plass under årets e-valg, slik at du ikke bruker feil argument under neste diskusjon!",
    "description": "Hvordan kan du stole på at e-stemmene for Stortingsvalget blir talt opp riktig? Sammenlignet med andre land har nordmenn alltid hatt stor tillit til myndighetenes håndtering av valg, men ekstern verikasjon skader aldri. Hvordan vet du at e-stemmene ble håndtert riktig? Er det f.eks. mulig å sjekke om en melding ble dekryptert riktig, selv om du ikke har tilgang til den hemmelige nøkkelen? Ja, det er mulig! Er det mulig å sjekke om innholdet i to krypterte meldinger er det samme, selv om du ikke kan lese innholdet og de krypterte meldingene ikke er like? Ja, det er mulig! Og er det mulig å sjekke om to lister med krypterte meldinger inneholder det samme, uten å vite noe om innholdet eller hvilken krypterte melding som korresponderer til hvilken andre krypterte melding? Ja, også det er mulig! Alt dette høres kanskje ut som svart magi, men dette er faktisk byggeklossene brukt til å verifisere e-stemmene i årets Stortingsvalg. Men det er mer som skal til enn kryptografisk magi for å gjennomføre en slik verifikasjon. Verifikasjonen skal f.eks. kjøres live fra en vanlig laptop under valgnatten, så parallellisering og gode loggmeldinger er viktige for at det skal være mulig. Vi vil også belyse litt av arkitekturen til e-valgsystemet, og noen av de andre tiltak som ble utført for å sikre opptellingen.",
    "room": "Room 2",
    "keyWords": [
      "Architecture in practice",
      "Experience report",
      "Security"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Filip van Laenen",
        "biography": "Filip van Laenen er sjefsteknolog hos Computas. Han har mer enn femten år erfaring i IT-industrien, og har jobbet som både utvikler, teknisk prosjektleder og fagleder for sikkerhet og software engineering. Han er spesielt interessert i sikkerhet, kryptografi og kodekvalitet. I 2011 implementerte han komponentene for å verifisere e-valg, og vil sannsynligvis gjøre det samme igjen til Stortingsvalget i år."
      }
    ],
    "year": 2013
  },
  {
    "title": "Bli et mer lykkelig menneske, gjør din koding på back-end",
    "level": "beginner",
    "intendedAudience": "Alle som liker å skrive kode! De som allerede jobber med back-end kan finne gode råd for hverdagen og de som aldri har jobbet med dette området vil forhåpentligvis få øynene opp for noe som det har vært mindre fokus på de siste årene.",
    "summary": "Har du opplevd å sende modulen din til testing, og alt du får tilbake er teite meldinger om fontstørrelse, ordlyd, formulering og plassering på skjermen? I så fall er det på tide å begynne å programmere det som ikke har noen front-end! Bakgrunnsjobber, middleware, batch, mulighetene er endeløse og gledene er mange!",
    "description": "Hadde det ikke vært mer interessant å sette fokus på den delen av koden hvor hjernecellene faktisk får bryne seg på annet en formattering av tekstfelter og knapper? Denne lyntalen er en hyllest til kodeskrivingens mange gleder og til fryden over å kunne konstruere logikk rett fra hodet uten ytre distraksjoner. Man vil få en kjapp introduksjon til enkle metoder som kan hjelpe programmereren med å holde arbeidsdagen produktiv og gøy, samt en uhøytidelig \"rant\" over mengden langtekkelige og, i den store sammenhengen, uvesentlige småproblemer knyttet til å lage en front-end.",
    "room": "Room 7",
    "keyWords": [
      "Architecture in practice",
      "Core Java",
      "Enterprise",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Vidar Berentsen Folden",
        "biography": "Vidar jobber som sjefskonsulent hos Mesan AS. Han er en teknisk arkitekt og programmerer med 16 års erfaring i bransjen, og var før det en ivrig hobbyprogrammerer allerede fra en alder av 10 år. Ren og effektiv kode samt tilsvarende arkitektur har hele tiden vært en pasjon, selv om erfaringene tilsier at omverdenen ofte vektlegger helt andre aspekter når det kommer til stykket. Han har jobbet med både front-end og back-end i sitt virke, men har fått sin favoritt i området hvor logikken får bli på sitt mest ubesudlede."
      }
    ],
    "year": 2013
  },
  {
    "title": "RequireJS for TDD",
    "level": "intermediate",
    "intendedAudience": "Forutsetter en viss kjennskap til modulsystemer i javascript (RequireJS, CommonJS eller lignende).",
    "summary": "Testdrevet javascript med RequireJS og Jasmine med automatisk mocking av avhengigheter og stubbing i Mockito-stil.",
    "description": "Tester i javascript kan være vanskelig nok å sette opp og vedlikeholde. Et modulsystem som RequireJS gjør det betydelig enklere, men det kommer også med sine utfordringer. Denne lyntalen vil demonstrere hvordan man kan utnytte mulighetene i RequireJS ilag med et testverktøy som Jasmine til å skrive lettfattelige og vedlikeholdbare tester hvor man har fokus på hva koden skal gjøre uten innblanding fra omverdenen. Dette involverer isolering av modulen som testes med automatisk mocking av avhengigheter og stubbing i Mockito-stil.",
    "room": "Room 7",
    "keyWords": [
      "Frontend",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Gunnar André Reinseth",
        "biography": "Gunnar er Java-konsulent hos jPro AS og har mange års erfaring med utvikling av brukergrensesnitt. Han er opptatt av å bruke testing som dokumentasjon og hjelpemiddel for å forstå problemdomenet som en helhet, og er pådriver for BDD og TDD for å skape solide og vedlikeholdbare komponenter. Foruten koding på dagtid, og hobbykoding og familieliv på kveldstid, bruker Gunnar sin resterende tid på å drikke øl og se motorsport."
      }
    ],
    "year": 2013
  },
  {
    "title": "Lowering stress-level with beta-users and functional switches",
    "level": "beginner",
    "intendedAudience": "Developers, tech-leads, testers and product owners working with releases on a weekly/monthly basis rather than yearly.",
    "summary": "Pushing a new release into production is always raising the stress-level of the developers. By using beta-users and implementing functional switches in the release we can isolate bugs or avoid exposing functionality without having to do a new release. Stress-level is down and quality is up.",
    "description": "Pushing a new release into production is always raising the stress-level of the developers. Sometimes functionality also has to be taken out of a release because of bugs, lack of time to test it, or a general uncertainty from the product owner if this actually is the right thing. Rolling back a release is not fun either. To keep our four-week release-cycles and avoid the overhead with last minute changes to the release, or building emergency patches, we introduced beta-users as a role in the system. We also started to add functional switches on all new complicated functionality or parts of the functionality. In this way we can expose new functionality or new layout only to a group of users, and we are able to partly put functionality into production or turn of buggy functionality without deploying the application. Our experiences with this is that it has become more used by the product owners to release new functionality according to their schedule, than by the DevOps-people to hold things back. We have also avoided both rollback and emergency-patching thanks to this.",
    "room": "Room 7",
    "keyWords": [
      "Continous delivery",
      "Experience report"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Anders Bjørnestad",
        "biography": "Over 20 years experience as an IT-consultant and CTO, both in Norway and internationally. Expert resource for a lot of large java and open source products since 1995. Speaker at local and international conferences, teacher and presenter at company-internal courses throughout Europa and an ambassador for sharing experiences and knowledge. Has experience with a lot of business domains through a lot of different projects. Currently working for Webstep in Norway. Focus on enterprise- and solution architecture, coaching development teams and delivering cloud-based solutions on open source and java platforms."
      }
    ],
    "year": 2013
  },
  {
    "title": "How to survive in a BASE world",
    "level": "intermediate",
    "intendedAudience": "This is the right session for you, if you - want to understand how BASE transactions change application development - want to learn step by step how to make your application BASE-ready - do not only want to learn some theory but also want to know what in means in code Some knowledge about distributed systems would be helpful but are not mandantory.",
    "summary": "BASE transactions are changing the way we have to develop applications dramatically - a lot more than most people think in the first place. This session not only explains why but also gives you a step by step introduction how to make your application BASE-ready based on real code examples. Let's get ready to survive in a BASE world!",
    "description": "NoSQL, Big Data and Scale-out in general are leaving the hype plateau and start to become enterprise reality. This usally means no more ACID tranactions, but BASE transactions instead. When confronted with BASE, many developers just shrug and think \"Okay, no more SQL but that's basically it, isn't it?\". They are terribly wrong! BASE transactions do not guarantee data consistency at all times anymore, which is a property we became so used to in the ACID years that we barely think about it anymore. But if we continue to design and implement our applications as if there still were ACID transactions, system crashes and corrupt data will become your daily company. This session gives a quick introduction into the challenges of BASE transactions and explains how to design and implement a BASE-aware application using real code examples. We start with a pure ACID application and transform it step by step into a BASE application. Additionally we extract some concrete idioms along the way in order to preserve the ideas in a concise way. Let's get ready to survive in a BASE world!",
    "room": "Room 2",
    "keyWords": [
      "Architecture in practice",
      "Big Data and NoSQL",
      "Distributed systems and cloud"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Uwe Friedrichsen",
        "biography": "Uwe Friedrichsen travels the IT world for many years. As CTO of codecentric he can live out his curiosity about new ideas and concepts as well as his joy at thinking differently. His current focus areas are distributed, highly scalable systems and agile architecture. Often, you can find him on conferences sharing his ideas, or as author of articles, blog posts, tweets and more."
      }
    ],
    "year": 2013
  },
  {
    "title": "HTTP Patch with JSON",
    "level": "beginner",
    "intendedAudience": "Developers using HTTP-APIs",
    "summary": "Patching representations in HTTP APIs can be hard, but no longer, JSON Patch is here.",
    "description": "Har du noen gang ønsket å kunne delvis oppdatere ressurser i et API? Da kan man bruke feks HTTP Patch metoden, som var lansert i RFC-5789 Problemet som skal løses er å oppdatere deler av en JSON representasjon. Dette kan gjøres via JSON-PATCH, nettopp lansert i RFC-6902. Jeg kommer til å bruke et Scala api som jeg har laget for dette.",
    "room": "Room 7",
    "keyWords": [
      "Architecture in practice",
      "Distributed systems and cloud"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Erlend Hamnaberg",
        "biography": "Consultant at Arktekk. Despot of HTTPCache4j, frequent speaker of HTTP-like subjects. REST-advocate. Dabbles with serveral languages, like Scala, Clojure and Haskell. Clearly a \"dys\"functional programmer ;)"
      }
    ],
    "year": 2013
  },
  {
    "title": "Implementing modular software on the Java platform",
    "level": "intermediate",
    "intendedAudience": "Anyone have who have seen a code base grow out of control and want to see how modularity can be implemented in practise.",
    "summary": "When the wise, bearded men designed Java, there was one piece of the puzzle they just didn't get around to finishing: Modularity. This talk explains the benefits of modular architectures and shows you how to implement it for Java based applications.",
    "description": "Back when the Java language and platform was designed there was one piece of the puzzle that the wise bearded men just couldn't get around to finishing properly: Modularity. Modularity done right can be incredibly liberating for your team: Features can be developed, tested and deployed independently. The need for branching and merging evaporates. Dead code can be efficiently and safely removed from your codebase. Developers can innovate and experiment without risking their sleep. People outside your team are free to extend your software without having to ask. They don't even need to know you exist. So if modularity has all of these benefits, why don't we see a lot more of it? Because implementing modularity on you own is hard and tricky. OSGi was promising, but failed to deliver because it was too complex. This talk shows you how to efficiently add modularity code base today. We start by presenting modularity as an architectural pattern and describe a structured approach to designing modular APIs. We then dive into the technical implementation of developing, packaging, distributing and deploying modules on the Java platform. We finish off by showing some real life implementations of modular Java systems.",
    "room": "Room 4",
    "keyWords": [
      "Core Java",
      "Research and Trends",
      "Craftsmanship and Tools",
      "Architecture in practice",
      "Continous delivery",
      "Distributed systems and cloud",
      "Enterprise"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Eirik Bjørsnøs",
        "biography": "Eirik currently holds the position of Chief Scientist at Kantega, a Norwegian employee-owned IT consulting company. Eirik is constantly on the lookout for smarter technology and leaner processes that may help us produce software more effectively. From low-level byte code optimizations to company culture, Eirik loves to experiment and regularly presents what he finds at conferences such as JavaZone, Smidig and the Java Posse Rounup."
      }
    ],
    "year": 2013
  },
  {
    "title": "Hjelp! Hekta på JNA!",
    "level": "beginner",
    "intendedAudience": "Foredraget passer alle som vil lære hvordan man gjennom ren Javakode kan kalle på nativebibliotek. Det forutsettes at man har god kjennskap til Java.",
    "summary": "En introduksjon til Java Native Access (JNA), stormannsgalskap og hvordan man implementerer taskbar og desktop i Java.",
    "description": "Det var en vakker vinterkveld med upåklagelig skiføre, men jeg var syk og måtte derfor være inne og trøsteprogrammere. Jeg startet prosjektet \"jna-example\" med ingen annen ambisjon enn å bruke JNA (Java Native Access) til å kalle én stusselig nativefunksjon. Lite ante jeg at prosjektet i løpet av noen få timer skulle utarte til en fullt fungerende taskbar ... men jeg klarte ikke å stanse: Enkelheten, hastigheten og maktfølelsen var berusende. Snart var virtuelle desktoper i Windows en realitet og ikke lenge etter ble startmeny, batteriovervåking og andre widgets definert gjennom en pluginbasert arkitektur. Nå har jeg forstått at jeg trenger hjelp: Jeg trenger en sal med negative tilhørere! Noen må fortelle meg at det er galskap å implementere dette i Java... Vi ser på: - Alt du trenger for å starte ditt eget prosjekt med JNA. - Hvordan nativekall fra ren javakode er mulig. - Representasjon av structer, pekere og annet. - Morsomme anekdoter om Win32 og X. - Arkitekturerfaringer fra prosjektet. - Demo av hvor langt galskapen har brakt meg.",
    "room": "Room 2",
    "keyWords": [
      "Architecture in practice",
      "Core Java"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Stian Grenborgen",
        "biography": "Stian Grenborgen har akkurat startet i Steria, men har en bakgrunn som programmerer og systemarkitekt i Nets."
      }
    ],
    "year": 2013
  },
  {
    "title": "Simple scales faster and better in the real world",
    "level": "intermediate",
    "intendedAudience": "* Developers * This is a story about how to scale better and have fun doing it, by going back to the basics. Participants might appreciate the experience and thoughts behind this before picking their next big leading edge framework and putting that into production. * Little to some knowledge or RESTful API, reverse-proxies, high performance and high availability, some knowledge of HTTP and some knowledge or interests in 0MQ",
    "summary": "This is a story about how to scale better and faster by keeping it simple. Two prototypes, 0MQ vs HTTP, and one winner. The story is told through our marquee high performance Varnish Cache invalidation product, written in Java, that is capable of 45 thousand cache invalidations per second with ease using only basic HTTP. We aim to share some experience, lessons and fun along the way.",
    "description": "This is a story about how to scale better and faster by keeping it simple, told through our marquee high performance Varnish Cache invalidation product, written in Java. The cache invalidation product, known as the “Super Fast Purger”, is a RESTful API that is designed to deliver purge requests to multiple geographically distributed Varnish Cache installations. The current implementation is capable of receiving and distributing 45 000 thousand cache invalidation requests per second with ease. It is believed that the upper limit of the throughput is yet to be determined for the Super Fast Purger as the software implementation was limited to network and hardware capabilities during benchmarking. The Super Fast Purger was conceived as a plugin for the Varnish Administration Console. Prior to the commercial release of the cache invalidation product, two prototypes were developed internally. The first was a highly concurrent and sophisticated prototype with 0MQ, Protobuffer and Disruptor as key components. The second prototype was development without any external packages, APIs or frameworks. By utilising only native Java 1.6 SE, a subset of HTTP 1.1 protocol was implemented and a simple HTTP server was conceived as the RESTful platform to handle purge requests. With stark contrast in development approach and technology choices, the two prototypes were benchmarked, tested and compared. The findings is that the simple HTTP server as a RESTful platform out performed the highly sophisticated and concurrent prototype by a factor of 100. This presentation aims to share the findings, lessons, and the fun experience that was the Super Fast Purger.",
    "room": "Room 2",
    "keyWords": [
      "Architecture in practice",
      "Distributed systems and cloud",
      "Experience report"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Yves Hwang",
        "biography": "Yves is a full stack software craftsman with a passion for software architecture and product development. He is a certified Scrum Master but a developer at heart. Currently working in Varnish Software AS as a Product Manager for the commercial tool offerings, Yves is opinionated about advocating for a development culture of agile, test driven, peer review, and strong mentorship. Don’t let the title fool you, as Yves part take in frontline support for Varnish Cache and codes daily. He primarily programs in Java, Javascript and dabbles in a bit of C. Yves lives in Oslo, with his awesome partner and two brilliant children."
      }
    ],
    "year": 2013
  },
  {
    "title": "AngularJS - What is it and why you should care!",
    "level": "beginner",
    "intendedAudience": "Anyone interested in Frontend Development using Javascript & HTML Participants will learn about AngularJS - from a beginners perspective. Participants should have some web development experience.",
    "summary": "This will be a brief talk about AngularJS - the MVW javascript framework from Google. After a brief introduction, we will cover topics such as data binding, directives, templating, filters, dependency injection and some points to keep in mind when developing angular applications.",
    "description": "You are a developer and have developed a lot of front end code in html & javascript. You've been reading about all of these new javascript frameworks (AngularJS, Ember, Batman) and are wondering what they're all about. This talk will be a quick introduction to AngularJS and why you should check it out. We will also offer some pointers for what to watch out for when diving in! Topics covered include - data binding, directives, templating, filters, dependency injection and some points to keep in mind when developing angular applications.",
    "room": "Room 7",
    "keyWords": [
      "Frontend"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Ernst Riemer",
        "biography": "Ernst Riemer is a full stack software engineer at Xtreme Labs where he focuses on web technology. A believer of polyglot programming, Ernst uses many languages and frameworks including C, Ruby, Java, JavaScript, Ruby on Rails, various Java frameworks, Sencha Touch, AngularJS. He is an advocate for using the correct tools for the job, and is always looking to learn new things! He has lead development on high traffic web sites, restful web services and mobile html5 applications."
      }
    ],
    "year": 2013
  },
  {
    "title": "Extreme Programming Live",
    "level": "beginner",
    "intendedAudience": "If you want to understand how serious test-driven development looks, this talk is for you.",
    "summary": "Good programming is not something that can be explained, it has to be experienced. In this talk, you will see pair programming, refactoring and test-driven development in action.",
    "description": "Good programming is not something that can be explained, it has to be experienced. In this talk, you will see pair programming and test-driven development in action. The talk will involve the audience and draw on your insight to show how programming can be more fun! If you want to understand how serious test-driven development looks, this talk is for you. As a programmer with over a decade of experience in test-driven development and refactoring, Johannes Brodwall likes to pair program with others to exchange experience, tips and tricks. In preparation for this talk, Johannes has been pair programming with local developers. During the talk, he will replay one of these sessions with a local developer. He will then discuss the practices, tricks, design ideas and interaction that they showed, showing concrete ideas for how you can become a better developer. Johannes is looking for local developers to pair program with for this talk. If you’re a Java developer with a few years experience who would like to some really cool tricks and gain some local credibility as a developer, please contact him at @jhannes on Twitter.",
    "room": "Room 6",
    "keyWords": [
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Johannes Brodwall",
        "biography": "Johannes is the Oslo based Chief Scientist for the Sri Lanka based company Exilesoft. He trains distributed teams and contributes to projects halfway across the world. He is an active contributor to the programmer community in Oslo and Sri Lanka and a veteran speaker in Norway and abroad."
      },
      {
        "name": "Roy Fernando",
        "biography": "Roy Fernando is a tech lead at Exilesoft in Sri Lanka where he works with Java and JavaScript-programming. He's in Norway to pay a visit to his current customer,"
      }
    ],
    "year": 2013
  },
  {
    "title": "Tips for bedre logger",
    "level": "beginner",
    "intendedAudience": "Alle som har lest en uforståelig logg, og vil spare seg selv og andre for opplevelsen!",
    "summary": "Har du opplevd at feilsøking er vanskelig, fordi loggen du leser er umulig å forstå? Eller at viktig informasjon rett og slett mangler? Eller bryr du deg ikke om loggene i det hele tatt? Da er du ikke alene, og jeg vil gjerne dele 5 enkle tips som kan spare deg timesvis av hodepine!",
    "description": "Har du opplevd at feilsøking er vanskelig, fordi loggen du leser er umulig å forstå? Eller at viktig informasjon rett og slett mangler? Har du irritert deg over debug-linjer som bare gir mening til utvikleren som skrev dem, og nå fremstår kryptiske? Eller bryr du deg ikke om loggene i det hele tatt, fordi de inneholder altfor mye informasjon? Da er du ikke alene, og jeg vil gjerne dele 5 enkle tips som kan spare deg timesvis av hodepine! Logging er applikasjonens interne grensesnitt!",
    "room": "Room 7",
    "keyWords": [
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Anders Båtstrand",
        "biography": "Anders er systemutvikler og medeier i Kantega AS, sivilingeniør i Industriell Matematikk, med spesialisering innen abstrakt algebra. Han brenner for enkle løsninger."
      }
    ],
    "year": 2013
  },
  {
    "title": "Tuning the JVM",
    "level": "beginner",
    "intendedAudience": "Java developers",
    "summary": "Memory management, garbage collection and recommendations on different configuration options to control gc, and memory compartments",
    "description": "Tuning the JVM - focused on memory management, garbage collection and recommendations on different configuration options to control gc, and memory compartments",
    "room": "Room 1",
    "keyWords": [
      "Core Java"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Ken Sipe",
        "biography": "Ken Sipe is a Sr. Principal at Trexin, an application architect, frequent technical speaker, author of several articles and courses, and software and methodology mentor. He is founder of CodeMentor, Inc., focusing on training and mentor in distributed computing technologies. Ken has delivered hundreds of private and public presentations including JavaOne, JavaZone and NFJS."
      }
    ],
    "year": 2013
  },
  {
    "title": "Goodbye XML !",
    "level": "intermediate",
    "intendedAudience": "Developers",
    "summary": "This talk is a practical experience report from removing all XML from a project's production code. Through code samples, it will show how your typical enterprise application changes.",
    "description": "First part; - What's wrong with XML ? - Webapp without web.xml; samples for Jetty - Spring without xml using javaconfig - Programmatic logging configuration Second part: - Implications on application design - Implications on application testability This second part will cover subtle changes to overall application composition that turn out to have significant impact on simplicity, and will show that this is the missing link in making \"loose coupling\" really shine. Third part: Migration strategies for current code",
    "room": "Room 6",
    "keyWords": [
      "Architecture in practice",
      "Enterprise"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Kristian Rosenvold",
        "biography": "Agile minimalist with a taste for getting to the bottom of things. Apache member, Maven PMC, Codehaus, Selenium Committer."
      }
    ],
    "year": 2013
  },
  {
    "title": "Bruk og misbruk av default-metoder i Java 8",
    "level": "intermediate",
    "intendedAudience": "Du er en Javaprogrammerer som er nysgjerrig på Java 8.",
    "summary": "This speach examplifies ways of using default methods in Java. Contains examples on how to use and not to use default methods in Java.",
    "description": "Irriterer du deg over interfacer som krever implementasjon av en drøss metoder du ikke har noe forhold til ? Sløser du tid på å implementere kode som godt kunne vært skrevet en gang for alle ? Ønsker du å legge til metoder i API-et, men tør ikke fordi det knekker andres kode ? Java 8 introduserer default methods. Dette tillater implementasjonskode ikke bare i klasser, men også i interfacer. Samtidig beholdes bakoverkompatibilitet. Denne lyntalen viser eksempler på bruk av default-metoder. Eksemplene viser hvordan default-metoder - gir mulighet for miksin-klasser - kan kombineres med generiske typer - ikke bestandig er like lette å forstå - kan ødelegge bakoverkompatibilet Lyntalen viser at default-metoder er noe man tjener på å ha i sin verktøykasse, at de kan gi fleksible design men at de ikke passer for alt.",
    "room": "Room 7",
    "keyWords": [
      "Core Java"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Svein Otto Solem",
        "biography": "Svein Otto er senior systemutvikler hos Kantega AS. Han har hatt systemutvikling som levebrød i over 30 år. Han har de siste 12 år programmert Java, med innslag av JavaScript, AspectJ, JavaCC, Groovy og Scala. Tidligere år i C/C++, Mary, Pascal, Simula, Lisp, Prolog. Svein Otto har spesiell interesse for programmeringsspråk."
      }
    ],
    "year": 2013
  },
  {
    "title": "Configuring large scale distributed systems",
    "level": "intermediate",
    "intendedAudience": "People interested in distributed systems, configuration management, or how a large internet company does configuration management of its serving systems. People will get insight into how Yahoo! uses Java together with open source technologies to create a generic configuration platform that can be used to configure other platforms. Participants should have a basic understanding of Java. Experience with client-server programming will help understand the examples, but is not required.",
    "summary": "This talk will present the configuration system designed to manage run-time configuration for some of Yahoo!s serving systems; describing how this system, developed by a small development team in Trondheim, tackles some of the very real challenges when managing a large distributed system.",
    "description": "Managing a small system is simple. But as a system grows, more services are added, and data and computation needs to be distributed. All of a sudden, you find yourself in a configuration nightmare, where both the time needed to change the configuration and human errors made in the process increase. A large scale system typically involves thousands of hosts, and multiple processes running on each of those hosts. Cloud platforms such as Heroku and Amazon tries to simplify this by providing higher level abstractions of the services and how they are connected. This requires that they run some system management of the software running inside the cloud. In Yahoo!, we run large scale systems, and this talk will describe the configuration system developed by a small development team in Trondheim to manage run-time configuration for many of Yahoo!’s serving systems. The talk will present how our configuration system grew from a simple set of config files to a generic configuration system for the cloud. It will describe how it works, and what we used to build it.",
    "room": "Room 4",
    "keyWords": [
      "Architecture in practice",
      "Distributed systems and cloud"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Ulf Lilleengen",
        "biography": "Ulf Lilleengen is a developer at Yahoo! working on a web scale serving platform that delivers relevant content and ads throughout the Yahoo! network."
      }
    ],
    "year": 2013
  },
  {
    "title": "The Unreasonable Effectiveness of Dynamic Typing for Practical Programs",
    "level": "intermediate",
    "intendedAudience": "Any developer or architect who needs to marshal arguments and evidence in favour of developing in dynamic languages or who is interested in the practical effects of key technology choices on project outcomes. I'll be comparing Python code against equivalent programs in static languages such as Java or Scala. No deep Python knowledge will be required; I'll try to explain it as we go. I'll expect knowledge of the principles of unit testing.",
    "summary": "Explore the disconnect between the dire outcomes for dynamic language programs predicted by advocates of static typing, versus the near absence of type errors in real world systems built in Python, Ruby and Clojure and the many successful systems built in dynamic languages.",
    "description": "Some programming language theorists would have us believe that the one true path to working systems lies in powerful and expressive type systems which allow us to encode rich constraints into programs at the time they are created. If these academic computer scientists would get out more, they would soon discover an increasing incidence of software developed in languages such a Python, Ruby and Clojure which use dynamic, albeit strong, type systems. They would probably be surprised to find that much of this software—in spite of their well-founded type-theoretic hubris—actually works, and is indeed reliable out of all proportion to their expectations. This talk—given by an experienced polyglot programmer who once implemented Hindley Milner static type inference for “fun”, but who now builds large and successful systems in Python—explores the disconnect between the dire outcomes predicted by advocates of static typing versus the near absence of type errors in real world systems built with dynamic languages: Does diligent unit testing more than make up for the lack of static typing? Does the nature of the type system have only a low-order effect on reliability compared to the functional or imperative programming paradigm in use? How often is the dynamism of the type system used anyway? How much type information can JITs exploit at runtime? Does the unwarranted success of dynamically typed languages get up the nose of people who write Haskell? For the answers to these important questions, and more, don’t miss this session.",
    "room": "Room 6",
    "keyWords": [
      "Alternative languages",
      "Architecture in practice",
      "Experience report",
      "Research and Trends"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Robert Smallshire",
        "biography": "Robert has worked in senior technical and management roles for several software companies providing tools in the energy sector for dealing with the masses of information flowing from today’s digital oil fields. He has dealt daily with understanding, designing, advocating and implementing effective architectures for sophisticated scientific and engineering software in Python, C++, C# and F#. He suspects there’s might be something profoundly “right” about Haskell, but keeps making stuff that “just works” in Python anyway. Robert is a regular speaker at conferences, meetups and corporate software events and can be found speaking about topics as diverse as behavioural microeconomics in software architecture to implementing web services on 8-bit microcontrollers. He is organiser of the Oslo Python group and holds a Ph.D. in a natural science. Robert has recently founded Sixty North, a software product and consulting business operating throughout Europe and based in Norway."
      }
    ],
    "year": 2013
  },
  {
    "title": "Immutable data stores - Datomic vs EventStore",
    "level": "advanced",
    "intendedAudience": "Experienced developers and architects with an interest in high scalability.",
    "summary": "Never change your data",
    "description": "If you are used to traditional databases, then to only append and never update your data may sound like a crazy idea. However, not only does this enable historical queries, but also enhances fault tolerance and scalability. In this presentation we briefly describe two immutable data stores (Rich Hickey's Datomic and Greg Young's EventStore) and compare their different data models using an example problem domain. Along the way we learn about CQRS, Aggregates, Projections and why you want your data to be immutable. EventStore is a data store for applications using event sourcing and time-series data. EventStore runs on .NET and Mono. Datomic is a database of time-based facts, with declarative queries and ACID transactions. Datomic is written in Clojure and runs on the JVM.",
    "room": "Room 3",
    "keyWords": [
      "Big Data and NoSQL",
      "Functional Programming"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jan Kronquist",
        "biography": "Jan Kronquist is a consultant at Jayway and has worked with everything from games, large enterprise systems and mobile phone applications. He has been writing Java code for over 16 years and is still a huge fan of the platform and the community, although Clojure is now his favorite language. He is the founder of the open source testing frameworks PowerMock and Awaitility."
      }
    ],
    "year": 2013
  },
  {
    "title": "Fire tips for et lykkeligere liv med bash",
    "level": "beginner",
    "intendedAudience": "Alle som til daglig bruker eller burde bruke shell. Ingen spesielle forkunnskaper nødvendig.",
    "summary": "Noen enkle funksjoner gjør bash shellet ditt til en fryd å jobbe i. Det er mange å ta av, men her er noen av mine favoritter som benyttes daglig.",
    "description": "Fire enkle tips for å gjøre bash shellet ditt bedre å jobbe i: * Up up up * Jeg vet hvor du bor Git * Historikk slik den burde være * Tab-completion med kontekst",
    "room": "Room 7",
    "keyWords": [
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Runar Myklebust",
        "biography": "Jobbet som utvikler og system-arkitekt i Telenor i 8 år før jeg gikk inn i CMS-verdenen hos Enonic for 4 år siden. Det første jeg tar backup av er .bashrc-fila min."
      }
    ],
    "year": 2013
  },
  {
    "title": "Functional I/O in Scala",
    "level": "intermediate",
    "intendedAudience": "Web developers building real time web applications. They will learn how to build scalable and reactive web applications that can work wilt multiple data streams",
    "summary": "Making I/O programs compose Reactive programming",
    "description": "IO is usually quite hard to tackle in a functional way. The predominant paradigm for I/O is the cursor. A cursor is a data structure that holds the current state of an I/O resource and provides a function to retrieve the next data available from that resource. This approach lacks some very properties we functional programmers care about: - composability Writing explicit I/O loops makes to hard to compose - not functional Ideally we write functions that transform input to output but pull based I/O (where you read the chunks) makes it hard to write pure functions There are already libraries that provides some abstraction to overcome these shortcomings but somehow lacks in composability. In this presentation I will explore Enumeration based I/O with iteratee and how that makes I/O operations both functional and efficient. I will take some real world example use cases using Play framework where this approach has been used with success.",
    "room": "Room 3",
    "keyWords": [
      "Architecture in practice",
      "Functional Programming",
      "Research and Trends"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Nilanjan Raychaudhuri",
        "biography": "Nilanjan is a consultant/trainer and core member of Play framework. He works for Typesafe. He has more than 12 years of experience managing and developing software solutions in Java, Ruby, Groovy and also in Scala. He is zealous about programming in Scala ever since he got introduced to this beautiful language. He enjoys sharing his experience via talks in various conferences and he is also the author of the “Scala in Action” book."
      }
    ],
    "year": 2013
  },
  {
    "title": "Getting your project off the ground",
    "level": "advanced",
    "intendedAudience": "If you are in a software project where you're changing the focus or team members, this talk give you some very concrete techniques to use the next few weeks to get more understanding, better team dynamics and more progress.",
    "summary": "So your project is just getting started. Or maybe you're just about to embark on a new release. Or new members just joined the team. What now? The attention and enthusiasm in your project will never be higher than now. This talk shows how to get the most out of it.",
    "description": "So your project is just getting started. Or maybe you're just about to embark on a new release. Or new members just joined the team. What now? In either situation, your project will have a lot of energy and attention right now. But at the same time, there's probably a lot of uncertainty about what to do first. Many projects waste this valuable time without a clear plan or purpose. In Exilesoft, we have refined activities to deal with these problems, even with the additional constraint that the team may be distributed geographically. In this talk, I share a typical plan of what activities to do every day in the first weeks together with a set of activities which yeld tangible results in terms of team building, vision, architecture and a coherent working system in a minimum of time. Come to this talk if you want to kick start your project and get on the right track fast.",
    "room": "Room 6",
    "keyWords": [
      "Architecture in practice",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Johannes Brodwall",
        "biography": "Johannes is the Oslo based Chief Scientist for the Sri Lanka based company Exilesoft. He trains distributed teams and contributes to projects halfway across the world. He is an active contributor to the programmer community in Oslo and Sri Lanka and a veteran speaker in Norway and abroad."
      }
    ],
    "year": 2013
  },
  {
    "title": "Backbone vs Angular - How much work do you want the framework to do for you?",
    "level": "beginner",
    "intendedAudience": "Frontend (that's the browser, kids) developers or people who are just curious about what's going on at the other end of the wire. You should be aware that there's something out there called HTML and Javascript but you don't need intricate knowledge of either.",
    "summary": "If you want to know what differentiates Backbone.js and Angular.js and get a better feel for which one you should use then feel free to head over.",
    "description": "I'd like to talk about the differences between two popular frontend Javascript frameworks that I've had experience with over the last 1,5 years. I'll give a short introduction to what they are and how they work before I dive into the differences between them, my experience from using them in customer projects and what I consider the pros and cons. This lightning talk does not aim to teach you how to use either one of those frameworks, but may be of interest if you're using one or are planning to. If you're not familiar with either of them you'll still get a quick fly-by on how they'll affect your frontend code and perhaps be in a better position to choose between them. The talk will be held in Norwegian.",
    "room": "Room 7",
    "keyWords": [
      "Frontend"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Ivar Nilsen",
        "biography": "Ivar has been in the trenches for 6 years, most of which has been spent on various forms of frontend development, ranging from clunky old JSPs to spine-crippling Flex/ActionScript and pure HTML/Javascript. The last couple of years has been spent working on HTML5 browser-applications using Backbone.js and Angular.js He currently works at WebStep, likes to play in the snow and is convinced that the Norwegian winter lasts from November to August as long as you're willing to drive far enough. And Ivar usually is."
      }
    ],
    "year": 2013
  },
  {
    "title": "Top 10 Security Mistakes In Software",
    "level": "intermediate",
    "intendedAudience": "If you are looking for in-depth technical security, this is not your talk. If you are a developer, curious about what you need to know about security, you should definitely attend. What to learn: What should you as developer be aware of? When should an alarm go off inside your head, saying \"We need to think this over really carefully\" or \"I need to get an expert opinion on this\"? How can you become an even better developer?",
    "summary": "Why are we still creating software with so many security-related problems?",
    "description": "What are the most common mistakes made during the software development process that leads to security problems in the finished product? In this talk, Peter af Geijerstam will present the top 10 issues leading to insecure software systems. This talk is NOT about the technical aspects of buffer overflows, shell code or use-after-free vulnerabilities. It is about language- and OS-independent security-aspects such as design decisions, concepts, mistakes and bad luck.",
    "room": "Room 2",
    "keyWords": [
      "Security",
      "Research and Trends",
      "Architecture in practice"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Peter af Geijerstam",
        "biography": "Peter af Geijerstam is a software developer who specializes in computer security. He has been doing software development for over 15 years and has experience from small businesses, large-scale telecom and computer security for government agencies. Peter believes in solving problems, not using any particular technology. He currently works as a software consultant for factor10 where he works to bring security-awareness to software developers. Peter is on twitter as @p4fg and blogs on http://www.shellcode.se"
      }
    ],
    "year": 2013
  },
  {
    "title": "Gjør code-review til en lek med pull-requests.",
    "level": "intermediate",
    "intendedAudience": "Grunnleggende kunnskap om git og bruk av versjonskontroll systemer forutsettes. Myntet på brukere av github som ønsker å få mer ut av verktøyet og utviklere, som ikke kan bruke github av ulike årsaker, som ønsker å ta med seg noen av de gode tingene fra github inn i sin egen prosess.",
    "summary": "Gjør code-review til en lek med pull-requests.",
    "description": "Lei av å måtte lete rundt i commit-loggen for å finne de relevante commitene til en endring? Lei av å ikke se det store bildet i havet av endringer? Samle nye features i pull-requests og få oversikt med en gang slik at du kan gjøre code-review kjappere og bedre enn før.",
    "room": "Room 7",
    "keyWords": [
      "Continous delivery",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Stian Veum Møllersen",
        "biography": "Master i Datateknikk fra NTNU og jobber som utvikler hos BEKK i Trondheim. Arbeider primært med webteknologi, med et dykk i stacken nå og da. Interessert i alt som kan gjøre utviklerhverdagen enklere og mer effektiv."
      }
    ],
    "year": 2013
  },
  {
    "title": "Programming, Only Better",
    "level": "beginner",
    "intendedAudience": "For all programmers who want to become better programmers.",
    "summary": "Once you realise the true enemy of software development is complexity, not waterfalls, you can start rethinking how we write our software. Come learn why modern languages like Scala and Clojure lead to fundamentally better software systems than any of yesterday's tricks.",
    "description": "Have you noticed that in spite of all our oft repeated Best Practices, those bugs don't seem to stop coming back no matter how many tests we write, that pile of technical debt still seems to keep growing no matter how much we refactor, and we keep missing those deadlines no matter how we organise our scrum board? Perhaps it's time to stop listening to those who shout the loudest and start applying actual reason to the problem for a change. The programming paradigms that served us so well through the 80s and 90s are no longer adequate for developing software in the modern world. Building systems the way we're used to building them always seems to end in the inevitable death march towards exponential complexity. But once you start asking the right question—\"what's causing all this complexity?\"—the answers turn out to be obvious. Debugging is only hard when you can't reason about your code. Concurrency is only hard when you can't predict the state of your code. Reusability is only hard when your components aren't naturally composable. These problems are what the modern generation of functional programming languages—Scala, Erlang, Clojure—have been designed from the ground up to overcome. This is what the really smart people in our field have been up to lately, and it's really time you put down those Post-Its and come let me show you why it's a really, really big deal.",
    "room": "Room 5",
    "keyWords": [
      "Alternative languages",
      "Functional Programming",
      "Research and Trends",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Bodil Stokke",
        "biography": "Bodil is a compulsive conference speaker in the fields of functional programming and internets technologies, and is a co-organiser of three annual developer conferences in her home town of Oslo, Norway, mostly because she’s still learning how to stop. She is a prolific contributor to the Free Software community, primarily as a Clojure developer, and has recently taken up designing new programming languages as a hobby. In her spare time, she works as a web developer for Comoyo, which is like Hulu for non-Americans."
      }
    ],
    "year": 2013
  },
  {
    "title": "Functional Programming without Lambdas",
    "level": "beginner",
    "intendedAudience": "This session is intended for Java developers with an interest in functional programming. During the session, you will learn how to write Java code in a functional style without using Java 8. Basic Java knowledge is expected.",
    "summary": "In this session you will learn how to write Java code in a functional way without using Java 8.",
    "description": "You’ve probably heard the buzz about functional programming and you may have glanced at the new Lambda features in Java 8. What is less known is that it's actually possible to leverage some of the functional-style techniques even in older Java versions. This means that you can program in a functional style, even if your organization has not yet updated to Java 8. In this session, you’ll learn about real-world experiences with functional frameworks such as LambdaJ, Functional Java and Guava. What should you consider before adopting them? How do they compare against one another? If you are stuck with a legacy Java version and want to be prepared for the functional future of Java 8, make sure to attend this session.",
    "room": "Room 3",
    "keyWords": [
      "Core Java",
      "Functional Programming"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Johan Haleby",
        "biography": "Johan Haleby is a Swedish developer, speaker, and writer with a profound interest in software engineering and testability in particular. He has founded and contributed to numerous open source projects such as PowerMock, REST Assured and Awaitility and has spoken at several conferences and user groups such as Öredev and Devoxx."
      }
    ],
    "year": 2013
  },
  {
    "title": "The Long Tail Treasure Trove",
    "level": "beginner",
    "intendedAudience": "The talk is geared towards Java (or other JVM language) programmers who use open source libraries. Attendees will leave with knowledge of and pointers to a whole new realm of useful libraries.",
    "summary": "Learn about a slew of obscure but powerful Java libraries that you just cannot do without once you know they exist. Attention usually focus on the big projects, but there are tons of great gems that solve their little problem so well. We'll learn about more then thirty of those, that you can start using immediately!",
    "description": "Open source library and technology stories tend to be focused around big, famous and established projects. Enough of Spring, Akka and Hadoop: there is much more than just the big guys! The long tail treasure trove is full of hidden gems, libraries, utilities and snippets that make developers' lives easier and provide important functionality. This talk is all about the small stuff that shaves so many hours off of development time and improves productivity by orders of magnitude. We'll learn how off some of the most interesting small itches that got scratched by providing tools you just can't do without once you get to know them. We will present no less than 30 (thirty!) Java Open Source projects, providing code examples and small demos for each one of them. By no means is this intended as a comprehensive view on everything that's in the Long Tail: our expectation is to make attendees aware of the existence, and able to locate more, of a plethora of readily available open source software, while providing a few hints about what are, in our experience, some of the best hidden gems in the “small yet beautiful” landscape.",
    "room": "Room 2",
    "keyWords": [
      "Core Java",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Brian McCallister",
        "biography": "Brian McCallister joined Groupon as CTO of Platform in August, 2013. Prior to Groupon, he was Principal Architect and Distinguished Engineer at Ning, where he was responsible for directing and communicating the technical big picture across the organization. He joined Ning originally as a Core Architect when it was just a tiny startup and watched it grow to over two hundred people. At the Apache Software Foundation, Brian has served on the Board of Directors and as PMC Chairs for the DB and ActiveMQ projects. With the ASF he focused on pushing for greater project autonomy, and mentoring and shepherding a number of projects into the foundation, including Cassandra, Mesos, and Jclouds. In his broader past, Brian has worked variously as an engineering manager, technical writer, and systems administrator on projects ranging from internal platforms to loom control drivers. He is also a great mentor, and takes a vested interest in developing other engineers in the organization to help turn them into great engineers. Brian holds an MS in Education and BA in English both from Bucknell University."
      }
    ],
    "year": 2013
  },
  {
    "title": "Git with T for team",
    "level": "intermediate",
    "intendedAudience": "Developers, team leads and everybody who cares about an effective and secure workflow should attend this session. Participants will learn how to use Git effectively in their day to day job and get some ideas how to build a productive development workflow. You will need some basic knowledge around version control systems but you don't have to be an experienced Git user to understand the concepts.",
    "summary": "Git is powerful. It can change the way you interact with your team members when you know what's possible. You will learn Git workflows and direct integrations with ALM tools. Git your team productive and awesome!",
    "description": "Git is not just a version control system. Git can change the way you interact with your team members. Lot's of teams don't think about reflecting their development workflow in Git and just use it out-of-the-box. Git, however, can be much more powerful, giving your team a boost in productivity, protecting your delivery pipeline and helping you to work better together. In this session we will start with a central workflow that is used by a lot of Subversion teams. You will learn how to practically integrate ALM solutions like continuous deployment, code reviews, change tracking and much more into your individual workflow. You will find out how to protect your master branch from accidental commits, broken builds and unreviewed code. This presentation will help you discover the best way to work together as a team - whether you're yet to migrate to Git or even an experienced Git user.",
    "room": "Room 3",
    "keyWords": [
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Sven Peters",
        "biography": "Sven Peters is a software geek working as an ambassador for Atlassian. He has been developing Java applications for over 12 years and leading small teams using lean methodologies. Sven likes effective software development and cares about the motivation of developers."
      }
    ],
    "year": 2013
  },
  {
    "title": "5 fallgruver med grid computing",
    "level": "intermediate",
    "intendedAudience": "Utviklere, arkitekter og andre beslutningstakere vil se hvilke avveiinger man bør gjøre før man innfører grid computing, i tillegg til konkrete eksempler på hva som fungerer og ikke fungerer.",
    "summary": "After a successful proof-of-concept in 2012, we present the pitfalls from implementing grid computing at the most important project in Tax Norway.",
    "description": "Etter en vellykket proof of concept i 2012 har Skatteetaten innført grid computing det viktige prosjektet for Modernisering Av Grunnlagsdata (MAG). Denne sesjonen presenterer erfaringene fra implementasjonen, med fokus på fallgruvene vi møtte underveis. Dette inkluderer kostnaden av redundans og flytting av data, kjøring av distribuerte jobber, kompakt representasjon av objekter, produksjons- og driftsarkitektur samt testing av tekniske krav og robusthet. Vi tar til slutt en en titt på alternative plattformer og teknologier til grid-teknologi.",
    "room": "Room 4",
    "keyWords": [
      "Core Java",
      "Experience report",
      "Architecture in practice",
      "Big Data and NoSQL",
      "Distributed systems and cloud",
      "Enterprise"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Trond Arve Wasskog",
        "biography": "Trond Arve Wasskog er utvikler, arkitekt og CTO i Bekk Consulting. Han har jobbet med utvikling på Java-plattformen i hele sin karrière, og satt sentralt både i PoC-en og i MAG-prosjektet."
      }
    ],
    "year": 2013
  },
  {
    "title": "Select; Arm; DEPLOY! - Building a missile-launcher style deploy button",
    "level": "beginner",
    "intendedAudience": "Attendees: Continuous delivery practitioners Makers / hardware hackers Deployment/Ops team members Benefits: Attendees will learn how to make their own mobile device with a business purpose for under â¬100. Expected knowledge: basic wifi, basic electronics, REST, Linux.",
    "summary": "Learn how to build & code a wireless missile-launcher style deployment button with enterprise-grade security for your product manager or team using a Raspberry Pi and some easily-available components.",
    "description": "Continuous Delivery is great, automating the whole build pipeline from commit to QA. However, that final stage of \"Deploy release to production\" is often still manual, especially in enterprise environments. The Product Manager will give the order, but it's still up to the ops team to perform the actual deployment process when they get the sign-off email. This talk shows you how to build and code a physical deployment box to eliminate that last manual step. Using a Raspberry Pi, some cheap components and a bit of time you can do it for about â¬100. The product manager can now perform the deployment herself by selecting the build number, arming the device with a key, and lifting the missile switch cover to press the deploy button. Outside of performing deployments, the box even works as a build monitor showing the current build with a red or green background to show the build status. You will learn how easy it is to build a Raspberry Pi-based gadget, how to keep its software updated using Chef, and how to securely store enterprise credentials on it.",
    "room": "Room 4",
    "keyWords": [
      "Mobile",
      "Craftsmanship and Tools",
      "Architecture in practice",
      "Continous delivery",
      "Enterprise",
      "Security"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Darren Hague",
        "biography": "Darren Hague is an engineering architect in SAP Global IT's Cloud Centre of Excellence. He has spent the last 10 years working in the area of identity management and single-sign on, specialising in the use of Java in the SAP ecosystem. Although his title says Architect he writes code more often than he writes PowerPoint slides, and he has spent the last couple of years working in an agile team using Contnuous Delivery to build a core component of SAP's cloud offering, the SAP ID Service. A speaker at Java and SAP conferences, he is also a SAP Mentor alumnus, co-organiser of annual SAP Inside Track London events, and author of the SAP Press book \"Universal Worklist with SAP NetWeaver Portal\"."
      }
    ],
    "year": 2013
  },
  {
    "title": "2-faktor autentisering – Hva må til for å hacke deg inn i Nettbanken?",
    "level": "beginner",
    "intendedAudience": "Forventet publikum er utviklere på alle nivåer",
    "summary": "I denne lyntalen ser vi på hvordan 2-faktor autentisering faktisk virker, hvor sikkert det er og hvordan man kan angripe metoden. I tillegg ser vi på hvilke begrensninger 2-faktor autorisering har, samt hvor kost-effektivt det er.",
    "description": "2-faktor autentisering blir mer og mer vanlig i dagens samfunn. Det brukes til alt fra innlogging i nettbank til mobile applikasjoner og spill. 2-faktor autentisering krever at en bruker benytter seg av to av tre faktorer for å identifisere seg selv; Noe brukeren vet Noe brukeren har Noe brukeren er De fleste har hørt om 2-faktor autentisering, men hva er det egentlig som foregår? Hvor sikre kan vi være på en angriper ikke klarer modifisere informasjon vi sender og kan vi stole på at informasjon vi mottar er fra den som påstår å ha sendt det? I denne lyntalen ser vi på hvordan 2-faktor autentisering faktisk virker, hvor sikkert det er og hvordan man kan angripe metoden. I tillegg ser vi på hvilke begrensninger 2-faktor autorisering har, samt hvor kostnads-effektivt det er. Hva skal til for å hacke deg inn i nettbanken? Hvordan kan du få tak i selvangivelsen til sjefen? Hvor lett er det å hacke Steam kontoen til kompisen? Kom og finn det ut!",
    "room": "Room 7",
    "keyWords": [
      "Research and Trends",
      "Security"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Ragne Elisabeth Henriksen",
        "biography": "Ragne Elisabeth Henriksen har en sivilingeniørgrad i Industriell Matematikk fra NTNU. Hun skrev masteroppgave om anonymitet i mobil kommunikasjon og er spesielt interessert i sikkerhet. Etter endt studie begynte hun å jobbe som IT-konsulent for Visma Consulting. Der har hun jobbet siden sommeren 2012. Hun jobber for tiden med forvaltning av nettsidene til Norad og Norsk Filminstitutt gjennom Enonic CMS. Hun er en frontendutvikler som hovedsakelig jobber med design, arkitektur og programmering i javascript, XSLT, HTML5 og CSS3."
      }
    ],
    "year": 2013
  },
  {
    "title": "Chef for developers",
    "level": "beginner",
    "intendedAudience": "Developers, DevOps",
    "summary": "Chef for developers - what you need to get started with coding your infrastructure",
    "description": "There's a reason Heroku is so popular. As developers we often prefer to focus on coding (and sometimes providing business value) over setting up and maintaining servers and infrastructure. Setting up a full stack with e.g. apache/nginx, containers/wrappers, permissions, monitoring, alerts etc. can be a daunting task if you have not experienced it before. Even more terrifying is the thought of having to do it all again (from memory, or some patchy notes) if the server crashes or you need to scale out horizontally. From a developer's perspective I'll show you how \"easily\" you can setup your own servers with Chef.",
    "room": "Room 2",
    "keyWords": [
      "Craftsmanship and Tools",
      "Alternative languages",
      "Experience report",
      "Continous delivery",
      "Distributed systems and cloud",
      "Innovation and Startups"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Erling Wegger Linde",
        "biography": "Erling is the founder of the norwegian startup CV Partner AS - providing simplified CV management for consultancies. Besides being an entrepreneur, (which involves mastering a wide range of roles - spanning from CFO to product manager), he is a passionate developer who prefers to work with cutting edge technology. Having real-life international experience with everything from Kanban to Lean Startup, he is beyond being religious about process and methodologies, and is now more pragmatic and context-aware than ever."
      }
    ],
    "year": 2013
  },
  {
    "title": "CRaSH : the shell for the Java Platform",
    "level": "beginner",
    "intendedAudience": "Anyone using a JVM can attend this talk. No specific knowledge than being familiar with the command line interface is expected. The audience will learn how to use CRaSH for their own needs: it can be a simple usage or more advanced like developing a command or embedding the shell in their own runtime like a web application or a Spring application.",
    "summary": "Learn how to provide a powerful command line interface to your JVM with CRaSH the shell for the Java Platform.",
    "description": "CRaSH is an open source shell for extending and monitoring a Java Virtual Machine. The shell can be accessed by various means, either remotely using network protocols such as SSH or locally by attaching a shell to a running virtual machine. Commands are written in the Groovy language and can be developed live making the extensibility of the shell easy with quick development cycles. CRaSH comes with a bunch of commands such as thread management, log management, database access and JMX. The session will begin with an introduction to the shell, showing basic CRaSH features like auto completion and basic commands. The main part of the quickie will focus on showing how to develop CRaSH commands with several examples, showing how easy and powerful the development of a command can be. The target audience is pretty much anyone using a JVM. Attendees will learn how to install CRaSH, connect to an instance and develop a CRaSH command to interact with virtual machine resources or services.",
    "room": "Room 5",
    "keyWords": [
      "Core Java",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Alain Defrance",
        "biography": "Alain Defrance is currently working at BitTitan Inc. (http://www.bittitan.com) as core developer. Prior to BitTitan, Alain was project lead at eXo platform and used to contribute to open source projects like GateIn, CRaSH, Chromattic and wikbook."
      },
      {
        "name": "Julien Viet",
        "biography": "Julien Viet leads product development of eXo Platformâs flagship eXo Portal product on which the entire eXo product line is based. In June 2009, eXo Portal was merged with JBoss Portal to create GateIn, which Julien now co-leads. In this role, he is deeply involved in GateInâs technical vision and plays a key role in product development and advanced R&D architecture prototyping. Prior to eXo, Julien was an engineer at JBoss, where he founded the JBoss Portal project in 2004. In four years, Julien built an enterprise-class portal server with a team of only five developers. He started contributing to the JBoss project (application server) in 2002 and joined JBoss, Inc. two years later. Julien is passionate about open source and active in standards groups. In his spare time, he started the Chromattic project, an advanced Object to Java Content Repository (JCR) mapping framework that now underpins the GateIn project. He is also an expert group member for several Java specifications, including Portlet 2.0 (JSR-286), Content Repository for Java Technology API 2.0 (JSR-283) and Portlet Bridge for JavaServer Faces (JSR-301). Julien holds an engineering degree from Institut National des TÃ©lÃ©communications, one of Franceâs top schools for engineering."
      }
    ],
    "year": 2013
  },
  {
    "title": "Hvordan og hvorfor gå fra log4j til logback",
    "level": "beginner",
    "intendedAudience": "Denne lyntalen vil passe godt for backend-utviklere som er interessert i å vite mer om logback og slf4j, og hvordan dette kan forbedre loggingen til din applikasjon.",
    "summary": "Bruker applikasjonen din log4j? Vurderer du å bytte til logback, men er usikker på de faktiske gevinstene? Frykter du at det tar mye tid å skrive om applikasjonen? I denne lyntalen viser jeg hvorfor og ikke minst hvordan du skriver om applikasjonen din til å bruke logback.",
    "description": "Bruker applikasjonen din log4j? Vurderer du å bytte til logback, men er usikker på de faktiske gevinstene? Frykter du at det tar mye tid å skrive om applikasjonen? I denne lyntalen vil jeg gå gjennom de viktigste fordelene med logback sammenlignet med log4j. I tillegg vil jeg vise hvordan man går frem for å skrive om en applikasjon som bruker log4j til å bruke logback, og hvilke utfordringer man kan støte på og hvordan disse kan løses.",
    "room": "Room 7",
    "keyWords": [
      "Experience report",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Henrik Wingerei",
        "biography": "Henrik har en mastergrad i Informatikk fra Universetet i Oslo, og har jobbet ett år som konsulent i BEKK Consulting hvor han jobber som Java-utvikler. Som medlem av faggruppen Programmeringsspråk har han også en interesse for alternative språk og programmeringsparadigmer."
      }
    ],
    "year": 2013
  },
  {
    "title": "Ten man-years of JavaFX: Real-world project experiences",
    "level": "intermediate",
    "intendedAudience": "People that know about JavaFX (but not necessarily that have tried it) with very basic knowledge in functional programming. After the presentation, the participants will be better prepared to use JavaFX in one of their projects.",
    "summary": "This isn't another JavaFX presentation by a technology evangelist at Oracle. This presentation is about the experiences from using JavaFX in a big commercial project -- the things you don't get by reading the manual.",
    "description": "This session shares the experiences from the development of LoadUI, a large JavaFX-based open source project. The following topics are discussed: • Using JavaFX Scene Builder as a bridge between designers and developers. • GuavaFX – an in-house developed functional library for JavaFX’s ObservableLists. Why the functional paradigm fits JavaFX perfect. • Migrating from 30 000 lines of JavaFX 1. • Automated GUI testing – a simple approach. • Combining MigLayoutFX2 and GroovyFX in a domain specific language. Along the way, you will also see how key JavaFX features, such as real-time charts, custom controls, the WebView, drag-n-drop, animations and effects are being used in LoadUI to make the user interface a competitive advantage.",
    "room": "Room 2",
    "keyWords": [
      "Alternative languages",
      "Experience report",
      "Frontend",
      "Functional Programming"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Henrik Olsson",
        "biography": "Henrik Olsson is a Lead Developer and Product Owner at SmartBear Software. The last years he has been working exclusively on software that uses JavaFX to its full extent, including leading the project of converting 30 000 lines worth of JavaFX 1 to JavaFX 2."
      }
    ],
    "year": 2013
  },
  {
    "title": "Elasticsearch – mye mer enn søk!",
    "level": "intermediate",
    "intendedAudience": "Foredraget er tiltenkt utviklere i prosjekter hvor søk, navigering og analyse av data er viktig, og gir en oversikt som er vanskelig å få ut av eksisterende dokumentasjon. Erfaring med søkemotorer er ikke påkrevd, men noe erfaring med databaser er en fordel.",
    "summary": "Søkemotorer kan løse langt fler utfordringer enn en søkeboks gir. Du har kanskje et søkeproblem uten å være klar over det?",
    "description": "Elasticsearch, en open source søkemotor bygd på Lucene, får stadig mer oppmerksomhet - ikke bare fordi den er glimrende til å løse typiske søkeproblemer, men også fordi den kan brukes til analyse- og \"big data\"-utfordringer. Foredraget gir en oversikt over hva søkemotorer er gode på, relaterte problemer du kommer over, hvordan Elasticsearch kan bidra – samt hvordan den passer inn i teknologistacken din. Det er ingen tutorial, men med et relativt høyt tempo og eksempler med realistisk kompleksitet gis en oversikt over hva som er mulig. Vi runder av med hvordan Elasticsearch kan klassifiseres i mylderet av \"NoSQL\"-databaser.",
    "room": "Room 2",
    "keyWords": [
      "Big Data and NoSQL",
      "Distributed systems and cloud"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Alex Brasetvik",
        "biography": "Alex er sivilingeniør i datateknikk fra NTNU, med fordypning i databaser og søkemotorer, bl.a. med masteroppgave for FAST. Som med-gründer og utvikler i Found, en norsk leverandør av søk som en tjeneste, har han jobbet med søkeløsninger de siste syv årene – og Elasticsearch de siste to. Når han ikke hopper ut fra fly for å ta på skyer, drifter han og Found AS hundrevis av Elasticsearch-clustre i skyen - bl.a. for New York Public Library, TED og LiveNation."
      }
    ],
    "year": 2013
  },
  {
    "title": "Safe REST full of OAuth",
    "level": "intermediate",
    "intendedAudience": "- any who want to touch OAuth, - web developers, - interface designers How will participants benefit: - get to know good practices on hypertext driven interfaces, - receive outline view on OAuth, - know example system structure What should they know before the talk: - general idea about RESTful web services, - general idea behind Authorization",
    "summary": "Many of the modern web services are RESTful and use hypertext as an interface. But how to assure they are both safe and accessible? OAuth comes in and makes itself comfortable here. This short introductory will walk you through some good practices in hypertext driven interfaces and then will put some light on OAuth 2.0 - standard used even by the biggest players - and its application into our web service.",
    "description": "Many of the modern web services are RESTful and use hypertext as an interface. But how to assure they are both safe and accessible? OAuth comes in and makes itself comfortable here. This short introductory will walk you through some good practices in hypertext driven interfaces and then will put some light on OAuth 2.0 - standard used even by the biggest players - and its application into our web service. When you design RESTful hypertext driven API focus on usability, make it that clear that your users don't need any manual. Make it in the purest way so that it will be accessible for the broadest audience possible. Then, if you will also use OAuth you will spread it even further to be usable out of the box by clients that already use this standard. I will present briefly to participants flow of the authorization and authentication of the protocol and its security aspects. The most important thing is how we can benefit from applying it to our web service? I will point some key areas. For example the resources you want to serve can be and should be divided into logical and consistent parts - each of them require different level of access, which ideally suits to OAuth scopes. But how the whole system could look like? The diagram will show how example system can be composed of and will point out technologies that can be used to build it.",
    "room": "Room 7",
    "keyWords": [
      "Architecture in practice",
      "Enterprise",
      "Security"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Grzegorz Kolano",
        "biography": "Software developer at Idium AS."
      }
    ],
    "year": 2013
  },
  {
    "title": "You probably don't know how the internet actually works",
    "level": "intermediate",
    "intendedAudience": "This talk is perfect for people that haven't read Tannenbaum's networking book, and that wants to know how TCP, UDP, WAN, LAN, NAT, Ethernet, SSL, TLS, SSH, DHCP and DNS actually works (yes, you'll learn all of this in 50 minutes). The only prerequisite is that you're a programmer with a little bit of experience.",
    "summary": "You probably know that you can transmit arbitrary data from point A to B using the internet. But how does this actually work?",
    "description": "You know that the internet lets you send data from A to B, and that it's a global network. But how does this actually happen? Which bits and bytes are transmitted on the copper cables from your computer to the WiFi access point or the plug in the wall, and beyond? What happens when you ping another computer? Why doesn't ping care about port numbers? How can you get an IP address from your router at home, without being a catch 22? How does the router know how to talk to your machine before your machine has an IP address? Why exactly is HTTPS secure? What does the internet lack that requires HTTPS for security?",
    "room": "Room 6",
    "keyWords": [
      "Distributed systems and cloud",
      "Security"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "August Lilleaas",
        "biography": "Full-stack web developer at Kodemaker. Has built stuff for iOS, with Rails, on the JVM (mostly Clojure, some Groovy, very little Java). Likes user interface programming. Hopes to one day be able to take a year off to write a book about the history of the internet."
      }
    ],
    "year": 2013
  },
  {
    "title": "Unfiltered Directives - doing http right",
    "level": "advanced",
    "intendedAudience": "Anyone interested in the web, http, Scala and functional programming. While the examples will be in Scala, the concepts are easily portable to other languages. Participants will learn how ideas from monadic parser combinators turned out to be an awesome way of writing web applications. Basic knowledge of http and functional programming is expected.",
    "summary": "Writing well behaved http applications is hard. Very hard. But it shouldn't be that way... Unfiltered Directives is a library aiming to solve that problem",
    "description": "Writing well behaved http applications is hard. Very hard. But it shouldn't be that way... Unfiltered Directives is the latest addition to Unfiltered - a Scala toolkit for servicing http requests. Directives is an attempt at making it simpler to write readable and well behaved web applications. By leveraging ideas from monadic parser-combinators, Unfiltered-Directives is a breath of fresh air in a world of ignorant web frameworks. The presentation will demonstrate why http is hard to do right, before diving into a discussion of http, parsing, functional programming, monads and how it all comes together to form a simple and usable library.",
    "room": "Room 6",
    "keyWords": [
      "Alternative languages",
      "Frontend",
      "Functional Programming"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jon-Anders Teigen",
        "biography": "Jon-Anders Teigen is software developer from Oslo. He is a co-founder of ScalaBin and Oslo Socially Functional, is co-organizing the flatMap(Oslo) conference, and has previously been part of the JavaZone program committee. Jon-Anders is the author of Unfiltered-Directives."
      }
    ],
    "year": 2013
  },
  {
    "title": "Helios - En atmosfære for din app",
    "level": "intermediate",
    "intendedAudience": "Potensielle og nåværende app-utvilkere med litt forståelse for mobil-integrasjon.",
    "summary": "Noen ganger trengt en backend til mobil-idèen din? Helios kan hjelpe deg! Helios er enkel og rask mobilbackend som dekker de fleste behov!",
    "description": "Mange app-prosjekter strander fordi man trenger en form for sentral server for å knytte sammen klientene sine. Ideen din trenger kanskje sentral lagring i skyen, push-meldinger, konfigurasjon eller brukerhåndtering? La meg introdusere Helios! Fra mannen bak rammeverket AFNetworking og IOS-bloggen NSHipster, Matt Thompson, kommer Helios. Kort fortalt er helios en app-backend basert på ruby, sinatra og postgres som er skreddersydd for å deploye til heroku. Helios spiser din CoreData-modell og gir deg et rest-api for lagring i skyen, den gir deg også push-services og brukerhåndtering. Det beste med Helios er ledsagerbibliotekene til iOS, dette er biblioteker som (relativt) sømløst lar deg koble appen din til den heroku-hostede backenden.",
    "room": "Room 7",
    "keyWords": [
      "Distributed systems and cloud",
      "Mobile"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Aleksander Grande",
        "biography": "Java backendutvikler som til vanlig jobber med enterprise java serverløsninger. Har mobilutvikling som en guilty pleasure, og har jobbet mer og mer med det de siste årene."
      }
    ],
    "year": 2013
  },
  {
    "title": "Et år med Angular.js",
    "level": "intermediate",
    "intendedAudience": "Web developers and architects looking for modern tools for creating applications in the browser.",
    "summary": "Lær hvordan Angular.js kan brukes til å lage nestegenerasjons applikasjoner i nettleseren.",
    "description": "Hvordan AngularJS enkelt lar deg lage en moderne webapplikasjon, selv med kjente og trauste Spring og Hibernate på serversiden. Dersom du lager webapplikasjoner og brukeropplevelse er noe du bryr deg om, så burde Angular være av interesse for deg. Angular oppgraderer nettleseren og lar den gjøre ting du knapt trodde den var i stand til. For et drøyt år siden satte vi oss som mål å lage landets første brukervennlige regnskapssystem. På fritiden. Spring og Hibernate kjente vi godt nok til å vite at de ikke ville stå i veien. På klientsiden stod det verre til, det eneste vi egentlig var sikre på var hva vi ikke ville bruke (ExtJs, GWT...). Vi trengte noe med superkrefter. Vi trengte AngularJS.",
    "room": "Room 4",
    "keyWords": [
      "Experience report",
      "Frontend",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Trygve Laugstøl",
        "biography": "Trygve Laugstøl jobber som utvikler og fagsjef i Nets."
      },
      {
        "name": "Joakim Blomskøld",
        "biography": "Joakim Blomskøld jobber som eneste utvikler i Profsys. Han har mer enn 10 års erfaring med Java og webutvikling."
      }
    ],
    "year": 2013
  },
  {
    "title": "Hobbyprogrammering for proffer",
    "level": "intermediate",
    "intendedAudience": "Utviklere og andre som programmerer mye på fritida, og som har lyst til å få mer ut av hobbyen. Tilhøreren burde ha erfaring med ihvertfall et par, tre hobbyprosjekter i hvilket som helst programmeringsspråk",
    "summary": "Hvordan gjøre hobbyprosjekter som ender opp i ingenting om til prosjekter som gjør at du utvikler deg selv som programmerer og får mer selvtillit i den daglige utviklingsjobben.",
    "description": "Har du noengang programmert natt og dag på et hobbyprosjekt, for så å plutselig arkivere det for evig tid uferdig i nærmeste versjonskontrollsystem? Har du 50 uferdige prosjekter på GitHub og føler at du ikke får nok igjen for all tiden du bruker på det? Jeg vil i denne talken presentere tips for å få mest mulig ut av hobbyprosjekt; både for egen mestringsfølelse, og karrieremessig.",
    "room": "Room 7",
    "keyWords": [
      "Innovation and Startups"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Anders Emil Salvesen",
        "biography": "Juniorkonsulent hos Nav for Visma Consulting. Har holdt på med utallige hobbyprosjekter i utallige forskjellige webrammeverk som aldri har kommet noe lenger enn utviklingsserveren. I det siste tenkt mange tanker om hvordan løfte hobbyprogrammeringen til nye høyder så jeg kan dra nytte av det i arbeidsdagen."
      }
    ],
    "year": 2013
  },
  {
    "title": "State or intent? How should you store your data?",
    "level": "intermediate",
    "intendedAudience": "Developers who are tired of relational database and want to try something new.",
    "summary": "A lot of people have heard of Event Sourcing, but few has really understood the strength of it. All the discussions you hear about data storage mainly focus on what type of storage you should use, but few discussions focus on what to store. I will in this presentation give a short introduction to event sourcing and why I think it is a good way to store your data.",
    "description": "A lot of people have heard of Event Sourcing, but few has really understood the strength of it. All the discussions you hear about data storage mainly focus on what type of storage mechanism you should use, but few discussions focus on what to store. I will in this presentation give a short introduction to event sourcing and why I think it is a good way to store your data. My goal with this talk is to give you the basic understanding in how to use event sourcing and why you should use it. I will also show you how event sourcing could guide you building better software focusing on what the business really need instead of just storing data.",
    "room": "Room 7",
    "keyWords": [
      "Big Data and NoSQL"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Tomas Jansson",
        "biography": "Passionate developer from the .NET camp. I currently work as a manager at BEKK Consulting where I am the .NET group lead. In the evenings I focus on trying out new things and one of those projects is a CQRS project I've done, https://github.com/mastoj/TJ.CQRS, where I also used event sourcing. During my years as an IT-consultant I have been working with a broad variety of languages and technologies. I have professional experience from java, perl, .NET, SAP and SAS BI."
      }
    ],
    "year": 2013
  },
  {
    "title": "Med Groovy som verktøy for å teste javakode",
    "level": "beginner",
    "intendedAudience": "Forventet publikum er javautviklere",
    "summary": "Groovy er et uttrykkskraftig programmeringsspråk med mange bruksområder. Presentasjonen viser hvordan man kan bruke Groovy for å skrive bedre og mer lesbare enhetstester i Java.",
    "description": "Hvordan skrive bedre og mer lesbare enhetstester? Groovy er svaret. Groovy er et enkelt og uttrykkskraftig programmeringsspråk for javaplattformen. Med sin enkle og smidige syntaks, rike bibliotek og ikke minst, muligheten for å integrere med vanlig javakode, fremstår Groovy som et kraftfullt språk med mange bruksområder. Et av disse er enhetstesting. Ved å kombinere Groovy og JUnit så har man praktisk talt alt man trenger for å skrive en fullverdig enhetstest. Groovy har nemlig innebygd støtte for både mocking og stubbing og i tillegg så har man tilgang på enkle API som gjør det superenkelt å verifisere resultater. Presentasjonen gir en introduksjon til hvordan man kan bruke Groovy for å teste javakode.",
    "room": "Room 7",
    "keyWords": [
      "Alternative languages",
      "Core Java"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Rune Høivik",
        "biography": "Rune Høivik er utdannet sivilingeniør fra NTNU, og jobber som utvikler i Visma Consulting. Han har over 8 års erfaring med utvikling på javaplattformen og har deltatt på store prosjekter innefor både offentlig og privat sektor. Rune er genuint opptatt av kodekvalitet."
      }
    ],
    "year": 2013
  },
  {
    "title": "Ruby on Rails i enterprise Java verden",
    "level": "intermediate",
    "intendedAudience": "For folk som vil se hvordan man ikke nødvendigvis trenger å være bundet til \"de vanlige\" javateknologiene selv om man opererer i ett enterprise Java økosystem. Man vil se at det er mulig å bruke alternative språk og teknologier, i dette tilfelle Ruby on Rails, og kjøre dette på en plattform som er ikke er designet for dette formålet. Publikum bør vite hva Ruby on Rails er på forhånd.",
    "summary": "Ruby on Rails er nok ikke det første folk tenker på når man har ett enterprise økosystem bygd opp rundt Java. Denne lyntalen vil beskrive hvordan det er mulig å faktisk kjøre Ruby on Rails applikasjoner selv om man er bundet til Java tung enterprise arkitektur.",
    "description": "Ruby on Rails er nok ikke det åpenbare teknologivalget når man sitter dypt i enterprise Java verden, men i vinter implementerte Oslo Kommune 2 nye fagsystemer i (J)Ruby on Rails. Applikasjonene måtte oppfylle krav om å kunne releases, deployes, og kjøres på Java miljøet som allerede fantes på Oslo Kommunes platform. I lyntalen vil jeg gå igjennom hvilke teknologier vi brukte, hvilke problemer vi støtte på, og hvordan vi integrerte Ruby on Rails for å sømløst kunne bygge og deploye applikasjonene på platformen, som om de var en helt vanlig Java applikasjon.",
    "room": "Room 7",
    "keyWords": [
      "Alternative languages",
      "Architecture in practice",
      "Continous delivery"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Jon Vassbø",
        "biography": "Jon er en utvikler med over 6 års erfaring, nå ansatt hos Knowit Objectnet. Er opptatt av å finne gode helhetlige løsninger, og har gjort dette på både store og små prosjekter. Trives like godt med front- og backend, og for tiden jobber han på Oslo Kommunes integrasjonsplattform med &quot;litt av alt&quot;."
      }
    ],
    "year": 2013
  },
  {
    "title": "Hva har Tetris til felles med kompleksitet?",
    "level": "beginner",
    "intendedAudience": "Denne lyntalen passer for alle som er interessert i softwareutvikling og som er opptatt av å levere god software. Etter lyntalen håper jeg at du som hørte på, kan nikke gjenkjennende til det som ble fortalt, og at når du kommer tilbake til ditt daglige arbeid kan ta opp tråden og bruke noen av tipsene.",
    "summary": "Tetris er et klassiskt spill hvor mye av utfordringen ligger i å holde kompleksiteten nede. For å lykkes med det, kan det være lurt å tenke litt fremover, og ikke bare neste brikke. Noen ganger kan det også være lurt å ta en pause, for å ta tilbake kontrollen. Mye av dette kan også relateres til softwareutvikling.",
    "description": "En gjenganger i mange prosjekter er kompleksitet. Den vokser gjerne naturlig etterhvert som prosjektet går fremover. Men ofte opplever jeg også at mye av kompleksiteten kunne vært unngått dersom vi hadde gjort en bedre designjobb. Nå som alle skal være smidige, er det mange som har sluttet med design. Vi starter bare å kode, og forsøker å endre oss når vi får tilbakemeldinger. Men det er ikke alle endringer som er like lette å gjøre i etterkant.",
    "room": "Room 7",
    "keyWords": [
      "Experience report",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Terje Heen",
        "biography": "Terje jobber i dag for WebStep, og har mer enn 10 års erfaring. Han har et sterkt engasjement for utvikling og applikasjonsarkitektur, og er opptatt av kunnskapsdeling og å skape verdi. Tidligere har Terje holdt lyntaler om \"Kjenn ditt domene - bruk av verdiobjekter\" (JavaZone 2011), \"Ikke gå i luksusfellen\" (Smidig 2011) og \"Vertikal vs. horisontal inndeling av kode\" (JavaZone 2012)."
      }
    ],
    "year": 2013
  },
  {
    "title": "Customer value through quality requirements",
    "level": "beginner",
    "intendedAudience": "Product owners, Developers, Architects, Business analysts, Test leads, Project managers",
    "summary": "How do you know what to build of your customer wants a \"secure solution with a good amount of flexibility and user friendliness\"? You don't! Force the customer to be more specific!",
    "description": "Maximizing customer value is one of the most important guiding principles in agile development practices. After some years with experience with agile practices, we now see that an exclusive focus on value expressed as functionality can seriously undermine the quality of the software product. This manifests itself as bad usability, poor performance or unchangeable software. This has led to a slightly stronger focus on code quality and software architecture to solve these issues. But in all project environments resources; time and money, are limited and the owners of the project initiative want value for money. Quality is also perceived as a technical or architectural issue not something the product owner should care (or know something) about. It is much more difficult to measure quality compared to time, cost or functionality, so it's hard to know if you're delivering software with sufficient quality or not. And if you can't measure quality it's difficult to challenge your development team on it. This is where measurable quality requirements come to the rescue. In this talk I will suggest how you handle and formulate quality requirements in a way that lets the customer - prioritize between different quality attributes - prioritize between quality and cost - measure if acceptable quality is delivered I will also explain the clear distinction between two types of non-functional requirements, constraints (technology, design, architecture) and quality requirements.",
    "room": "Room 7",
    "keyWords": [
      "Architecture in practice",
      "Enterprise",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Mario Ek Aparicio",
        "biography": "Mario works as a consultant at Miles. Mario's main focus areas are architecture, requirement engineering, and agile processes. Although Mario is currently working more with processes and methodology, he is has a strong interested in technology and technology trends. He often engages himself in discussions about innovation that can change the IT-industry. Mario has held presentations at JavaZone for several years, and has discusses many diferent topics such as: BPM and SOA, jBPM , Scrum and OpenSSO. Mario is the lead organizer(Board leader) of the Oslo Software Architecture Meetup."
      }
    ],
    "year": 2013
  },
  {
    "title": "Managing Asynchronicity in JavaScript with RQ",
    "level": "advanced",
    "intendedAudience": "Anyone using, or considering using, serverside Javascript",
    "summary": "Managing Asynchronicity in JavaScript with RQ",
    "description": "Turn based servers such as Nodejs are now joining turn based browsers in providing race-free and deadlock-free interactivity. The event-driven model has long been popular in UI systems, but the nature of work in servers presents some new challenges. Functional programming provides solutions, including monads, arrows, promises, and various flavors of FRP. This is another such solution, targeted specifically to the challenges of high performance web applications.",
    "room": "Room 3",
    "keyWords": [
      "Frontend",
      "Functional Programming"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Douglas Crockford",
        "biography": "Douglas Crockford"
      }
    ],
    "year": 2013
  },
  {
    "title": "Virtuelt utviklingsmiljø - funker det?",
    "level": "beginner",
    "intendedAudience": "utviklere, teknisk ansvarlige",
    "summary": "Se for deg en ideell verden hvor utviklingsmiljøene dine for store, tunge enterprise-prosjekter settes opp out-of-the-box, og kan reverteres til en ryddig og feilfri tilstand hvis noe skjærer seg. Drøm eller virkelighet - virtuelt utviklingsmiljø er begge deler!",
    "description": "Se for deg en ideell verden hvor utviklingsmiljøene dine for store, tunge enterprise-prosjekter settes opp out-of-the-box, og kan reverteres til en ryddig og feilfri tilstand hvis noe skjærer seg. Drøm eller virkelighet - virtuelt utviklingsmiljø¸ er begge deler!",
    "room": "Room 7",
    "keyWords": [
      "Experience report",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Dag Willy Findal-Fossmo",
        "biography": "Dag Willy er \"lead developer\" på en stort javaprosjekt i Computas. Han har 12 års erfaring fra bransjen, og bred erfaring fra SOA-implementasjon, Java EE og Smalltalk."
      },
      {
        "name": "Harald Søvik",
        "biography": "Harald er teknisk prosjektleder i Computas. Han har jobbet med store javaprosjekter i 7 år, og er også fagleder for Java i bedriften."
      }
    ],
    "year": 2013
  },
  {
    "title": "Java + PaaS + Drift = Sant",
    "level": "intermediate",
    "intendedAudience": "Utviklere som vil ha større fleksibilitet i valg av teknologier og design når man utvikler applikasjoner. Driftere som vil bli mer effektive og forbedre hvordan man kan støtte fleksibilitet og effektiv utvikling bedre.",
    "summary": "Jeg kan fortelle hvorfor drift bør elske cloud og PaaS. Men det er ikke sikkert utviklere vil like grunnene.",
    "description": "Noen ganger føles det som om drift bare holder igjen, helst vil unngå applikasjoner, oppdateringer og utviklere. Hvorfor kan vi ikke gjøre noe spennende? Det er trist å fortsatt holde på med relasjonsdatabaser når alle snakker om NoSQL. Det er kjipt å måtte bruke JSF når alle snakker om rike klienter i HTML5 og JavaScript. Hvis man bare fikk bestemme selv. Litt self service på cloud? Som Heroku? Så kunne man blitt mye mer effektiv og hatt det morsommere på jobb. Fett! Nå er det mange grunner til at man ikke kan ta i bruk Heroku i organisasjoner. Men hva hvis man kan gjøre det samme på sine egne servere? En egen Platform-as-a-Service? Da vil faktisk mange av hindringene forsvinne, vi må bare overbevise drift først... Jeg kan fortelle hvorfor drift bør elske cloud og PaaS. Men det er ikke sikkert utviklere vil like grunnene. Jeg vil gi en kjapp oversikt over hva som finnes på markedet for Platform-as-a-Service in-house, og noen betraktninger om hva som du må se etter. Vi har gjort oss noen efaringer, og har noen midlertidige resultater.",
    "room": "Room 3",
    "keyWords": [
      "Architecture in practice",
      "Continous delivery",
      "Distributed systems and cloud",
      "Experience report"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Anders Sveen",
        "biography": "Anders jobber som utvikler og arkitekt hos Miles i Oslo. Han har i det siste jobbet såpass mye med Bash og Linux at han har begynt å kalle seg for drifter. I utformingen av systemer er smidig systemutvikling viktig, og han forsøker å balansere effektivitet og hastighet med forutsigbarhet og stabilitet i produksjon. Han har erfaring fra små, store, bra og dårlige smidige prosjekter, men lærer stadig nye ting. Gjennom erfaringen med drift og ansvar i produksjon har han erfart hvor viktig det er å få hele verdikjeden til å spille sammen, ikke bare utvikle kjapt. Det finnes få ting som er så gøy som å legge ut noe i produksjon én dag, måle den neste, og legge ut en korreksjon den tredje dagen."
      }
    ],
    "year": 2013
  },
  {
    "title": "Mutation testing with Pitest",
    "level": "beginner",
    "intendedAudience": "Developers, testers and project managers would benefit from attending this session as it presents both a technique to verify requirements and a tool to accomplish these requirements.",
    "summary": "Every statement in your system is a potential defect. How can know for sure that your test suite will catch these bugs? By using mutation testing tools you will be able to run your tests on an automatically mutated version of your codebase and actually verify that not only has your code been run in your tests. They discover the bugs that may or may not be introduced.",
    "description": "Are you sure your coverage-report can be trusted? Yes, you run 75 percent of your code during unit testing, but will these tests actually catch if you introduce a bug? By using a mutation testing-tool like Pitest you will be able to identify weak spots and you get an overview of how much of your code is actually asserted. This lightning talk will explain mutation testing, and it will demonstrate how to quickly get up and running with Pitest using maven.",
    "room": "Room 7",
    "keyWords": [
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Tommy Bø",
        "biography": "Tommy Bø is a senior consultant at Visma Consulting. He has more than eight years developing on the Java platform, and has always been advocating unit testing and other tools to increase the quality of software development."
      }
    ],
    "year": 2013
  },
  {
    "title": "Functional Programming in Java: lambdas and beyond",
    "level": "intermediate",
    "intendedAudience": "Java developers who wants a preview on how lambda expressions will work in Java 8 and a few hints on how to use them effectively.",
    "summary": "After a quick overview of the upcoming lambda expressions in Java8, the main purpose of this talk is to show, with practical examples, how to use them effectively and how they can help to develop more concise and readable code.",
    "description": "Finally also Java, with its 8th major release, will have lambda expressions and then will allow to employ some functional techniques into its strongly object oriented paradigm. But why this decision has been taken, what will be its consequences, how will it change the way we write Java and, most important, how can we leverage it to develop more expressive, readable, reusable and effective software? After a quick introduction to the syntax of the new lambda expressions, the main purpose of this talk is to answer these questions, showing how functional programming can make us better Java developer and help to avoid or limit some bad habits inherited from our OOP backgroud, like the abuse of side effects, null references and exceptions in our code.",
    "room": "Room 5",
    "keyWords": [
      "Core Java",
      "Functional Programming"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Mario Fusco",
        "biography": "Mario is a senior software engineer at Red Hat working at the development of the core of Drools, the JBoss rule engine. He has a huge experience as Java developer having been involved in (and often leading) many enterprise level projects in several industries ranging from media companies to the financial sector. Among his interests there are also functional programming and Domain Specific Languages. By leveraging these 2 passions he also created the open source library lambdaj with the purposes of providing an internal Java DSL for manipulating collections and allowing a bit of functional programming in Java."
      }
    ],
    "year": 2013
  },
  {
    "title": "Implementer tofaktor autentisering på 10 minutter!",
    "level": "intermediate",
    "intendedAudience": "Denne lyntalen passer for Java-utviklere som ønsker å lære hvordan man tar i bruk Google Authenticator for tofaktor autentisering.",
    "summary": "Lær hvordan man implementerer og tar i bruk tofaktor autentisering ved hjelp av Google Authenticator.",
    "description": "Har du brukere som benytter «JavaZone2013» som passord? Har nettstedet ditt data som bør sikres bedre? Eller ønsker du rett og slett å tilby brukerne dine en sikrere innloggingsvariant? De fleste av oss går i dag rundt med en mobiltelefon i lomma. Mobiltelefonen kan enkelt benyttes i en tofaktor autentiseringsløsning ved hjelp av Google Authenticator. Google har utviklet mobilapplikasjonen. Det som gjenstår for deg er å ta dette i bruk på nettstedet ditt. I løpet av denne lyntalen vil du lære hvordan man implementerer støtte for tofaktor autentisering ved hjelp av Google Authenticator.",
    "room": "Room 7",
    "keyWords": [
      "Core Java",
      "Security"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Jostein Tveit",
        "biography": "Jostein har jobbet med Javautvikling i 9 år og har en genuin interesse for både Java og sikkerhet. Det siste året har Java-verden virkelig fått erfart at det finnes et viktig fagfelt som heter sikkerhet. Denne oppvåkningen fører forhåpentligvis til at både Java i seg selv og flere Java-applikasjoner blir sikrere enn i dag. Jostein hjelper til med å holde fokus på sikkerhet i Java-verden. Til daglig jobber han som Senior Software Engineer hos Steria."
      }
    ],
    "year": 2013
  },
  {
    "title": "Exploring Ceylon in Eclipse",
    "level": "beginner",
    "intendedAudience": "Folks interested in alternative programming languages for Java and JavaScript virtual machines.",
    "summary": "Get a taste of the Ceylon language and see how Ceylon's powerful type system and built-in modularity enables sophisticated tooling.",
    "description": "Ceylon is a new programming language designed for writing large programs in teams. The language emphasizes readability, modularity, typesafety, and tooling. Ceylon programs execute on Java and JavaScript virtual machines. In this session, Gavin King will demonstrate some interesting features of Ceylon's type system by writing code in Ceylon IDE.",
    "room": "Room 6",
    "keyWords": [
      "Alternative languages"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Gavin King",
        "biography": "Gavin King leads the Ceylon project at Red Hat. Gavin is the creator of Hibernate, a popular object/relational persistence solution for Java, and the Seam Framework, an application framework for enterprise Java. He&apos;s contributed to the Java Community Process as JBoss and then Red Hat representative for the EJB and JPA specifications and as lead of the CDI specification. Gavin now works full time on Ceylon, polishing the language specification, developing the compiler frontend, and thinking about the SDK and future of the platform. He&apos;s still a fan of Java, and of other languages, especially Smalltalk, Python, and ML."
      }
    ],
    "year": 2013
  },
  {
    "title": "10 grunner til å ha Guava på classpathen",
    "level": "beginner",
    "intendedAudience": "Utviklere på alle nivåer.",
    "summary": "Lyntalen går gjennom 10 praktiske eksempler på bruk av Guava biblioteket og ser på hvordan det passer sammen med Java 8.",
    "description": "I dagens hverdag med blant annet Maven er det veldig lett å legg til og fjerne artefakter fra applikasjonen vår. I denne lyntalen kommer det 10 grunner til at du skal legge Guava biblioteket til på classpathen. Til slutt ser vi på hvordan vi kan bruke Guava sammen med Java 8.",
    "room": "Room 7",
    "keyWords": [
      "Core Java",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Ingar Abrahamsen",
        "biography": "Ingar Abrahamsen er utdannet elektroingeniør på HiO og jobber som utvikler hos Visma Consulting. Han har 3 års erfaring fra konsulentbransjen og har stor fokus på god kodekvalitet."
      }
    ],
    "year": 2013
  },
  {
    "title": "XML for ninjaer: Et kræsjkurs i Xpath og XSLT",
    "level": "beginner",
    "intendedAudience": "De som bør delta: Utviklere som er ferske i XPath/XSLT. Det kan være både frontendutviklere (type Enonic), eller javautviklere som holder på med XML. Utviklere som bruker XPath fordi de må, uten helt å forstå magien bak. Deltakere vil få en innføring i XSLT og XPath ved konkrete eksempel. De vil se hvordan XML kan omformes til nesten alt via XSL, samt hvor kraftig XPath er for utvelgelse av data fra en XML datakilde. De vil også få noen erfaringer underveis, samt de viktigste tipsene og fallgruvene jeg kan gi, basert på min bruk i prosjekter i snart 2 år. Jeg forventer kjennskap til hva XML er, samt noen grunnleggende kunnskaper om HTML.",
    "summary": "Ren XML kan transformeres til hva du vil: HTML, JSON, iCal - Kun fantasien setter grenser. Lær hvordan med et kræsjkurs i XSLT og XPath.",
    "description": "XML er noe man møter i mange sammenhenger, enten man vil eller ikke. Ønsker du å velge ut et spesifikt subsett av data fra en XML-kilde, med kun en setning? Ønsker du å transformere XML til HTML, tekst eller JSON? Xpath og XSLT er kraftige verktøy for å manipulere og transformere XML, som det kan være nyttig for enhver programmerer å kjenne til. Lær de viktigste konseptene, se de i bruk på konkrete eksempler og plukk opp noen tips på veien fra en som bruker det til daglig.",
    "room": "Room 7",
    "keyWords": [
      "Frontend",
      "Research and Trends",
      "Craftsmanship and Tools",
      "Alternative languages",
      "Experience report"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Kjell Ivar Storstein",
        "biography": "Kjell Ivar jobber i Visma Consulting, og har i 2 år jobbet med frontendutvikling via Enonic CMS for kunder som Norad, Norsk Filminstitutt og NAV. Utvikling av sidemaler via bruk av XML-datakilder, og transformering av dette til f.eks. HTML via XSLT og Xpath er en stor del av dette arbeidet. Kjell Ivar har ellers en stor interesse for interaksjonsdesign, HTML5, app-utvikling og javascriptrammeverk."
      }
    ],
    "year": 2013
  },
  {
    "title": "Oracle SQL Hacking Session: \"Just you, me, Java and a Oracle database\"",
    "level": "intermediate",
    "intendedAudience": "Java developers working with Oracle databases.",
    "summary": "A real Oracle SQL hacking session. No foils. Just the audience, the speaker, Java and an Oracle database. Learn how understanding Oracle internals can really make your application scale. We'll look at topics like joins, fetchsize, lobs, logical vs physical IO, clustering factor etc.",
    "description": "Lately you have heard a lot about NoSQL databases. But let me tell you a secret: the RDBMS databases are not dead - yet. So why not learn what's all about? This is a Oracle SQL hacking session, where you'll see how Oracle really works. You might have written a lot of SQLs, without knowing what's going on inside of Oracle.",
    "room": "Room 3",
    "keyWords": [
      "Core Java",
      "Enterprise",
      "Experience report"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Lasse Jenssen",
        "biography": "Leader of Center of Excellence - Databases, Evry ASA. Working as an architect and developer in Financial Services, EVRY. Started Java development after receiving a beta release of the first Java compiler early in the nineties. Worked with Oracle databases since version 7, and been an instructor on the Oracle Univiersity classes."
      }
    ],
    "year": 2013
  },
  {
    "title": "High Performance Design",
    "level": "intermediate",
    "intendedAudience": "Anyone interested in writing high performance code. This talk starts with how we at LMAX approach the problem and then shows a few design iterations that get faster and faster by understanding how modern processors are designed.",
    "summary": "How to use TDD to create a thread-safe, lock-free, high-performance cache by using knowledge of how modern processors are designed.",
    "description": "How to use TDD to create a thread-safe, lock-free, high-performance cache by using knowledge of how modern processors are designed.",
    "room": "Room 7",
    "keyWords": [
      "Architecture in practice",
      "Core Java",
      "Innovation and Startups",
      "Research and Trends"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Nick Zeeb",
        "biography": "Nick Zeeb is a core Java developer at LMAX Exchange in London. LMAX operates a financial exchange that is capable of handling 20,000 orders per second with a mean latency of 1.5 milliseconds. Nick has been involved in the financial industry since 2006 and has seen some interesting times while working at a hedge fund, an investment bank and now an exchange."
      }
    ],
    "year": 2013
  },
  {
    "title": "High Speed Continuous & Reliable Data Ingest into Hadoop",
    "level": "intermediate",
    "intendedAudience": "Developers and Architects that are currently working or planning to work with Hadoop platform. Also, while being an employee of a company that provides a packaged distribution of the Hadoop platform, everything shown and used during the presentation will be based on raw Open Source Hadoop platform.",
    "summary": "10M events per second into HDFS, Under a sec query per 20GB of HDFS data. . . All of this and more will be demonstrated live during this talk",
    "description": "This talk will explore the area of real-time data ingest into Hadoop and present the architectural trade-offs as well as demonstrate alternative implementations that strike the appropriate balance across the following common challenges: * Decentralized writes (multiple data centers and collectors) * Continuous Availability, High Reliability * No loss of data * Elasticity of introducing more writers * Bursts in Speed per syslog emitter * Continuous, real-time collection * Flexible Write Targets (local FS, HDFS etc.)",
    "room": "Room 5",
    "keyWords": [
      "Big Data and NoSQL",
      "Enterprise",
      "Architecture in practice"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Oleg Zhurakousky",
        "biography": "Oleg is a Principal Architect with Hortonworks responsible for architecting scalable BigData solutions using various OpenSource technologies available within and outside the Hadoop ecosystem. Before Hortonworls Oleg was part of the SpringSource/VMWare where he was a core engineer working on Spring Integration framework, leading Spring Integration Scala DSL and contributing to other projects in Spring portfolio. He has 17+ years of experience in software engineering across multiple disciplines including software architecture and design, consulting, business analysis and application development. Oleg has been focusing on professional Java development since 1999. Since 2004 he has been heavily involved in using several open source technologies and platforms across a number of projects around the world and spanning industries such as Teleco, Banking, Law Enforcement, US DOD and others. As a speaker Oleg presented seminars at dozens of conferences worldwide (i.e.SpringOne, JavaOne, Java Zone, Jazoon, Java2Days, Scala Days, Uberconf, and others)."
      }
    ],
    "year": 2013
  },
  {
    "title": "How to Write a Method",
    "level": "intermediate",
    "intendedAudience": "Primarily Java programmers, but programmers in other languages will also benefit (and occasionally laugh at Java programmers... until their own practices are called into the same kind of doubt).",
    "summary": "Of course, any Java programmer knows how to write a method. But is that really the case? Many programmers find they code more by habit — habits picked up from frameworks, IDE defaults and a random selection of blogs — than by reason. This talk tries to dissect some common habits with reason to reveal, well, how to write a method.",
    "description": "We all know how to write a method. We all know how to write a class. We all understand how to name a field. We all understand the practices we use, their deep rationale and their implications. We are perfectly rational, reasoned and unbiased about how we code and the practices we employ. Then again... perhaps not. It turns out that we pick up habits and practices without being aware of them, retrospectively creating justification and rationale for what we do, whether it is naming conventions, indentation, control flow, use of language features, commenting, class layout, etc. All too often many things that have been considered good practice are discouraged because of IDE defaults or memes and habits emerging from vocal developers. This session tries to take a more rational approach that allows you to evaluate and improve how you write methods. There is a good chance you won't agree with everything as many common Java habits are questioned and subjected to merciless reasoning.",
    "room": "Room 1",
    "keyWords": [
      "Alternative languages",
      "Core Java",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Kevlin Henney",
        "biography": "Kevlin is an independent consultant, trainer and writer based in the UK. His development interests are in patterns, programming, practice and process. He has been a columnist for various magazines and web sites and is co-author of A Pattern Language for Distributed Computing and On Patterns and Pattern Languages, two volumes in the Pattern-Oriented Software Architecture series. He is also editor of the 97 Things Every Programmer Should Know site and book."
      }
    ],
    "year": 2013
  },
  {
    "title": "JSF 2.2 Big Ticket Features in Context",
    "level": "intermediate",
    "intendedAudience": "Java Web Developers JSF Skeptics",
    "summary": "How can JSF still be relevant in a world where Vaadin and Thin Server Architecture is on the rise? This presentation shows how new features in JSF 2.2 keep it relevant for a certain class of application that still dominates in the enterprise.",
    "description": "Now that JSF 2.2 has completed, this session will demonstrate the most important features in the context of a self-contained sample application. The features covered include: * HTML5 Friendly Markup * Faces Flows * Resource Library Contracts The attendee of this session will learn how JSF is still relevant in today's enterprise software stack. Specifically, they will learn why one would want to upgrade to JSF 2.2 rather than opting for a different architecture entirely.",
    "room": "Room 6",
    "keyWords": [
      "Core Java",
      "Enterprise"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Ed Burns",
        "biography": "Ed Burns is currently a senior staff engineer at Sun Microsystems, Inc., where he leads a team of Web experts from across the industry in developing JavaServer Faces Technology through the Java Community Process and in open source. He is the author of two books for McGraw-Hill: Secrets of the Rock Star Programmers (2008) and JavaServer Faces: The Complete Reference (co-authored with Chris Schalk, 2006). Before working on JavaServer Faces, Ed worked on a wide variety of client and server-side Web technologies since 1994, including NCSA Mosaic for X, Mozilla, the Sun Java Plug-in, Jakarta Tomcat, the Cosmo Create HTML authoring tool, and the Web transport layer in the Irix operating system from Silicon Graphics. Ed is a frequent speaker at international industry conferences, having presented many times at Sun’s JavaOne conference, given keynote addresses at the W-JAX conference in Munich, Germany, the Globalcode Developer’s Conference in Sao Paulo, Brazil, the JSF Days Conference in Vienna, Austria, the DOAG Conference in Nuremberg, Germany, and also has spoken at numerous Java User Group meetings and the No Fluff Just Stuff Java Symposium."
      }
    ],
    "year": 2013
  },
  {
    "title": "Rmatch, matching many regular expressions in parallel",
    "level": "beginner",
    "intendedAudience": "o People interested in using regular expressions on more or less regulary structured data sets. o The participants should have some computer science background and should have an idea about the relationship between regular expressions and respectively deterministic and nondeterministic automata. I will repeat the main points and the presentation will be self contained, but these are pretty deep issues and I don't have time to be deep in the presentation so it will help to have been exposed to this subject previously. o The participants will benefit by being presented an open source library that lets them do things with regular expressions that they previously would have found difficult due to efficiency concerns since the method and library I'm describing will often reduce an O(N) to O(log n) work order for number of regular expressions involved.",
    "summary": "Regular expression matching using callbacks. Efficient data structures. Benchmarking.",
    "description": "(note: this abstract is in even though I intend to make the talk itself in norwegian) This is about a toy project I have called \"rmatch\" https://github.com/la3lma/rmatch. It's probably useful for something, but mostly it's just something I had to write It's also a very nice regular expression matching library that makes it possible to look for many matching expression in the same input, each of the expressions are connected to their own callback function. This implementation is way more efficient than sequential matching for each of the regular expressions. Sequential matching will use time proportional to O(N) where N is the number of expressions being matched, but rmatch will use time proporsional to O(log N) which is obviously much better, in particular for large Ns. For both of these cases the time spent on running the callbacks will proportional to O(M) where M is the number of matches found. Rmatch is based on callbacks: You submit a trigger that gets called when some input is processed by the matcher. You can have any number of regular expressions in the single matcher (up to limits given by physical memory). During everyday testing several tens of thousand regular expressions are added and matched against. The matcher will match all the expressions in parallel and when a match is found for any given expression, it will try to make that match as long as possible before terminating the match and calling the callback. The underlying deterministic/nondeterministic automata implementation was a lot of fun to figure out, in fact it was so much fun to figure out that I became obsessed with making an implementation. In a nutshell it is all quite efficient since only the parts of the deterministic automata necessary to match for the actual input is created. If for instance the input contains no \"a\" characters, then there will be no \"a\" edges anywhere in the deterministic automata. Also, there is actually only one deterministic automaton that matches the union of all the regular expressions. These two tricks ensure that no more than one deterministic automaton is made, and no more nodes or edges are added to it than strictly necessary for matching the input actually given to it. The matching then becomes a simple matter of traversing a deterministic automaton, and since that is quite simple it's also very fast. I have some tests backing this claim up. In a nutshell: For very simple cases (matching a single but complex regular expression and then adding a single counter) rmatch is faster than awk for, but slower than java regular expressions. For more complex tasks involving different things happening for different regular expressions, e.g. incrementing a different counter for each regular expression, then rmatch compares favourably even with java regexps which btw are wicked fast.",
    "room": "Room 7",
    "keyWords": [
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Bjørn Remseth",
        "biography": "Cand. Scient (M.Sc equivalent) in Comp.Sci from the University of Oslo. Presently works as a senior software engineer at Comoyo. Has worked as a developer, research scientist etc. for several decades. Is interested in machine learning, enterprise architecture, functional programming, archery, film, TV, music and regular expression."
      }
    ],
    "year": 2013
  },
  {
    "title": "Lag ditt eget språk, i Groovy, på under 50 minutter",
    "level": "beginner",
    "intendedAudience": "Erfarne programmerere som er nysgjerrige på -- eller ikke husker helt -- hvordan man skriver en interpreter fra scratch, vil lære om alle byggeklossene og hvordan de settes sammen. Samtidig vil de få inn en god dose lisp-kunnskap.",
    "summary": "Å skrive sitt eget programmeringsspråk er en deilig opplevelse. Vi skal lære å skrive en interpreter for et enkelt lisp-språk, ved hjelp av Groovy, på under 50 minutter.",
    "description": "Lær Lisp, Groovy, og hvordan interpretere virker ... på under en time. Vi bruker forskjellige programmeringsspråk hver dag. Mange av oss er innom Java og JavaScript, kanskje php, eller Clojure, eller Groovy eller Ruby... og vi tar disse språkene egentlig for gitt. Men ... hvordan er de laget? Hvilke bevegelige biter har de? Hva gjør de forskjellige bitene? Hvordan kan jeg lage mitt eget programmeringsspråk, om jeg vil? Den store hemmeligheten er at dette egentlig ikke er så vanskelig. Hvis vi bare bruker litt tid på hver bit, for seg selv, og peprer den med tester, forsvinner magien, og bare kode står igjen. Deilig, deilig kode. (PS. Du trenger ikke kunne Groovy for å følge med her, jeg har valgt Groovy nettopp fordi konseptene blir så klare, språket står ikke i veien.)",
    "room": "Room 4",
    "keyWords": [
      "Alternative languages",
      "Functional Programming"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Sten Morten Misund-Asphaug",
        "biography": "Jeg er en Kodemaker som har programmert siden Sharp MZ-721 var den kuleste datamaskinen man kunne ha på et gutterom (for den kom med kassettspiller, og vi kunne kopiere spill med pappas dobbelkassettspiller). Det var da spill kom i form av lange listinger i blader, som vi tastet inn, og det fantes kommandoer som het PEEK og POKE. Jeg mener at det er minst like viktig å ta vare på den store programmeringsgleden, som å programmere for å tjene til livets opphold."
      }
    ],
    "year": 2013
  },
  {
    "title": "Home Automation at the touch of a button",
    "level": "beginner",
    "intendedAudience": "Anyone who is interested in branching out their software knowledge into a physical environment, interested in home automation or interested in how you can control various different appliances in your house should attend. A very basic understanding of how to write object oriented code would be required to get the best out of this talk.",
    "summary": "Ever wanted to turn your heating on from your phone, monitor the temperature in your greenhouse maybe even control a water pump in your solar water heating system? I plan to share with you some simple but fun projects that will get you started with using an Arduino micro controller and kickstart your automated life style.",
    "description": "Ever wanted to turn your heating on from your phone, monitor the temperature in your greenhouse maybe even control a water pump in your solar water heating system? You can achieve all of this with one simple circuit board and a small amount of object oriented programing knowledge. I plan to share with you some simple but fun projects that will get you started with using an Arduino micro controller and kickstart your automated life style.",
    "room": "Room 7",
    "keyWords": [
      "Alternative languages",
      "Functional Programming",
      "Innovation and Startups",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Martin Cochrane",
        "biography": "I am one of those guys who just loves playing with technology, if I can automate something using a computer, give someone a better user experience, play with something new or if someone tells me something just can’t be done I have to get stuck straight in. Up until a year ago I lived in Ireland where I was born, raised, went to school, went to University (when I woke up on time) and worked as much as I possibly could from the day I was legally allowed to. I come from quite a different background than most. I started out as a developer in a Coal Fired power station in Ireland where I wrote ladder logic for PLC’s that controlled different parts of the power station and then wrote software that operators could use to control the power station. I moved on to a company called Liberty IT who are responsible for writing all the software for the American insurance giant Liberty Mutual. I wrote in house and external web app’s for Liberty, some of which had to be written to incorporate with existing systems that were written in Java and still using Struts version 1.0 and some were brand new systems that we were allowed to use much more modern technology. Seeking new challenges I followed my Norwegian Girlfriend to Norway and I now work in Statkraft as a developer writing software for the energy management department. I am also a keen motorbike racer that loves being able to incorporate my software knowledge into my mechanical knowledge when building new race bikes each year for the upcoming season. I have written my own data logging software and my own quick shifter using the popular micro-controller known as an Arduino. I talked at Smidig 2012 about motivating teams and I hope you join me to here about the more technical side of my job"
      }
    ],
    "year": 2013
  },
  {
    "title": "Gode idéer blir avkledd i forvaltning",
    "level": "intermediate",
    "intendedAudience": "Foredraget tar sikte på å bevisstgjøre alle nivå i organisasjonen. Alt fra kunder og ledere til prosjektledere, arkitekter og utviklere. Foredraget handler om bevisstgjøring av avgjørelser, både de som tas i prosjekt og de som tas utenfor.",
    "summary": "Vi ser på avgjørelser relatert til prosjektgjennomføring, organisasjon, arkitektur og teknologi. Var det noen som tenkte på forvaltning av applikasjonen når prosjektet hadde fullt trykk?",
    "description": "Det er i dag mye oppmerksomhet rundt effektivisering av prosjekter. Man snakker om metodikker, teknologier og rammeverk. Ofte fokuseres det på rammeverk og teknologier man raskt kan komme i gang med, mens andre ganger snakker man om ansvarlighet og tar sikte på \"velprøvde\" teknologier og standarder. Dette foredraget tar sikte på å bevisstgjøre hvordan avgjørelser som gjøres i prosjekt og organisasjon påvirker forvaltningen av produktet i årene som kommer. Gjennom eksempler fra virkeligheten forsøker vi å belyse hvordan avgjørelser, både små og store, påvirker effektiviteten i forvaltning. Vi ser på avgjørelser relatert til prosjektgjennomføring, organisasjon, arkitektur og teknologi. Var det noen som tenkte på forvaltning av applikasjonen når prosjektet hadde fullt trykk? Er organisasjonen rigget for å håndtere forvaltning av selvbetjeningsapplikasjoner? Er det alltid like lurt å sikte på felleskomponenter og gjenbruk?",
    "room": "Room 6",
    "keyWords": [
      "Architecture in practice",
      "Enterprise",
      "Experience report"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Kai Bjørnstad",
        "biography": "Jobber til daglig som Manager og Fagleder for Java i Bekk Consulting As. Har jobbet i mange år med både utvikling av hyllevareprodukter og som konsulent for bedriftsmarkedet både i Norge og i utlandet. Lang erfaring med Linux, C, Python og Java. Jobber både som utvikler, arkitekt og teknisk prosjektleder."
      }
    ],
    "year": 2013
  },
  {
    "title": "Remote feature toggling for native mobile applications",
    "level": "beginner",
    "intendedAudience": "Anyone developing for native mobile applications should know and use feature toggling. Feature toggling will improve and ease the testing of features on real users. The users should have some experience with native mobile applications.",
    "summary": "Remote feature toggling for native mobile applications let you take control over the release of features instead of Google Play or App Store!",
    "description": "How can you test and roll out new features without having the user update the application through Google Play or App Store? Feature toggling makes it possible! You can toggle features that do not work easily, roll out new features to only a certain percentage of your users . This makes it easier to do A/B testing and test features on a limited set of users.",
    "room": "Room 7",
    "keyWords": [
      "Mobile"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Morten Weel Johnsen",
        "biography": "Utdannet sivilingeniør ved NTNU. Jobber som systemutvikler i Iterate AS. Har det siste året jobbet med blant annet utvikling på android."
      }
    ],
    "year": 2013
  },
  {
    "title": "Java 8 to the rescue!?",
    "level": "intermediate",
    "intendedAudience": "Java developers interested in functional programming and what is new in Java 8. Some familiarity with functional programming is a bonus but not required.",
    "summary": "Java 8 will finally deliver us to the promised land of functional programming! We'll look at what new powers the new features such as Lambdas and Default Methods give us, and also where Java is still lacking compared to e.g. Scala and Clojure.",
    "description": "Java 8 will finally deliver us to the promised land of functional programming! So can we stop worrying now about learning Scala and Clojure and the other new kids on the block? We'll look at what new powers the new features such as Lambdas, Default Methods and Streams give us, as well as what Java is still lacking compared to other functional languages on the JVM.",
    "room": "Room 3",
    "keyWords": [
      "Alternative languages",
      "Core Java",
      "Functional Programming"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Fredrik Vraalsen",
        "biography": "Fredrik makes a living as a programmer and consultant, dealing mainly in Java EE development. The last couple of years he's become more and more interested in functional programming and in particluar how to apply what he learns to his daily job as a Java developer. He's held some training courses in Scala and also dabbled in Clojure, and likes to speak at conferences."
      }
    ],
    "year": 2013
  },
  {
    "title": "Designing for Continuous Delivery",
    "level": "beginner",
    "intendedAudience": "Architects, Developers",
    "summary": "Learn how to perform large refactorings safely and without the need of branching.",
    "description": "When implementing a Build Pipeline based on the principles of Continuous Delivery a conflict often arises between those in favor of feature branches and those who regards branching as evil. This session will go through a few techniques and design guidelines that will help keep the build pipeline intact and take away the need for excessive branching.",
    "room": "Room 4",
    "keyWords": [
      "Architecture in practice",
      "Continous delivery"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Ivar Grimstad",
        "biography": "Ivar Grimstad is an experienced software architect with a strong focus on Enterprise Java. He has been working with Java since the beginning and has over the years tried out everything from lightweight mobile applications to large scale enterprise applications. His experience covers all aspects of designing architectures based on a variety of technologies including standard Java EE as well as more lightweight frameworks such as Spring and a variety of open source products. Ivar is always focusing on quality and on using the right tools and technologies for the right task to optimize the software development process. In addition to being active in the local Java Community, Ivar has been speaking at several conferences and gatherings in the Nordics. This year he is also presenting at JavaOne."
      }
    ],
    "year": 2013
  },
  {
    "title": "Modern Cassandra: big data without big headaches",
    "level": "advanced",
    "intendedAudience": "Attendees interested in big data will enjoy this talk, particularly those who need a big data system of record (as opposed to merely a data warehouse).",
    "summary": "New features in Cassandra 2.0 including lightweight transactions, virtual nodes, CQL (the Cassandra query language), as well as an updated look at performance.",
    "description": "Many people still think of Cassandra as a \"key value store\" or a \"map of maps.\" Cassandra is a fast moving project, with over three years of intense development since it was contributed to Apache, and these early descriptions no longer do justice to Cassandra. This talk will cover new features in Cassandra 2.0 including lightweight transactions, virtual nodes, CQL (the Cassandra query language), as well as an updated look at performance.",
    "room": "Room 3",
    "keyWords": [
      "Big Data and NoSQL",
      "Core Java",
      "Distributed systems and cloud"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jonathan Ellis",
        "biography": "Jonathan is the project chair of Apache Cassandra and co-founder of DataStax. Prior to DataStax, he built a multi-petabyte, scalable storage system based on Reed-Solomon encoding for backup provider Mozy."
      }
    ],
    "year": 2013
  },
  {
    "title": "Sinnrik kode = teknisk gjeld?",
    "level": "beginner",
    "intendedAudience": "Presentasjonen er for alle som enten jobber i et utviklingsteam, eller som er med på å sette sammen slike team. Målet med presentasjonen er å starte noen tanker rundt hvordan team settes sammen og hvordan jobber man for lage god kode og å unngå ekstraarbeid (teknisk gjeld).",
    "summary": "“Clever code” can often be difficult for novices and people without the same skill-level as the person who wrote it. Can the code be a strong negative contributor to future use of time when maintaining the code? What does this say about the consistency of the group and how we work?",
    "description": "I en artikkel fokusert på teknisk gjeld, kommer Ward Cunningham med en interessant uttalelse. \"Når et team jobber mot et mål ved å skrive kode, kan vi måle produktiviteten som forholdet mellom fokus på målet og fokus på koden. Vi kan si at koden har høy kvalitet, når produktiviteten forblir høy selv ved forandringer i team og mål\". Sett at du jobber i et team med ganske forskjellige kvalifikasjoner. Og la oss si at den mest erfarne utvikleren lager kode som krever dyp forståelse av språket. Vil denne koden være et positivt eller negativt bidrag til fremtidig tidsbruk når koden skal forandres senere? Har dette noe å si for ønsket sammensetting av team og arbeidsmåte? Er det gjort bevisste valg hvorfor man trenger å ta opp teknisk gjeld og når den skal betales? Er nye språk som Scala eller paradigmer som funksjonell programmering et skjult kjempelån?",
    "room": "Room 7",
    "keyWords": [
      "Alternative languages",
      "Core Java",
      "Experience report",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Erlend Flaten",
        "biography": "Erlend Flaten jobber som konsulent hos Antares Gruppen AS. Han har jobbet som utvikler siden 2005. Mye av arbeidet de siste årene har vært å oppgradere og videreutvikle forskjellige halvgamle systemer. Dette har inspirert til å finne frem til metoder å lage kode som er mest mulig hensiktsmessig for videre vedlikehold. Han jobber sammen med andre konsulenter fra Antares Gruppen AS for å samle erfaring for å jobbe effektivt med å håndtere teknisk gjeld."
      }
    ],
    "year": 2013
  },
  {
    "title": "Firefox OS - web som mobil plattform",
    "level": "beginner",
    "intendedAudience": "Webutviklere som vil lage applikasjoner for et nytt OS, eller tilpasse websider slik at de kan gjøre mer på en mobiltelefon. App-utviklere som vil lære om en ny plattform, eller som vurderer nytten av \"web first\".",
    "summary": "Med din eksisterende kunnskap om webteknologier kan du både lage native applikasjoner for Firefox OS, og lage webapplikasjoner som utnytter mobil hardware på flere plattformer.",
    "description": "De som har vært med siden 90-tallet vil kanskje huske en softwaregigants frykt for at Netscape skulle gjøre operativsystemet overflødig. Nettleseren har ikke bare gjort operativsystemet overflødig, nå er den operativsystemet. I Firefox OS kan du skrive \"native\" applikasjoner til en mobil plattform med HTML, CSS og JavaScript. Med litt omtanke kan du også få applikasjonene til å virke godt på andre mobile plattformer. De første mobiltelefonene med Firefox OS har dukket opp, og prosjektet støttes av flere tunge aktører (pluss vår egen Telenor). Dette kan bli en plattform å følge med på i kampen for et alternativ til Android og IOS, og API'ene som blir standardisert gjennom Firefox OS kan også viske ut skillet mellom nativ og web på andre plattformer.",
    "room": "Room 2",
    "keyWords": [
      "Frontend",
      "Mobile"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Håvard Wigtil",
        "biography": "Håvard har syslet med webteknologier siden Netscape 2.0 var hot, og har fulgt Mozilla-stiftelsen tett i mange år. Han har utviklet for flere forskjellige mobilplattformer, og har tro på at åpne plattformer kan rive ned &quot;hagemurene&quot; for mobilapplikasjoner."
      }
    ],
    "year": 2013
  },
  {
    "title": "Erfaringer fra utvikling av Ruter Billett.",
    "level": "beginner",
    "intendedAudience": "Folk som er interessert i mobilutvikling. Publikum vil få høre synspunkter på når man bør velge multiplatformløsninger og når man bør gå native. For øvrig vil lyntalen gi erfaringer fra utvikling av et profilert mobilprosjekt. Ingen spesielle forkunskaper er påkrevet.",
    "summary": "Erfaringer fra utvikling av Ruters billettapplikasjon med spesiell fokus på hvorfor den ble utviklet som tre native-applikasjoner.",
    "description": "I løpet av en kort høst ble Ruters billett applikasjon for Android, iOS og windows phone utviklet. Dette foredraget forteller historien om hvorfor vi valgte å implementere løsniningen som tre native applikasjoner heller enn å gå for en multiplatformløsning. Innledningsvis vil multiplatform vs native bli diskutert før både gode og dårlige erfaringer fra prosjektetgjennomføringen vil bli delt.",
    "room": "Room 7",
    "keyWords": [
      "Alternative languages",
      "Experience report",
      "Frontend",
      "Mobile"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Tobias K Torrissen",
        "biography": "Tobias er fagsjef i Know IT Objectnet. Han har 16 års erfaring fra konsulentbransjen hvor han stort sett har jobbet med utvikling av store mellomvareløsninger implementert i Java. Tobias har tidligere holdt foredrag på rOOts, JavaZone, Kunnskapstinget og flere andre konferanser. Han er styremeldem i dataforeningen østlandet. Tobias er tidligere styremedlem i javaBin og satt i JavaZones programkomite fra 2004-2009. Tre av disse årene fungerte han som leder."
      }
    ],
    "year": 2013
  },
  {
    "title": "Kvalitetssøk på norsk med Ã¦Ã¸Ã¥",
    "level": "intermediate",
    "intendedAudience": "Du har ansvar for søk i applikasjonen din og lurer på hvordan søket egentlig virker og hvordan du kan få best mulige resultater.",
    "summary": "Det er vanskelig å sette opp et søk som gir gode resultater med norsk innhold. Jeg vil gi deg en kjapp innføring i hvordan en søkeindeks ser ut og hvordan du får et kvalitetssøk.",
    "description": "Sliter brukerne med lite relevante resultater når de bruker søkeløsningen din for norsk innhold? Gir «autocomplete» overflødige forslag for det samme ordet? Får du null treff hvis ikke søkeordet skrives nøyaktig som i dokumentet? Denne lyntalen forteller deg hvorfor det er slik og hva du kan gjøre for å skape en bedre søkeopplevelse. Jeg tar utgangspunkt i søk med Solr og gir deg en kjapp innføring i hvordan en søkeindeks er bygd opp, hva som er spesielt for søk på norsk, og hvordan du får et kvalitetssøk med norsk innhold.",
    "room": "Room 7",
    "keyWords": [
      "Enterprise",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Marvin Bredal Lillehaug",
        "biography": "Marvin er systemutvikler hos Kantega AS. Han er sivilingeniør i datateknikk med fordypning i intelligente systemer. Han startet som som Java-utvikler i 2007 da han ble med i studentavisa Under Dusken. Hans karriere i Kantega startet i 2009 hvor han jobbet deltid frem til han i 2011 fullførte mastergraden sin og fikk fast ansettelse. Han har jobbet med forvaltning og utvikling av flere store java-applikasjoner, blant annet CMSet som driver Trondheim kommunes nettsider og indeksering av disse."
      }
    ],
    "year": 2013
  },
  {
    "title": "Websockets med Atmosphere",
    "level": "beginner",
    "intendedAudience": "Frontend-utviklararar som er interesserte i å kunne lage rike webapplikasjonar med asynkron kommunikasjon mellom server og nettleser. Ingen forkunnskaper utanom grunnleggande kjennskap til Java, Javascript og HTML er forventa.",
    "summary": "Denne lyntalen gir ein kort innføring i Websockets og viser korleis du kan bruke av Atmosphere-rammeverket til å støtte \"push\" av meldingar frå server til nettleser.",
    "description": "I webapplikasjonar no til dags har ein ofte behov for å pushe hendingar fra serveren og ut til nettleseren så fort dei oppstår. HTTP egnar seg dårlig til denne typen interaksjon, men opp gjennom tida har ein brukt ulike skitne triks for å få det til likevel. Nye protokollar og initiativ slik som Websockets og HTML 5 Server Side Events gjer dette mykje enklare og betre, men då må ein forholde seg til ein jungel av implementasjonar og API-er. Denne lyntalen dreier seg om korleis ein kan la Atmosphere-rammeverket skjule denne kompleksiteten og lage push-applikasjonar utan å måtte uroe seg så mykje over teknologien som ligg bak.",
    "room": "Room 7",
    "keyWords": [
      "Distributed systems and cloud",
      "Frontend",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Kenneth Pedersen",
        "biography": "Kenneth jobber i Accenture og har meir enn 10 års erfaring som utvikler, drifter og løsningsarkitekt. I dag jobber Kenneth med mykje spennande frontend- og backendteknologi i eit av dei største IT-prosjekta i Noreg. Han synest det har skjedd utrulig mykje spennande med webteknologien dei siste åra og at vi aldri har hatt betre verktøykasse for å kunne lage flotte og brukarvennlege webapplikasjonar."
      }
    ],
    "year": 2013
  },
  {
    "title": "Why and how The Lean Startup Movement will change (and maybe save) your life as a programmer",
    "level": "beginner",
    "intendedAudience": "Programmers",
    "summary": "This talk is about how the role and responsibility of a programmer will change. For software development not applicable for outsourcing, the future will require programmers that have the skill and the will to understand “The Big Picture”, being more like product developers and thinking customer development.",
    "description": "The computer can do much of what your logical and mathematical brain can do, but much faster. Programmers in Asia and Eastern-Europe can do much of what you can do, but at a much lower cost. Don´t worry, you won´t lose your job just yet. With the rapidly increasing number of fast growing new companies challenging existing companies, changing marketplaces and decreasing the lifespan of products and services, large organizations will need to reinvent it self more often. This kind of disruptive innovation contains no mathematical formulas for the computer to solve. No requirement specifications to be outsourced to Asia or Eastern-Europe. No way to predict, or buy, success. Lean Startup and other similar methods for new product development, will be the rescue for such large organizations when facing a potential “Kodak Moment”. Business decisions will become more data-driven, and we will need your help to capture data needed and to read it. Design decisions will be made by A/B-testing and other impact-oriented testing techniques, rather than some UX-expert or graphical designer dictating the best solution. This talk is about how the role and responsibility of a programmer will change. For software development not applicable for outsourcing, the future will require programmers that have the skill and the will to understand “The Big Picture”, being more like product developers and thinking customer development. During the 2008 Presidential campaign Obama was able to collect 70.000.000$ more funds as a result of programmers A/B-testing every new experiment.",
    "room": "Room 4",
    "keyWords": [
      "Innovation and Startups",
      "Research and Trends"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Tom Johannes Bang",
        "biography": "Tom Johannes Bang is a passionate and visionary Owner and COO at the Norwegian Lean consultancy Iterate. He has more than 15 years of leadership and business consulting experience. He aims to help established enterprises escape the operational gravity and drive innovation and develop products and services that engage customers and bring them back. As a serial entrepreneur Tom founded Bekk Consulting in 2000 (one of Norway’s most successful IT consulting companies today), a dental clinic (Calia) in 2005 and Spanish tapas bar (Serrano´s Bodega) in 2010. Tom has presented at various Norwegian and International conferences."
      }
    ],
    "year": 2013
  },
  {
    "title": "Patterns of Large-Scale JavaScript Applications",
    "level": "intermediate",
    "intendedAudience": "To get the most out of this application you should know your way around JavaScript, jQuery and the DOM. You don't need any experience with Backbone.js, AngularJS or similar frameworks.",
    "summary": "JavaScript has come a long way in few years. As we no longer need to battle DOM differences we can focus on building our applications instead. Now, however, as more and more application logic move from the server to the client our main problem is that we need to unlearn our earlier DOM-centric approach to JavaScript. Tools such as Backbone and Angular help, but before we are able to use the effectively we have to change some of our neural pathways. In this talk I will look at a couple of patterns that will help you move away from jQuery spaghetti and get you started on a foundation for building large-scale JavaScript applications.",
    "description": "In recent years a number of libraries for building large JavaScript applications has appeared. As we no longer need to battle DOM differences between browsers we can finally focus on building highly interactive front-end applications instead. But before we can do a good job with these new libraries we need unlearn our previous DOM-centric approach to building JavaScript applications. In this presentation will take a look at what that means, and how we can build modular, testable and reusable code. We will also look at some of the key concepts in libraries such as Backbone.js and AngularJS, including two-way binding, dependency injection and templating. The ultimate goal is, in my mind, that we should treat our Javascript application as we treat our Java application. After this presentation you will have a much better idea of ​​what that means.",
    "room": "Room 5",
    "keyWords": [
      "Frontend"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Kim Joar Bekkelund",
        "biography": "Kim is a senior consultant at Bekk Consulting in Oslo, Norway. He primarily works on large-scale JavaScript applications and he strongly believes that we should treat JavaScript as a real language when we use it to build large applications. In addition to creating Superhero.js and blogging about JavaScript, Kim is a frequent contributor to open source and a semi-frequent speaker at events both in Norway and abroad."
      }
    ],
    "year": 2013
  },
  {
    "title": "Hvordan endre logg-oppsettet ditt dynamisk",
    "level": "intermediate",
    "intendedAudience": "Alle som jobber med utvikling av java-applikasjoner, har brukt logg-rammeverk og som er interessert i en enklere hverdag både ved utvikling og i produksjon. Ekstra bonus dersom man har jobbet med Web Services og logging av disse.",
    "summary": "Har du noensinne irritert deg over spam i loggen og ønsket å kunne fjerne det der og da? Er det opplysninger som skjules i loggen som du gjerne skulle fått frem? Har du noensinne ønsket å logge innholdet i én type SOAP-melding, men uten å måtte logge alle SOAP-meldinger til enhver tid? Da vil denne lyntalen vise deg hvordan!",
    "description": "Å kunne gjøre tilpasninger til en kjørende applikasjon kan gi bedre kontroll i et produksjonsmiljø og gi færre utrullinger og kortere rundtur ved test og utvikling. Logging er en standardfunksjon i de fleste applikasjoner, og det kan gi mange fordeler å gjøre det mulig å endre logg-oppsettet dynamisk. I denne lyntalen vil jeg vise hvordan ulike SOAP-meldinger kan logges uavhengig av hverandre, og vise hvordan man enkelt kan legge til dynamisk kontroll av hva som skal logges.",
    "room": "Room 7",
    "keyWords": [
      "Continous delivery",
      "Core Java",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Torstein Gjengdal",
        "biography": "Torstein har jobbet med systemutvikling i 12 år. Han har jobbet med flere store javaprosjekter der systemintegrasjon og kjøretidskontroll har vært viktige aspekter."
      }
    ],
    "year": 2013
  },
  {
    "title": "Programming should be FUN",
    "level": "beginner",
    "intendedAudience": "People that are interested in getting more out of their programming work. Suitable for both programmers and *-managers alike.",
    "summary": "This lightning talk will go through why I think we tend to implement processes and structures that kill our creativity and takes the fun out of programming.",
    "description": "We keep organizing our programming into processes and structures that ensures that the fun is left out of the programming experience. In my opinion, programming SHOULD be fun, it should be opinionated and it should be a creative process. We need to stop optimizing for predictability and get back to the roots of what programming really is: Solving problems and issues in an innovative and engaging way!",
    "room": "Room 7",
    "keyWords": [
      "Innovation and Startups",
      "Research and Trends"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Joachim Haagen Skeie",
        "biography": "Joachim is the author of &quot;Ember.js in Action&quot;, currently available through Manning Publications early access program. He works as an independent consultant and course instructor through his company Haagen Software AS and has worked with various web technologies since 2006, ranging from JavaServer Pages, JavaServer Faces, SproutCore to Ember.js. He have been the technology lead for norways largest retail application (measured in volume) and know the pains that server–side generated markup and scripts can cause while trying to scale out a service. Joachim is the lead organizer of Ember Fest, a European Ember.js related conference."
      }
    ],
    "year": 2013
  },
  {
    "title": "Borrowing from GitHub's Culture for Fun and Profit",
    "level": "beginner",
    "intendedAudience": "Software development managers or team leads that can effect change in their organization's policies and operation for the betterment of shareholders and employees alike.",
    "summary": "Come steal several easy but effective workplace ideas from GitHub: a software company that defines success as a union of employee happiness and sustainable profits.",
    "description": "GitHub is an extremely unique software development organization, both in how it has evolved, how it functions, what it builds, and what it aspires to do for humankind at work. Learn how employee happiness and profits can and have gone hand in hand, and how the seeds of that are sown by having Hubot the robot do the dirty work, and having that dirty work done hundreds of times per day. I'll share some of the most useful culture secrets of work at GitHub, including live demonstrations of some of our open source and not-yet-open-sourced internal tools, continuous development practices, and skill-improvement vectors such as the successful rotating King of Developers role. All of the culture, process, daily work, and policies will be framed in the perspective of how they can be replicated at your place of employment for greater job satisfaction and more-successful-than-ever outcomes for your employer. We'll conclude with a brief ask-me-anything segment, with past experiences having touched on hiring, vacation, project direction, the explicit absence of managers, and employee trust.",
    "room": "Room 1",
    "keyWords": [
      "Research and Trends",
      "Craftsmanship and Tools",
      "Experience report",
      "Continous delivery",
      "Innovation and Startups"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Matthew McCullough",
        "biography": "Matthew McCullough works for GitHub, Inc. and trains audiences around the world on the most effective use of the Git version control system and GitHub collaboration platform. In supplement to travel-based teaching, he writes books and records videos for O'Reilly and Manning on the topics of delivering technical presentations, the use of modern build and continuous integration tools, and version control industry best practices."
      }
    ],
    "year": 2013
  },
  {
    "title": "Apache Pig - enklere MapReduce for Hadoop",
    "level": "intermediate",
    "intendedAudience": "Utviklere og arkitekter med interesse for behandling av store datamengder.",
    "summary": "Apache Pig er en plattform for å analysere store datamengder med Hadoop. I denne lyntalen gir jeg en kort gjennomgang av Apache Pig, og viser hvordan det kan brukes til å prosessere terabyte av data ved å skrive et halvt dusin linjer i konsollet.",
    "description": "Apache Pig er en plattform for å analysere store datamengder med Hadoop. Pig tilbyr et skriptspråk, Pig Latin, og en kompilator som produserer sekvenser av MapReduce-jobber. Pig Latin er et tekstlig, høynivå skriptspråk som gjør MapReduce en hel del lettere å jobbe med. I denne lyntalen gir jeg en kort gjennomgang av Apache Pig. Jeg vil plassere Pig i økosystemet rundt Hadoop og se på hvordan Pig blir benyttet i den virkelige verden. Jeg vil gå gjennom Pig's filosofi, syntaks og kjøretidsmiljø, og vise hvordan man går frem for å komme i gang med å analysere store datamengder med Apache Pig.",
    "room": "Room 7",
    "keyWords": [
      "Big Data and NoSQL",
      "Distributed systems and cloud"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Jan-Erik Carlsen",
        "biography": "Jan-Erik er sjefskonsulent og teamleder i Capgemini. Han har 7 års erfaring med utvikling og arkitektur på Java-plattformen. For tiden er han opptatt av temaer som NoSQL og økosystemet rundt Hadoop."
      }
    ],
    "year": 2013
  },
  {
    "title": "Small lambda talk",
    "level": "beginner",
    "intendedAudience": "The talk is suitable for anyone who enjoys programming and is open to learn from other languages. No prior knowledge required.",
    "summary": "The Smalltalk programming language demonstrates the power of object orientation and lambda expressions. How can this be applied in Java?",
    "description": "You have probably noticed the excitement regarding functional programming and the new lambda expression in Java 8. But did you know that this also brings Java back to its object-oriented roots? The Smalltalk programming language shows how virtually any task can be achieved through good old object orientation. Everything is built with the basic ingredients of objects, messages and blocks (lambda). Smalltalk uses lambda expressions for conditional processing, iteration and exception handling. We will look at some fascinating examples, and discuss if and how to apply them in Java. We Java programmers now find ourselves with a brand new lambda tool in our toolbox. Lets take the time to learn from the past about the power of object orientation and lambdas.",
    "room": "Room 7",
    "keyWords": [
      "Alternative languages",
      "Core Java",
      "Functional Programming"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Martin Skarsaune",
        "biography": "Martin Skarsaune is a software developer at Kantega. He has been programming full time since the turn of the century. His prime interest is core Java and programming languages. He has published a book on the technical aspects of Smalltalk to Java conversion."
      }
    ],
    "year": 2013
  },
  {
    "title": "CSS regression testing with PhantomCSS, Resemble.js and friends",
    "level": "beginner",
    "intendedAudience": "Web site developers",
    "summary": "Learn how to test your web site styling and prevent unintentional layout changes.",
    "description": "Automated functional UI tests assert HTML markup and not the actual web page rendering. If a font-size or margin changes in your CSS unintentionally, or something else breaks visually, functional tests will still pass because the rendered HTML may still be the same. However, the web site may be rendered entirely differently. Join this session for an intro on how to automatically test website styling and detect unintentional layout changes with various tools and techniques. Learn how to use these tools to refactor your CSS safely.",
    "room": "Room 7",
    "keyWords": [
      "Frontend",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Safurudin Mahic",
        "biography": "Safurudin is a developer and tech lead of the Quality & Delivery group at Bekk Trondheim. With more than 10 years experience in creating web applications in various programming languages such as Ruby, Java and C#, he has a firm grip on the HTTP protocol and the many, both server and client side web application frameworks that utilize it. Safurudin is also a regular speaker and contributor in the local developer community and assistant chairman in the Trondheim chapter of Norwegian .NET User Group."
      }
    ],
    "year": 2013
  },
  {
    "title": "Fant du rytmen med smidig utvikling?",
    "level": "intermediate",
    "intendedAudience": "Utviklere, arkitekter og prosjektledere",
    "summary": "\"Finn rytmen med Agile utvikling!\" sa jeg i 2004. Fant du den?",
    "description": "På JavaZone 2004 holdt jeg presentasjonen \"Finn rytmen med Agile utvikling\". Min påstand den gang var at \"Agile utviklingsteknikker som test-drevet utvikling, kontinuerlig integrasjon, daglige stand-up møter og ukentlige iterasjoner skaper en rytme i prosjektet som er veldig behagelig og effektiv å jobbe i, både for utviklere og prosjektet som helhet.\" Etter 10 år og en rekke smidige prosjekter -- i inn- og utland, i offentlig og privat sektor, med samlokaliserte team og team spredt på ulike kontinenter -- vil jeg oppsummere hva som har vist seg å fungere, hva som ikke har fungert, og på hvilke områder jeg opplever det er størst forbedringspotensiale. Foredraget er basert på egne erfaringer, forskning og sure innspill fra gode kollegaer.",
    "room": "Room 5",
    "keyWords": [
      "Enterprise",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Nils Christian Haugen",
        "biography": "Nils Christian nyter å hjelpe team å levere software som gleder både brukere og sponsorer. Som konsulent er han å finne i ulike roller hvor han får praktisert dette gjennom coaching i smidig test- og utviklingsmetodikk, kravspesifisering, systemarkitektur og utvikling. Nils Christian er sivilingeniør fra NTNU og partner i Scienta."
      }
    ],
    "year": 2013
  },
  {
    "title": "Dropwizard for en solid, RESTful backend-tjeneste",
    "level": "intermediate",
    "intendedAudience": "Web-utviklere, backend-utviklere, Java-programmerere",
    "summary": "Demonstrasjon av Dropwizard for en solid, RESTful, Java backend-tjeneste med kun time proven, solide og etablerte standarder, bibliotek og rammeverk.",
    "description": "Demonstrasjon av Dropwizard for en solid, RESTful, Java backend-tjeneste med kun time proven, solide og etablerte standarder, bibliotek og rammeverk.",
    "room": "Room 7",
    "keyWords": [
      "Enterprise"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Holger Ludvigsen",
        "biography": "Holger er utdannet sivilingeniør i datateknikk fra NTNU. Siden skolebenken har han jobbet i 3 år som konsulent i Bekk Consulting, hvor han nå er fagleder for programmeringsspråk. Han har også grunnlagt og vært med å utvikle slidifier.com."
      }
    ],
    "year": 2013
  },
  {
    "title": "Clojure i den (nesten) virkelige verden",
    "level": "intermediate",
    "intendedAudience": "Utviklere som er nysgjerrig på hvordan Clojure kan brukes i et (nesten) “ordentlig” prosjekt. Litt kjennskap til Clojure vil nok være en fordel, men absolutt ikke noe krav.",
    "summary": "Experience report of using Clojure in a (almost) real word project.",
    "description": "Når Submitit systemet (som brukes til å registrere forslag til foredrag på Javazone) skulle byttes ut ble fristelsen til å skrive en web server med Clojure for stor. I denne lyntalen vil jeg oppsummere mine erfaringer med å bruke Clojure i et økosystem hvor det skal fungere i en webserver, kunne kommunisere med et baksystem og kunne deployes som en war. I tillegg er det implementert mailutsending og Captcha. Jeg vil gå gjennom noe som fungerte bra og noen tabber som kostet tid og krefter.",
    "room": "Room 7",
    "keyWords": [
      "Alternative languages",
      "Experience report"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Anders Karlsen",
        "biography": "Anders jobber i Steria som løsningsarkitekt og utvikler. Han har mer enn ti års erfaring som systemutvikler. Han brenner for å lage enkle løsninger til komplekse problemer, og er alltid på utkikk etter verktøy til å hjelpe han med dette. Etter å ha jobbet en del med Clojure har han funnet ut hvor gøy funksjonell programmering er og ønsker å dele dette med flere programmerere. Anders har tidligere holdt foredrag på blandt annet Javazone og Smidig konferansen."
      }
    ],
    "year": 2013
  },
  {
    "title": "Rydd opp i JavaScript-testene dine med Page Objects",
    "level": "intermediate",
    "intendedAudience": "Frontend-utviklere som tester viewene sine i javascript (f.eks. med Jasmine eller Mocha). Du vil lære noen teknikker for å decouple testene dine fra markupen i viewene dine.",
    "summary": "Skriv mer forvaltbare og mindre skjøre javascript-tester med page objects.",
    "description": "Testing er vanskelig. Testing i frontend er enda vanskeligere. Å skrive gode javascript-tester krever disiplin og en stødig hånd. Hvis ikke, ender du fort opp med en uforvaltbar smørje der mange tester feiler hver gang du endrer et klassenavn eller flytter på et inputfelt. Skal du i tillegg teste en arbeidsflyt i en single-page app må du også tenke på mocking av ajax-kall. Til sammen blir dette fort vondt å teste og testene fort uleslige. For å rydde opp i kompleksiteten kan vi pakke interaksjonen med viewene inn i page objects.",
    "room": "Room 7",
    "keyWords": [
      "Frontend",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Sveinung Dalatun",
        "biography": "Sveinung jobber til daglig som konsulent i BEKK. Som håndverker bryr han seg sterkt om kodekvalitet, testing og automatisering. Han har tidligere presentert på JavaZone, Smidig og Software. Det siste året har han sittet på et frontend-tungt prosjekt i en stor norsk bank. Applikasjonen var en single-page app skrevet i Backbone i et komplekst domene, med store views og høye krav til testing."
      }
    ],
    "year": 2013
  },
  {
    "title": "Scala macros: what are they, how do they work & who uses them",
    "level": "intermediate",
    "intendedAudience": "At least basic knowledge of Scala is highly recommended. After the talk, you should be able to dive in the macro-land and start writing your own macros! Plus, use existing macros to make your work more effective.",
    "summary": "Macros are a brand new feature of Scala 2.10. In the presentation I would like to explain why were they added to the language, show step by step how to write your own simple macro and show some libraries, which already use macros to implement functionalities, which were not possible before.",
    "description": "Macros [1] are one of the new features in Scala 2.10. So far they are marked as experimental, but I think nobody has doubts that they will stay there for good. Introducing macros was quite controversial, as Scala isn't a \"lean\" language already, but I think it was worth it. Macro is simply a Scala program, executed at compile-time, which manipulates the AST of our program. While we probably will mostly write macros when creating a library of a framework, rather than in day-to-day work (hopefully!), for sure it is good to know what are the mechanisms behind them. In the presentation, I would firstly like to show step-by-step how to write a simple macro and how does it work. In the second part I will present libraries, which already use macros (but without implementation details), such as ScalaMock [2], Expecty [3], Slick [4] or my own, MacWire [5]. [1] http://scalamacros.org/ [2] http://scalamock.org/ [3] https://github.com/pniederw/expecty [4] http://slick.typesafe.com/ [5] https://github.com/adamw/macwire",
    "room": "Room 4",
    "keyWords": [
      "Alternative languages",
      "Research and Trends"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Adam Warski",
        "biography": "I am one of the co-founders of SoftwareMill, a company specialising in delivering customised software solutions. I code mostly using Scala and Java. I am involved in a number of open-source projects: as the founder and lead developer of Hibernate Envers, a Hibernate core module providing auditing capabilities, as well as the founder of ElasticMQ, Veripacks and MacWire; and as a contributor to SoftwareMill Bootstrap and xsbt-proguard-plugin. Apart from writing closed- and open-source software, I am interested in improving the way we use functional and object-oriented programming. When not coding, I enjoy spending time with my family, hiking in the mountains or playing tennis. My blog: http://www.warski.org/blog"
      }
    ],
    "year": 2013
  },
  {
    "title": "Clojure spiser XMLen din til frokost",
    "level": "intermediate",
    "intendedAudience": "Passer for utviklere med interesse for og noe erfaring med funksjonell programmering.",
    "summary": "Hvordan man enkelt kan lese og manipulere XML-filer i Clojure ved hjelp av Clojures implementasjon av Zipperdatastrukturen.",
    "description": "XML er ikke alltid enkelt å prosessere, spesielt ved ulogiske strukturer og manglende skjemadefinisjoner. I overgangen fra Java til Clojure må man fortsatt behandle mye XML. Jeg skal vise hvordan man enkelt kan lese og manipulere XML-filer i Clojure ved hjelp av Clojures implementasjon av Zipperdatastrukturen. Ved bruk av disse metodene vil behandling av XML data gå lekende lett.",
    "room": "Room 7",
    "keyWords": [
      "Alternative languages",
      "Functional Programming"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Lars Barlindhaug",
        "biography": "Lars jobber som utvikler hos Iterate og prøver å bruke Clojure der det er mulig."
      }
    ],
    "year": 2013
  },
  {
    "title": "Micro-Services - Java, the UNIX way",
    "level": "intermediate",
    "intendedAudience": "This session is for developers and architects with some experience of building large software systems. The benefits of attending include an introduction to capability modelling, new tools and techniques that allow us to take advantage of advances to deploy small services that work together rather than large applications that have to be deployed all at once, scaled all at once. A basic understanding of REST, architecture techniques and continuous delivery.",
    "summary": "This is a talk for those frustrated by monolithic software products and describes a set of tools and techniques that you can use to break up your products based on the Unix Philosophy of small and simple.",
    "description": "Write programs that do one thing and do it well. Write programs to work together” was accepted 40 years ago yet we have spent the last decade building monolithic applications, communicating via bloated middleware and with our fingers crossed that Moore’s Law keeps helping us out. There is a better way. Micro services. In this talk we will discover a consistent and reinforcing set of tools and practices rooted in the the Unix Philosophy of small and simple. Tiny applications, communicating via the web’s uniform interface with single responsibilities and installed as well behaved operating system services. So, are you sick of wading through tens of thousands of lines of code to make a simple one line change? Of all that XML? Come along and check out what the cools kids are up to (and the cooler grey beards). This is a talk about building micro-services using simple java tools",
    "room": "Room 1",
    "keyWords": [
      "Architecture in practice",
      "Experience report"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "James lewis",
        "biography": "James Lewis is a Principal Consultant for ThoughtWorks based in the UK and a member of the ThoughtWorks Technical Advisory Board. Most recently he has been helping to introduce Agile at various blue chip companies: Investment Banks, Publishers and media organizations. Most recently, James has been spending his time helping ThoughtWorks' clients develop enterprise software as a coding architect."
      }
    ],
    "year": 2013
  },
  {
    "title": "Flyway: The agile database migration framework for Java",
    "level": "intermediate",
    "intendedAudience": "Developers, Architects and DBAs eager to learn about a modern, efficient and pragmatic approach to deal with database migrations. You will find out from the founder and lead developer of Flyway how to make this a reality on your project. Prerequisites: a solid understanding of relational databases and how software is delivered into production.",
    "summary": "Database schema evolution is often performed ad-hoc: a quick statement here, a little script there. The result: confusion and uncertainty. Has this update already been applied on this instance? Should we apply this other script first? Is our application going to run against this database? No more! This is where database migration tools come to the rescue! We'll look at a popular open-source choice called Flyway. By the end of the session, you'll have a solid understanding of what it does, how it works and how to effectively integrate it into your project.",
    "description": "Database schema evolution is often performed ad-hoc: a quick statement here, a little script there. The result: confusion and uncertainty. Has this update already been applied on this instance? Should we apply this other script first? Is our application going to run against this database? No more! This is where database migration tools come to the rescue! We'll look at a popular open-source choice called Flyway. By the end of the session, you'll have a solid understanding of what it does, how it works and how to effectively integrate it into your project.",
    "room": "Room 4",
    "keyWords": [
      "Architecture in practice",
      "Continous delivery",
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Axel Fontaine",
        "biography": "Axel Fontaine is a software development expert and independent consultant based in Munich. He specializes in Continuous Delivery and hates complexity with a passion. He is the founder and the project lead of Flyway, the agile database migration framework for Java. He regularly speaks at technical conferences. You can find him online at axelfontaine.com and on Twitter as @axelfontaine."
      }
    ],
    "year": 2013
  },
  {
    "title": "Integrasjon som skalerer ved å gi utviklerne kontrollen",
    "level": "intermediate",
    "intendedAudience": "Alle utviklere, arkitekter og teknisk prosjektledelse som er interessert i hvordan hverdagen i et stort integrasjonsprosjekt kan være.",
    "summary": "Erfaringsforedraget beskriver utviklerens hverdag i et stort integrasjonsprosjekt og hvordan prosjektet i praksis håndteres med bruk av metoder som feature branching, pull requests, DevOps, kontinuerlige leveranser innenfor ITIL, og teknologi som github, puppet, nagios og release/deployment med rubyscripts.",
    "description": "En av Norges største bedrifter, Oslo kommune, har utviklet en omfattende integrasjonsplattform basert på åpne biblioteker og standarder, best practice for deployment, lastbalansering, konfigurering, overvåkning og organisering av tjenester. Denne vedlikeholdes til enhver tid av et 20-talls utviklere på oppdrag fra 40-50 forskjellige interessenter med sine egne krav, planer og leveranseløp. Alt sammen muliggjøres ved delegering av ansvar til de enkelte utviklerne, som også drifter plattformen. Erfaringsforedraget beskriver utviklerens hverdag og hvordan prosjektet i praksis håndteres med bruk av metoder som feature branching, pull requests, DevOps, kontinuerlige leveranser innenfor ITIL, og teknologi som github, puppet, nagios og release/deployment med rubyscripts.",
    "room": "Room 2",
    "keyWords": [
      "Craftsmanship and Tools",
      "Experience report",
      "Architecture in practice",
      "Continous delivery",
      "Enterprise"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jan Henrik Gundelsby",
        "biography": "Jan Henrik er Cand. scient. og har 15 års erfaring med serverside Java-teknologi, både J2EE og lettvektsrammeverk. Han jobber i dag for Knowit som teknisk prosjektleder, arkitekt og utvikler for et større offentlig IT-prosjekt. Jan Henrik er fagleder for DevOps i Knowit og en ivrig lettvekts-fantast som forsøker å jobbe mot smidige arkitekturer og løsninger."
      },
      {
        "name": "Rune Storløpa",
        "biography": "Rune har i sine drøye 10 år i bransjen jobbet mye med arkitektur og utvikling på Java-plattform i større enterprise systemer. Både på klient- og serverside, og både med tunge J2EE-servere og lettvektsrammeverk. Idag jobber han for Knowit som teknisk-/løsningsarkitekt og utvikler på et større offentlig IT-prosjekt."
      }
    ],
    "year": 2013
  },
  {
    "title": "Think Erlang",
    "level": "advanced",
    "intendedAudience": "People implementing long running backend systems and interested in learning how Erlang achieves it's high uptimes.",
    "summary": "Learn how to think like an Erlang expert and design highly available long running systems.",
    "description": "Many people have heard of Erlang, but very few have actually used it on production systems. In this talk I will be presenting Erlang/OTP in depth, and what makes this ecosystem interesting for building highly scalable fault-tolerant software.",
    "room": "Room 4",
    "keyWords": [
      "Alternative languages",
      "Distributed systems and cloud",
      "Functional Programming",
      "Innovation and Startups"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Ali Sabil",
        "biography": "Ali is Soundrop's CTO and leads the development of Soundrop's Erlang-based real-time social listening platform. Before joining Soundrop, Ali worked for Cisco and TANDBERG where he built enterprise video conferencing and telepresence systems. It was at TANDBERG/Cisco that he began working with Erlang, using the language to help devise a video-enabled social network and communication system. A long-time supporter of - and contributor to - open source projects, Ali has worked on GNOME, GStreamer and the Vala programming language among others. He also has deep experience with real-time communication protocols like XMPP. Ali began his studies at INSA Rennes before moving on to IIT Bombay; he received his masters in computer science from INSA Lyon. He speaks English, French, Arabic as well as elementary Norwegian."
      }
    ],
    "year": 2013
  },
  {
    "title": "JavaScript Framework Face off",
    "level": "beginner",
    "intendedAudience": "Frontend developers and anyone interested in JavaScript MVC.",
    "summary": "With so many JavaScript MVC libraries out there, how does a time constrained developer make a smart choice? In this survey, we'll compare and contrast some of today's most popular libraries.",
    "description": "Developers are flocking to client side frameworks and, as a result, there are more and more JavaScript libraries attempting to solve the rich internet application problem. In a space where new libraries seem to spring up weekly, what framework should you choose for your next project? While there is consensus around basic ideas like Model View Whatever, there are some strong philosophical differences amongst the various libraries. In this talk, we'll look at the similarities and the differences of some emerging JavaScript libraries discussing why you need to be aware of this rapidly evolving aspect of software development.",
    "room": "Room 1",
    "keyWords": [
      "Frontend",
      "Mobile",
      "Research and Trends"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Nathaniel Schutta",
        "biography": "Nathaniel T. Schutta is a solution architect focussed on making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages. Most recently, Nate coauthored the book Presentation Patterns with Neal Ford and Matthew McCullough."
      }
    ],
    "year": 2013
  },
  {
    "title": "Rulespeak på norsk",
    "level": "beginner",
    "intendedAudience": "Alle systemutviklere som har en interesse i kravspesifikasjon og hvordan man finner behovene for løsningene man skal lage. Publikum vil se at man kanskje bør tilnærme seg behovsanalyse fra en litt annen vinkel enn hva som er vanlig idag.",
    "summary": "Lyntalen vil ta for seg hvordan konseptene fra Rulespeak er brukt med norsk språk i et stort offentlig utviklingsprosjekt. Det vil vises hvordan forretningsregler er høstet og dokumentert på en strukturert måte på norsk. Rulespeak består av ett sett av nøkkelord som brukes for å beskrive forretningsregler med norske setninger, samt et sett av \"Dos and Don'ts\".",
    "description": "Har du noen gang lurt på hvordan du best kan samle inn alle forretningsreglene i systemet du skal lage? Opplever du ofte at kravspesifikasjonen ikke er så tydelig som man du skulle ønske? Da er det kanskje fordi du eller kravstiller ikke har vært presise nok i formuleringene, og ikke skiller godt nok mellom forretningsregler og kravspesifikasjon. Rulespeak er et sett av \"best practices\" på hvordan man skriver forretningsregler i naturlig språk (Engelsk). I denne presentasjonen får du et glimt av hvordan konseptene i Rulespeak også kan brukes på norsk og hvordan de har vært brukt i et stort offentlig utviklingsprosjekt.",
    "room": "Room 7",
    "keyWords": [
      "Enterprise",
      "Experience report",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Alf-Kenneth Aabel",
        "biography": "Alf-Kenneth Aabel jobber i Decisive AS som seniorkonsulent hvor hans fokus er regelbaserte løsninger. Han har jobbet med slike løsninger i det offentlige siden 2006 og tenker alltid på hvordan beslutninger kan spesifiseres og implementeres. Et viktig mål for ham er å øke effektiviteten i løsninger ved hjelp av automatiserte beslutninger. Likhet for loven er et viktig prinsipp for ham. Før han ble en \"regelrytter\" jobbet han i mange år med med Javabaserte løsninger. Han er alltid nyskjerrig etter å forstå hvordan nye metoder og løsningsprinsipper kan bidra til bedre løsninger."
      }
    ],
    "year": 2013
  },
  {
    "title": "Designing and Implementing a Graph Database Application",
    "level": "intermediate",
    "intendedAudience": "Developers, data architects, anyone interested in building a graph database application. Attendees will learn how best to model their domain with a graph, using user stories to drive out the model and associated queries. They will also learn how to develop a graph database application test by test, so as to provide a solid basis for growing and evolving the application over time. Attendees should have some familiarity with graph database concepts, but if necessarily I can briefly summarize the essentials.",
    "summary": "Practical guidance for creating a robust graph database data model that can be easily evolved as your application evolves.",
    "description": "Graph databases provide powerful data modelling and querying capabilities for complex domains. In this session I'll describe a structured process for designing and implementing a data model for a graph database application. With a focus on test-driven, incremental and iterative development, I'll show how to build a flexible and expressive graph model and related queries that map closely to your domain needs, and which can be evolved as your application evolves.",
    "room": "Room 1",
    "keyWords": [
      "Architecture in practice",
      "Big Data and NoSQL"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Ian Robinson",
        "biography": "Ian Robinson works on research and development for future versions of the Neo4j graph database, having previously served as Neo Technology’s Director of Customer Success, where he worked with customers to design and develop graph database solutions. He is a coauthor of 'Graph Databases' and 'REST in Practice' (O’Reilly), and a contributor to 'REST: From Research to Practice' (Springer) and 'Service Design Patterns' (Addison-Wesley). He blogs at http://iansrobinson.com, and tweets at @iansrobinson."
      }
    ],
    "year": 2013
  },
  {
    "title": "Concurrent Processing Techniques",
    "level": "beginner",
    "intendedAudience": "Software Engineers and Architects",
    "summary": "Traditional concurrent development on the Java Platform requires in depth knowledge of threads, locks, and queues. Fortunately, new languages and frameworks that run on the Java Platform, such as Akka, have made concurrent programming easier.",
    "description": "In this session, I will demonstrate several concurrent processing techniques including Fire and Forget, Fork-Join, and Asynchronous Web Services using the Java Concurrency Library, the Akka Framework and the Spring Framework.",
    "room": "Room 6",
    "keyWords": [
      "Architecture in practice",
      "Core Java"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jeremy Deane",
        "biography": "Jeremy Deane has over 18 years of software engineering experience in leadership positions. His expertise includes Enterprise Integration Architecture, Web Application Architecture, and Software Process Improvement. In addition, he is an accomplished speaker and technical author."
      }
    ],
    "year": 2013
  },
  {
    "title": "Moving the web to the client",
    "level": "intermediate",
    "intendedAudience": "Developers. They'll learn not only about a new language (Kotlin) and framework (AngularJS), but also learn about HTTP and modern web development.",
    "summary": "Traditional web development frameworks are changing. With an increase in popular frameworks for client-side web development such as Backbone, Ember or AngularJS, the role of the backed is limited to data processing and serving information. And that's exactly where it should be. In this session we're going to combine the power of concise JVM languages such as Kotlin, with front-end frameworks to create powerful and rich web applications. We'll see how we can drastically reduce the amount of code required and create a maintainable system.",
    "description": "Traditional web development frameworks are changing. With an increase in popular frameworks for client-side web development such as Backbone, Ember or AngularJS, the role of the backed is limited to data processing and serving information. And that's exactly where it should be. In this session we're going to combine the power of concise JVM languages such as Kotlin, with front-end frameworks to create powerful and rich web applications. We'll see how we can drastically reduce the amount of code required and create a maintainable system.",
    "room": "Room 1",
    "keyWords": [
      "Functional Programming",
      "Frontend",
      "Core Java",
      "Craftsmanship and Tools",
      "Alternative languages"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Hadi Hariri",
        "biography": "Hadi Hariri is a Developer and Technical Evangelist at JetBrains. His passions include software architecture and web development. Book author and frequent contributor to developer publications, Hadi has been speaking at industry events for over a decade. He is based in Spain where he lives with his wife and three sons. He is also an ASP.NET MVP and ASP.NET Insider."
      }
    ],
    "year": 2013
  },
  {
    "title": "Adding language features through AST hacking – possibilities and limitations",
    "level": "beginner",
    "intendedAudience": "Experienced Java developers that are interested in the language itself should attend. Key takeaways are increased knowledge about what’s going on “under the hood” of the compiler and, hopefully, some inspiration for doing fun things with the language. I assume that the participants know Java and have knowledge about compiler concepts such as grammar and AST.",
    "summary": "Did you know that you can access and modify the complete AST of a Java program through the Pluggable Annotation Processing API? In this session, I hope to provide some inspiration by describing how this is done and by sharing lessons learned from building a generator feature (think yield) for Java.",
    "description": "Did you know that you can access and modify the complete AST of a Java program through the Pluggable Annotation Processing API? There are numerous projects that leverage this to add various interesting language features, such as implicitly typed variables. In this session, I will describe how this is done and share lessons learned from building a generator feature (think yield) for Java. I will touch upon subjects such as constraints imposed by compiler phases, AST rewriting, coding in unsupported API land and AST changes between Java versions, integration testing across Java versions, javac versus other compilers and IDE support. The purpose of the session is to inspire some fun Java hacking, and a fair amount of Java knowledge is assumed.",
    "room": "Room 6",
    "keyWords": [
      "Core Java"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Per Rovegård",
        "biography": "Per Rovegård works as a software consultant at factor10. Per is a passionate developer who believes in having an agile mindset and focusing on simplicity. He is interested in all aspects of software development, but in particular those which have to do with writing good, robust code. He codes Java, Python, C#, JavaScript and more, and while he appreciates good abstractions, he likes to get his hands dirty with raw, technical details. Per blogs at http://programmaticallyspeaking.com."
      }
    ],
    "year": 2013
  },
  {
    "title": "Upload files better with AJAX",
    "level": "intermediate",
    "intendedAudience": "Everyone who has uploaded files using iFrame.",
    "summary": "How to stop using iFrame hacks to upload files with AJAX.",
    "description": "Uploading files with AJAX used to require you to use iFrames to avoid a page refresh. A pretty big hack right? However, two new technologies have made it better; WebSockets and XHR2. I will show you how bad the iframe hack was, how to use the new and better ways, and which browsers support them.",
    "room": "Room 7",
    "keyWords": [
      "Frontend"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Lasse Jul-Larsen",
        "biography": "Developer at Enonic by day, web standards enthusiast by night."
      }
    ],
    "year": 2013
  },
  {
    "title": "Funksjonell hanekamp - Clojure vs Scala",
    "level": "intermediate",
    "intendedAudience": "Programmerere som er interessert i å lære seg et nytt språk. Denne presentasjonen vil vise noen av de grunnleggende forskjellene mellom Clojure og Scala, samt likheter de deler. Det er ikke nødvendig med tidligere erfaringer med Scala eller Clojure.",
    "summary": "Clojure og Scala er to av de mest fremtredende funksjonelle språkene som kjører på JVMen. Ingen av språkleirene har mangel på verken høye ambisjoner, sylskarpe retorikkere og religøse følgere. Krydrer man det hele med den gode gamle \"statisk vs dynamisk\" debatten så er alt lagt til rette for en språklig hanekamp ingen har sett maken til på denne siden av tusenårsskifte.",
    "description": "Clojure og Scala er to av de mest fremtredende funksjonelle språkene som kjører på JVMen. Ingen av språkleirene har mangel på verken høye ambisjoner, sylskarpe retorikkere eller religøse følgere. Krydrer man det hele med den gode gamle \"statisk vs dynamisk\" debatten så er alt lagt til rette for en språklig hanekamp ingen har sett maken til på denne siden av tusenårsskifte. I denne presentasjonen skal vi se på både likheter og ulikheter mellom de to språkene. Med fokus på de funksjonelle egenskapene skal vi se på hvordan Clojure med sitt mål om å etablere en LISP i JVMen er fundamentalt forskjellig fra Scala som forsøker å forene objekt-orientert og funksjonell programmering. Vi vil diskutere deres sterke og svake sider og vise eksempler på hvor hvert språk virkelig viser seg fra sin beste side.",
    "room": "Room 2",
    "keyWords": [
      "Alternative languages",
      "Experience report",
      "Functional Programming"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Alfred Sandvik Lysebraate",
        "biography": "Etter en euforisk opplevelse på noen av de første Scalaprosjektene i Norge ble Alfred kastet tilbake i Javas evigbrennende flammer. Betaler han nå for sine programmeringssynder? Han har uansett personlig erfart hvordan valg av programmeringsspråk kan forandre både tankesett, løsninger og drivkraften til en programmerer."
      },
      {
        "name": "Erik Bakstad",
        "biography": "Etter å ha konkludert med at Scala var for mainstream, valge Erik for tre år siden å lære seg Clojure. Siden den gang har han kjempet en tapende kamp med å evangelisere Lisp i en Java-frelst verden. Frustrasjonen over infiks notasjon og manglende parenteser drev han til slutt til å starte sitt eget selskap hvor han nå får daglig utløp for sin Clojure avhengighet."
      }
    ],
    "year": 2013
  },
  {
    "title": "Livin on the edge: Netflix edge architecture",
    "level": "advanced",
    "intendedAudience": "Those interested in network programming, DevOps, and cloud should attend. You will see the relationship of Netflix infrastructure to control code. You'll also see internal java code in the Denominator project that implements a part of this. This code employs Dagger dependency injection, so those curious about that may wish to attend. Basic knowledge about DNS zones and records will help you enjoy this presentation.",
    "summary": "The edge of the Netflix network is responsible for 1/3 of all internet bandwidth usage in the US. It is staffed by ten thousand EC2 servers and tens of thousands of CDN cache endpoints. During this session, you'll learn about how we manage and control the outer edge, including our new open source java project: Denominator.",
    "description": "Life on the edge is innovating a system that is ultimately responsible for 1/3 of all internet bandwidth usage in the US. Even wonder how Netflix does it? This talk will overview a combination of services and open source projects that comprise the edge network, including Netflix Denominator. Discussions will include how we deal with DNS, distributed load balancing as well discovery of mid-tier services. You'll understand which service components are involved with edge traffic management. When you leave, you'll have enough context to create your own life on the Edge with NetflixOSS!",
    "room": "Room 1",
    "keyWords": [
      "Core Java",
      "Distributed systems and cloud",
      "Architecture in practice"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Adrian Cole",
        "biography": "Adrian is an active member of cloud interoperability, REST, and DevOps circles. He is the founder of two popular open source projects: jclouds and denominator, both of which are java libraries that help create portable cloud deployments. His current title is \"cloud guy\" at Netflix, focused on programmatic edge infrastructure."
      }
    ],
    "year": 2013
  },
  {
    "title": "Fighting bitrot with your mind",
    "level": "beginner",
    "intendedAudience": "Anyone who is in any way involved in software development, either as a developer or as a manager or product owner. Anyone can attend and get something out of it.",
    "summary": "If it isn't worth maintaining, it isn't worth writing.",
    "description": "The process of software maintenance starts just after the very first bits of code have been written. Lets face it very few of us enjoy chasing bugs, reading tagliatelle code, finding inconsistencies in how things are built, fixing the same bug in 50 different places due to copy-paste-coding, not feeling confident in our own modifications due to sub-par tests and having none or broken documentation. As a software project grows, and time passes, it is very common for bugs to be harder to find, changes to be harder to make, and new features harder to integrate. Sounds painfully familiar? Don't worry, in this talk we'll explore ways of dealing with these issue before they even become a problem.",
    "room": "Room 3",
    "keyWords": [
      "Functional Programming",
      "Craftsmanship and Tools",
      "Alternative languages",
      "Experience report",
      "Continous delivery",
      "Enterprise"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Viktor Klang",
        "biography": "Viktorâ\"the legend of\"âKlang, Director of Engineering at Typesafe, is the former Tech Lead for the Akka project. Personal heroes are, including but not limited toâDoug Lea, Walter Sobchak and Daniel Spiewak."
      }
    ],
    "year": 2013
  },
  {
    "title": "Replay your production bugs",
    "level": "intermediate",
    "intendedAudience": "Architects, Developers",
    "summary": "Bugs in production systems are typically communicated in stack traces. But why don't we communicate in unit tests?",
    "description": "This presentation discuss a concrete open source Java framework that allows production systems to communicate bugs as test cases. It will produce deterministic, sandboxable test cases having identical execution paths as the original run. Using the framework correctly will even make multi-threaded scenarios re-playable.",
    "room": "Room 6",
    "keyWords": [
      "Core Java"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Mads Enevoldsen",
        "biography": "Mads Enevoldsen has worked as a consultant for the last decade mainly on the back-end and architecture of systems. Has particular interest in architecture, REST, and software craftmanship. He has spoken on various conferences on subjects of architecture and REST. Has founded the open source REST framework Forest and the tracing framework Deja Vu."
      }
    ],
    "year": 2013
  },
  {
    "title": "Ytelse og stabilitet 101",
    "level": "beginner",
    "intendedAudience": "Arkitekter, utviklere og tekniske testere som vil lære mer om hvordan man lager og tester applikasjoner som skal yte stabilt over tid vil ha stor glede av å delta på denne presentasjonen. Det vil være nyttig for deltagerne å ha en viss forståelse hvordan en servet container fungerer under panseret.",
    "summary": "Keen på å lære hvordan man lager en web-applikason som yter stabilt? Lyst til å lære mer om hvordan man skal tolke thread dumps og memory heap dumps? Da er denne presentasjonen for deg!",
    "description": "Presentasjonen gir en rask introduksjon til hva man skal tenke på når man skal lage en web-applikasjon som skal levere stabil ytelse over tid. Følgende teamer blir sentrale i presentasjonen: - Hvordan håndtere kostbare operasjoner - Hvordan unngå ressursmangel Det vil også bli kjørt en demo hvor vi genererer last mot en webapplikasjon med lastverktøyet Gatling (scala), monitorerer med JMX og analyserer thread dumps og heap dumps for å finne årsaken til problemer.",
    "room": "Room 2",
    "keyWords": [
      "Alternative languages",
      "Architecture in practice",
      "Core Java",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Stefan Magnus Landrø",
        "biography": "Stefan Magnus Landrø er manager i Bekk Consulting, og jobber til daglig med ytelsestesting av web-applikasjoner. Stefan er en aktiv bidragsyter i BEKKs javamiljø, og har tidligere holdt foredrag på blant annet JavaZone, Software og Smidig-konferansene."
      }
    ],
    "year": 2013
  },
  {
    "title": "Umulig å teste? Ikke med PowerMock",
    "level": "intermediate",
    "intendedAudience": "Forventet publikum er javautviklere som ønsker å legge til et nytt verktøy i sitt testarsenal. Det antas grunnleggende kunnskap om enhetstesting og mocking.",
    "summary": "Lyntalen tar for seg hvordan PowerMock kan benyttes til å teste kode som ikke lar seg teste ved hjelp av mock-rammeverk som Mockito og JMock. Videre presenteres det hvordan PowerMock ble tatt i bruk for å teste en 10 år gammel EJB-basert J2EE applikasjon uten eksisterende tester.",
    "description": "Mockito og JMock er eksempler på mock-rammeverk som benyttes i test-drevet utvikling. Men i en del situasjoner kommer disse rammeverkene til kort, f. eks. ved testing av gammel legacy kode og kode som benytter finurlige 3. parts biblioteker. Hvordan enhetstester man \"utestbar kode\" når man ikke ønsker eller ikke kan endre selve koden? Lyntalen tar for seg hvordan man kan løse slike vanskelige testsituasjoner med PowerMock, for eksempel mocking av statiske metoder, mocking av final klasser og mocking av hardkodede avhengigheter. Videre presenteres det hvordan PowerMock ble tatt i bruk for å skrive de første testene av en 10 år gammel EJB-basert J2EE applikasjon.",
    "room": "Room 7",
    "keyWords": [
      "Experience report",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Thomas E. Bjørge",
        "biography": "Thomas er utdannet sivilingeniør i datateknikk fra NTNU og jobber som arkitekt og utvikler i Visma Consulting. Han har 8 års erfaring med javautvikling i store, offentlige prosjekter og er svært interessert i kodekvalitet og testing. Thomas har jobbet både med nyutvikling og med modernisering av gamle legacy applikasjoner der innføring av automatiserte tester har vært kritisk for prosjektenes suksess."
      }
    ],
    "year": 2013
  },
  {
    "title": "6 Years Later: One Line of Code That Changed the Web Forever",
    "level": "intermediate",
    "intendedAudience": "Friends of new ideas, new thinking, and breaking the rules. Anyone considering implementing new, or upgrading existing, solutions using this new Web standard called WebSocket. Participants will gain better understanding and knowledge of the full impact the WebSocket standard, and how it will help them today in to real-life implementations.",
    "summary": "One line of code that changed the Web forever, and how to take advantage of it to build new and exciting solutions.",
    "description": "I have more than once been asked what I believe the impact of the emerging WebSocket standard would have on the Web, assuming we continue down the path that has already been laid out. The impact could be the same, or even more profound, as when we were first introduced to HTTP as a means to share static documents. Today, 6 years after inception, this new standard is rapidly maturing as the preferred choice deploying interactive live Web solutions. It is changing how we think about Web architecture and design, and how we can leverage this phenomenal communication fabric for new exciting solutions. In this session we will discuss the progress of the WebSocket standard, how to architect, build, and deploy real-world solutions, and what new exciting solutions we see at the horizon that is leveraging this new Web standard.",
    "room": "Room 5",
    "keyWords": [
      "Frontend",
      "Research and Trends",
      "Architecture in practice",
      "Distributed systems and cloud",
      "Enterprise"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "John Fallows",
        "biography": "John Fallows is co-founder and CTO of Kaazing, a company recognized for its contribution to the creation of the WebSocket standard. John is actively involved in standard bodies such as AMQP and his sons football team. As his co-founder, he lives by the rule that no task is too big or impossible, it just need to be properly qualified."
      },
      {
        "name": "Jonas Jacobi",
        "biography": "Jonas Jacobi is co-founder and CEO of Kaazing, a company recognized for its contribution to the creation of the WebSocket standard. He lives by two rules; 90% of life is showing up, and nothing is impossible (impossible things might just take a bit longer)."
      }
    ],
    "year": 2013
  },
  {
    "title": "Information-Leading Architectures",
    "level": "intermediate",
    "intendedAudience": "This is a challenging topic for no other reason than it encourages people to look at the world differently. Developers, architects and business people will all benefit, but all that is really required is an open mind and a basic understanding of Web technologies. Everything else will be introduced or derived in the talk.",
    "summary": "By taking a look at industry trends and standards with proven track records, developers and architects will gain insight on how to improve their ability to add value within an organization.",
    "description": "Developers are used to thinking in terms of code. Architects are used to thinking in terms of systems. By learning to think about information, both groups can build more and better value. Software is but a means to an end. We will learn from where the Web has been and where it is going. We will see that tools like REST, Machine Learning and Big Data are all interesting, but insufficient.",
    "room": "Room 1",
    "keyWords": [
      "Research and Trends",
      "Experience report",
      "Architecture in practice",
      "Big Data and NoSQL",
      "Distributed systems and cloud",
      "Enterprise",
      "Innovation and Startups"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Brian Sletten",
        "biography": "Brian Sletten is a liberal arts-educated software engineer with a focus on forward-leaning technologies. His experience has spanned many industries including retail, banking, online games, defense, finance, hospitality and health care. He has a B.S. in Computer Science from the College of William and Mary and lives in Auburn, CA. He focuses on web architecture, resource-oriented computing, social networking, the Semantic Web, data science, 3D graphics, visualization, scalable systems, security consulting and other technologies of the late 20th and early 21st Centuries. He is also a rabid reader, devoted foodie and has excellent taste in music. If pressed, he might tell you about his International Pop Recording career."
      }
    ],
    "year": 2013
  },
  {
    "title": "Advanced Enterprise Architectures using Open Source",
    "level": "advanced",
    "intendedAudience": "Developers and Architects looking to learn about real world experiences architecting SOA using open source frameworks like ActiveMQ, Camel and CXF in an OSGI environment. Attendees should have these basic skills 1st item: intermediate Java 2nd item: Basic Understanding of web services 3rd item: Spring 4th item: Messaging 5th item: XML",
    "summary": "Learn how to more efficiently interact and develop with components of a service-oriented architecture and how to build a stable and scalable system that can grow with ever changing requirements using open source frameworks.",
    "description": "In this session attendees will learn about the different levels of concern within SOA and where to implement different frameworks within enterprise architectures. Tips and tricks that can only be learn through the school of hard knocks are presented here to give the attendee a big leap ahead in architected their systems. It will also point out commons trouble spots often encountered in large-scale systems. These are advanced system integration concepts with a focus on high availability using open source frameworks in a service-orientated architecture. It will cover best practice tips for implementing/architecting ESB, mediation router, and messaging in infrastructures needing large scale, high transaction capabilities",
    "room": "Room 4",
    "keyWords": [
      "Architecture in practice",
      "Enterprise"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Heath Kesler",
        "biography": "Heath Kesler is an open source software evangelist, developer and architect; he has created Java architectures for large scalable, high transaction load systems for such companies as Health Language, LeapFrog Enterprises, Verizon, GE-Energy, Comcast, and IBM. Heath has been a team lead in many project recovery implementations, helping to rescue systems on the verge of collapse. He has been involved with the architecture and implementation of large-scale enterprise systems throughout the world. He conducts trainings on how to use open source frameworks to integrate messaging and services. Heath enjoys pushing the envelop by finding new ways to implement solutions using cutting edge technologies for old and new problems. Heath has spoken at conferences all over the world and was selected as a 2012 JavaOne Rockstar. He enjoys any opportunity to discuss the latest technologies with those who share in his passion. He is an active contributor to several Apache frameworks and a committer on Karaf."
      }
    ],
    "year": 2013
  },
  {
    "title": "Lær Kidsa Koding!",
    "level": "beginner",
    "intendedAudience": "Alle som ønsker å bidra til at ungene og ungdommen kan lære å kode!",
    "summary": "Hvorfor vi er til, hva du kan lære bort til barn og hva vi gjør. Så litt om hvordan vi jobber med skoler, og hva skolene trenger hjelp til. Så forteller vi deg hva bedrifter kan gjøre, og hva du kan hjelpe til med.",
    "description": "Lær Kidsa Koding! har flere hundre medlemmer og lokale grupper i mange byer. Her gir vi litt bakgrunn og viser retningen videre. Hvor kommer digital kompetanse fra? Hvorfor skal du bry deg? Hvorfor bryr de seg i utlandet? Hva kan vi forvente å lære bort til barn i forskjellige aldersgrupper? Hvilke ferdige kursopplegg finnes? Hvem kan du snakke med for å hjelpe til? Hva gjør vi videre?",
    "room": "Room 6",
    "keyWords": [
      "Research and Trends"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Simen Sommerfeldt",
        "biography": "Simen Sommerfeldt, CTO Oslo hos Bouvet ASA og medlem av Østlandsstyret i Dataforeningen. Stiftet Lær Kidsa Koding! for å sørge for at barn kan få en mulighet til å skjønne og kontrollere en stadig mer digital verden."
      },
      {
        "name": "Torgeir Waterhouse",
        "biography": "Direktør internett og nye medier IKT-Norge og leder for Digitutvalget. Ble med tidlig i Lær Kidsa Koding! og koordinerer nå nettverket sammen med Simen"
      }
    ],
    "year": 2013
  },
  {
    "title": "Autoscaled Frankenstein Pipeline in the Cloud",
    "level": "beginner",
    "intendedAudience": "Architects and developers that want to run complex, long-running processing pipelines, with short deployment times and without making major investments in hardware or infrastructure.",
    "summary": "How to build an automatically scaled processing pipeline with Java, Amazon EC2 and S3.",
    "description": "Cloud computing vastly simplifies the process of launching new servers with various configurations. This presentation tells the story of how we at Comoyo used Amazon Web Services (EC2 and S3) to create our own Frankenstein monster, a video processing pipeline that splits the tasks across a mix of various operating systems and components. Processing nodes are launched automatically when needed, and shut themselves down when there's nothing to do, providing a system that easily handles large workloads, while requiring very little up-front investments and little to no costs when activity is low. While we used this for video processing, the approach presented can be used for any long-running tasks that require many different software components. Our architecture is based on plain Java and some Bash scripting, with coordination over JAX-RS interfaces in straight-forward HTTP.",
    "room": "Room 3",
    "keyWords": [
      "Architecture in practice",
      "Distributed systems and cloud"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Leif Einar Aune",
        "biography": "Leif Einar Aune is a software architect and application developer at Comoyo, with broad experience from large, distributed mobile telecommunications networks and multimedia transcoding and distribution. He is the tech lead for Comoyo&apos;s video processing pipeline."
      },
      {
        "name": "Markus Krüger",
        "biography": "Markus Krüger is a developer at Comoyo, where he is getting paid for having fun with curly bracket languages. He has held several presentations at JavaZone and other venues previously, on various subjects such as performance testing, scheduling, and scalability through streaming. He likes making large things go fast."
      }
    ],
    "year": 2013
  },
  {
    "title": "Eclipse - et OpenSource økosystem som du sikkert vet for lite om!",
    "level": "beginner",
    "intendedAudience": "Utviklere som er nyskjerrige på en del av OpenSource-miljøet de kanskje vet for lite om. Få tips om OpenSource-prosjekter som du kan dra nytte av i ditt neste prosjekt!",
    "summary": "Eclipse er mye mer enn en IDE (og en av Twilight-filmene...). Eclipse er et OpenSource-miljø de fleste vet for lite om!",
    "description": "For to år siden trodde jeg - i likhet med alt for mange Java-utviklere - at Eclipse kun er en IDE. Etter det har jeg jobbet på et prosjekt hvor vi har bygget vår programvare på toppen av mange forskjellige Eclipse-rammeverk. Jeg har selv erfart at Eclipse-økosystemet er en skjult skatt, og etter å i tillegg ha deltatt på fire Eclipse-konferanser, ønsker jeg å spre det glade budskap: Finn ut mer om hva Eclipse kan tilføre ditt neste prosjekt!",
    "room": "Room 7",
    "keyWords": [
      "Experience report",
      "Research and Trends"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Eirik F. Wahl",
        "biography": "Jeg jobber som systemutvikler i konsulentbedriften Itema, Norges beste arbeidsplass. Jeg har vært programmerer i 13 år, og siden 2011 har jeg jobbet på et prosjekt for Sintef MARINTEK, hvor vi lager en tykk-klient for simuleringer av ting i og under vann. Eclipse gjør at produktet vårt er ti ganger bedre enn om vi hadde startet fra null."
      }
    ],
    "year": 2013
  },
  {
    "title": "Don't use Git",
    "level": "intermediate",
    "intendedAudience": "developer, team leads, tester",
    "summary": "Git is unsocial and destroys the team experience. Don't use it.",
    "description": "Are you using Subversion or CVS? That's great, whatever you do, don't migrate to Git! Git makes you work overtime, confuses developers with too many options, destroys the social interaction with your co-workers and much more. Git has unnecessary features like offline commits and cherry picking that nobody needs at his day job. Your code is the most important thing for your software development and you should use a mature technology for storing it. Let the kids play around with Git. In this ironic lightning talk I will give you 5 reasons, why you shouldn't use Git always with a twinkle in the eye. So create a new branch in SVN and come to my session while you checkout the branch.",
    "room": "Room 7",
    "keyWords": [
      "Craftsmanship and Tools"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Sven Peters",
        "biography": "Sven Peters is a software geek working as an ambassador for Atlassian. He has been developing Java applications for over 12 years and leading small teams using lean methodologies. Sven likes effective software development and cares about the motivation of developers."
      }
    ],
    "year": 2013
  },
  {
    "title": "Bygging av JavaScript-prosjekter med Grunt",
    "level": "beginner",
    "intendedAudience": "Lyntalen vil være nyttig og skal passe for alle som driver med webutvikling og som trenger inspirasjon til å forbedre bygget sitt. Etterpå vil du sitte igjen med konkrete forslag på løsninger på problemer du opplever i forbindelse med utvikling og bygging av prosjektet ditt.",
    "summary": "Sammenslåing av kildefiler, minifisering, optimalisering av bilder, erstatning av variabler brukt under utvikling, og selvfølgelig kjøring av tester og kodeanalyser. Grunt er et byggeverktøy skrevet i JavaScript basert på en fornuftig plugin-arkitektur som løser ethvert problem du måtte kaste på den.",
    "description": "En moderne nettside, nesten uansett hvor enkel den måtte være, må igjennom en rekke steg før den er klar for verdensveven. Sammenslåing av kildefiler, minifisering, optimalisering av bilder, erstatning av variabler brukt under utvikling, og selvfølgelig kjøring av tester og kodeanalyser. Grunt er et byggeverktøy skrevet i JavaScript basert på en fornuftig plugin-arkitektur som løser ethvert problem du måtte kaste på den. I tillegg er den ekstremt enkel å utvide. Basert på erfaringer fra flere prosjekter vil jeg demonstrere noe av det Grunt kan gjøre for deg.",
    "room": "Room 7",
    "keyWords": [
      "Frontend",
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Pål Ruud",
        "biography": "Pål er utdannet sivilingeniør i kommunikasjonsteknologi fra NTNU og jobber som systemutvikler i Iterate AS. Han har jobbet med webutvikling i 10 år, og er alltid på utkikk etter måter å forbedre verktøy og prosesser i og rundt programvareutvikling ."
      }
    ],
    "year": 2013
  },
  {
    "title": "Elektronisk tekstbehandling",
    "level": "beginner",
    "intendedAudience": "Presentasjonen er for de som vil bli bedre kjent med de klassiske verktøyene for tekstbehandling på Unix. Hensikten med foredraget er at neste gang du drar frem ditt favorittprogrammeringsspråk for å massere tekst så skal du hvertfall ha vurdert om det finnes en enklere vei til målet. Det forutsettes at du har grunnleggende kjennskap til kommandolinjen.",
    "summary": "Har du noen gang hatt behov for å strukturere eller filtrere store mengder tekst? Denne presentasjonen vil fortelle deg om hva slags muligheter som ligger i Unix-verktøykassen og når det passer å bruke den.",
    "description": "Moderne programmeringsspråk er kraftige saker; de kjemper om å overgå hverandre med høyere og hæere abstraksjonsnivåer. Men av og til kan den korteste veien til målet befinne seg i verktøy som ble laget før internett ble oppfunnet. Ofte gjelder det når man skal behandle store mengder tekst. Denne lyntalen vil gi en oversikt over Unix-verktøy for å strukturere og filtrere tekst.",
    "room": "Room 7",
    "keyWords": [
      "Craftsmanship and Tools"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Odin Hole Standal",
        "biography": "Odin er en kodemaker som liker å fylle verktøykassen. Han elsker å programmere, men blir aldri så glad når utfordringer kan løses med elegante Unixkommandoer."
      }
    ],
    "year": 2013
  },
  {
    "title": "Economies of Scala",
    "level": "beginner",
    "intendedAudience": "Developers interested in alternative languages, technical leaders, managers hiring developers.",
    "summary": "In this presentation, the data will do most of the talk. Show up if you want to know why choosing Java is a business risk, or why the most important reason for choosing Scala or Clojure is non-technical.",
    "description": "For software companies in a tight employment market like the one in Norway, most technical advantages are dwarfed by one concern: Access to good developers. It clearly doesn't matter what kinds of technical advantages a new language can bring, if you can't hire any developers to work with it. On the flip side, if you can bring great developers to your project, you're probably in good shape no matter what language you have chosen. Starting with a list of the 23 most popular programming languages, I have investigated the job market and surveyed more than 100 developers in Norway. Based on this insight, my analysis seeks to answer important questions about developer preferences and their accordance with available positions in the market. For instance, it turns out that although Java is the most widely known language, it is a risky choice for businesses. On the other hand, organisations that base their projects on Scala or Clojure should be optimistic about their future. If businesses took this advice to heart, the science of software development would progress, and developers and managers everywhere would be happier.",
    "room": "Room 3",
    "keyWords": [
      "Alternative languages",
      "Enterprise",
      "Functional Programming",
      "Research and Trends"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Simen Fure Jørgnsen",
        "biography": "Having started his career as a Java developer, Simen went on to become co-founder and CEO of Iterate. Some might say that means Simen has joined the dark side - but he refuses to let go of his technical upbringing. His mixed career means that he takes an interest in business issues as well as technology, learning Organizational Analysis one month and Data Analysis with R the next."
      }
    ],
    "year": 2013
  },
  {
    "title": "Building a life-saving portal as a single page Javascript application",
    "level": "intermediate",
    "intendedAudience": "* Java developers curious about the recent wave of Javascript tools and how they work in a Java environment. * Web-app developers curious about how these tools were employed in a Java environment. * Developers interested in the advantages and pitfalls of BackboneJS employed in a large application.",
    "summary": "How we used BackboneJS and other Javascript tools to create a single page Javascript frontend against a Spring/Java backend for the new National Health Portal. Presentation will be held in norwegian.",
    "description": "Javascript libraries and client-side MV* frameworks like BackboneJS are very popular and much discussed these days, but Java is not usually the typical choice of backend platform for web-applications that employ these tools. In this talk I will share our experiences after integrating a modern frontend-stack with a Java-backend, shining light on what the challenges were and how we resolved them. Kjernejournal is a new initiative by the Norwegian Directorate of Health to gather important health information from all (non-reserving) citizens in a common health-record system to which all authorized health personell has access - anywhere, anytime, with the ultimate goal to save lives through increased information sharing. The product is a web portal, and naturally the demands of security, but also of responsiveness and usability are very high.",
    "room": "Room 5",
    "keyWords": [
      "Frontend"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Aksel Gresvig",
        "biography": "Aksel is a developer at Accenture with wide experience creating web applications using Adobe Flex, Java/Spring, and HTML/Javascript. He is very keen on staying up to date on the latest trends and technologies available to create cutting-edge web applications. At Kjernejournal - a large project with ~20 developers, Aksel has the role of frontend architect and developer. He is very focused on choosing the right technical approach when it comes to GUI implementation - to meet not only the demands but also the wishes of the UX/designer-team, making no compromises on usability and speed but still delivering on time and budget."
      }
    ],
    "year": 2013
  },
  {
    "title": "Machine Learning for Java Developers - it’s not just the algorithms",
    "level": "beginner",
    "intendedAudience": "This talk mainly targets Java developers with an interest in machine learning or just an interest in learning something new. The talk should also be useful for entrepreneurs with ideas for data-driven apps or services, or for anyone working on such projects. To work with machine learning it is useful to know some statistics and probability theory, but for this talk we’ll keep the math to a minimum.",
    "summary": "Learn how to build and run a system that gets smarter over time by learning from data. If you already took a class in machine learning this talk will show you how to translate those skills into a working system. If you don’t know any machine learning you will get a gentle introduction and gain a better understanding for how the data-driven sausage is made.",
    "description": "This talk will teach you what goes into building and running a machine learning system, as seen from a Java developer’s perspective. This will prepare you for the next phase of Big Data, where data is used not just for informing decisions but to drive system behavior. Instead of going into the details of algorithms we will discuss the overall system and project lifecycle (modeling, training, serving, re-training). Along the way you will get practical tips and advice about useful tools, some that you already know and some you probably haven’t heard of. Lastly you will get some tips for how can start playing around with this stuff even if nobody is paying you for it.",
    "room": "Room 5",
    "keyWords": [
      "Big Data and NoSQL",
      "Experience report",
      "Research and Trends"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Thomas Oldervoll",
        "biography": "Thomas Oldervoll has worked 8 years as a Java enterprise consultant for Zenior in Oslo and 5 years as a Software Engineer for Google in Mountain View. Machine learning was something he got into at Google, where he worked on several projects that used machine learning for spam, abuse and fraud detection. Nowadays his tech interests can be summarized as what has been called \"the new tech mullet\": simple mobile interactions up front, big data in the back."
      }
    ],
    "year": 2013
  }
]
