[
  {
    "title": "Java Knobs: How to change performance of the Sun JVM",
    "level": "intermediate",
    "summary": "The Sun JVM has literally hundreds of command line options that can be used to control its internal functions. This session will explore a subset of those options explaining the different ways that garbage collection, threading and instruction execution can be configured for different types of application to improve performance.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Simon Ritter",
        "biography": "( Sun ) Simon Ritter is a Java Technology Evangelist at Sun Microsystems. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K. Originally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon moved to Sun in 1996. At this time he started working with Java technology and has spent time working both in Java technology development and consultancy. He now specialises in looking at emerging technologies including grid computing, RFID, robotics and wireless sensor networks. Simon and his performing LEGO robots have appeared before audiences worldwide."
      }
    ],
    "year": 2006
  },
  {
    "title": "Geronimo: design motivations, history, and possible future directions",
    "level": "beginner",
    "summary": "Apache Geronimo has rapidly grown to be a successful community and an architecturally advanced implementation of J2EE standards. This presentation will inform the audience of its design motivations, history, and possible future directions. This also touches both open source community development and avenues for commercialization.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Adam Lieber",
        "biography": "Worldwide sales lead ( IBM ) Adam Lieber is worldwide sales lead for WebSphere Application Server Community Edition having previously led the emerging markets iniatives for the product line. He is a co-founder of Gluecode Software, acquired by IBM in 2005 to form the basis of CE. At Gluecode he was responsible for sales and partnership activities. Prior to Gluecode, he was an IT and services focused venture capital analyst at the San Diego-based fund Mission Ventures. Graduated in Economics and Computer Science at Princeton, he also completed coursework at London School of Economics."
      }
    ],
    "year": 2006
  },
  {
    "title": "Are you a plumber? How to avoid plumbing for business-enriched remote clients",
    "level": "intermediate",
    "summary": "Traditional n-tier applications are quite inflexible to changes in the domain model. A common architecture is to use data transfer objects (DTO) between client and server. A change in the domain model will imply changes in many places; in the DTO layer itself, in the DTO to client mapping layer, in the server to DTO layer, in the domain/business layer and finally in the persistence layer. This is a very tedious and error-prone approach. As part of the ModelWare EU-project, WesternGeco has developed a framework that supports a transparent and shared domain-model between client and server. All persistence needs are handled on-demand, meaning that there is no need to explicitly define what should be created, retrieved, updated, or deleted (CRUD). All such operations are available from a remote client, where Java dynamic proxies takes care of tracking what needs to be done . Changes to the domain model needs to be done only in a single place; - in the domain layer itself. The framework is flexible with respect to communication middleware and persistence layer. The CRUD part of the domain-model is generated from UML class-diagrams, while the business behavior is hooked in as conventional Java classes.",
    "description": "This talk will explain and demonstrate the framework by a real example; a requirements management system (Precise) built as an Eclipse plugin. This application is also built as part of the ModelWare project. The implementation uses Hessian for communication, Jetty as servlet container, Hibernate with MySQL as the DBMS, and Eclipse plugin as a client application using the framework. The modularity of the 11 modules is taken care of by using Maven 2 for dependency handling. Other tools tested to ensure proper modularity are: Tomcat, Burlap, PostgreSql, HSQLDB, and db4Objects.",
    "language": "en",
    "speakers": [
      {
        "name": "Ole-Andre Ranvik",
        "biography": "Senior Consultant ( zenior.no ) Ole Andre Ranvik is a senior consultant working for Zenior AS. He has specialized in JEE development and is a Sun certified web component developer. He has previously been doing a session at JavaZone on portlets."
      },
      {
        "name": "Bjørn Nordmoen",
        "biography": "Chief System Architect ( Western Geco ) Bjørn Nordmoen has a Master of Physics from University in Oslo (1983). He has been working with WesternGeco in the R&E department since 1983, where he has held various positions as developer, architect and manager. WesternGeco is a Seismic Company and develops its own advanced technical equipment, both hardware and software. Bjørn has been working as the Chief System Architect at Oslo Technology Center since 2001, where he overlooks and mentors the software architecture activities. A key focus is on improving the Quality of the software systems by using the principle of simplicity, automation and test-driven development process. The last two years Bjørn has been involved in an EU sponsored project called ModelWare, which focus on Model Driven Development and productivity improvements. He has also participated in the former OBOE and COMBINE EU-projects."
      }
    ],
    "year": 2006
  },
  {
    "title": "Effective Java Reloaded",
    "level": "intermediate",
    "summary": "It has been five years since Effective Java™ was released. The Java™ platform has evolved, and we've learned more about how to use it to best effect. This session covers new material that will be added to the second edition. This material should be useful to every working Java technology programmer.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Joshua Bloch",
        "biography": "( Google ) Joshua Bloch is a Principal Engineer at Google. He was previously a Distinguished Engineer at Sun Microsystems and a Senior Systems Designer at Transarc. He led the design and implementation of numerous Java platform features, including the JDK 5.0 language enhancements and the Java Collections Framework. He is the author of the Jolt Award-winning book Effective Java. He holds a Ph.D. in Computer Science from Carnegie-Mellon University and a B.S. in Computer Science from Columbia."
      }
    ],
    "year": 2006
  },
  {
    "title": "The Continous Adventures of Java Puzzlers: Tiger Traps.",
    "level": "beginner",
    "summary": "Josh Bloch present eight more programming puzzles for your entertainment and enlightenment. An entirely different set of puzzles from those presented in previous years, this year's talk focuses on features introduced in the Java™ 2 Platform, Standard Edition 5.0 (J2SE™ 5.0)--\"Tiger\"--release. The game show format keeps you on your toes, and the puzzles teach you about the subtleties of the Java programming language and its core libraries. Anyone with a working knowledge of the language will be able to understand the puzzles, but even the most seasoned veterans will be challenged. The lessons you take from this talk are directly applicable to your programs and designs. Some of the jokes may even be funny.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Joshua Bloch",
        "biography": "( Google ) Joshua Bloch is a Principal Engineer at Google. He was previously a Distinguished Engineer at Sun Microsystems and a Senior Systems Designer at Transarc. He led the design and implementation of numerous Java platform features, including the JDK 5.0 language enhancements and the Java Collections Framework. He is the author of the Jolt Award-winning book Effective Java. He holds a Ph.D. in Computer Science from Carnegie-Mellon University and a B.S. in Computer Science from Columbia."
      }
    ],
    "year": 2006
  },
  {
    "title": "Practical JMX",
    "level": "intermediate",
    "summary": "This talk covers Java Management Extensions (JMX) in Java EE, existing tools to manage and monitor your Java EE based applications, as well as examples of how you can implement application-specific management of your own applications using JMX technology. The session starts with an introduction to the management and monitoring information provided by the Java EE platform, and shows how to use JConsole and MC4J to tap into the wealth of monitoring information provided by the Java EE platform and the Tomcat server. JConsole (included in JDK 5.0) and MC4J are monitoring and management tools that provide information on performance and resource consumption of applications using JMX technology. Secondly, we are going to look into different aspects of application-specific management, and how JMX MBeans allows you to configure, manage and monitor your application. The last part of the presentation demonstrates some of these aspects on a Java EE application using the Spring Framework. When you attend this session you will be acquainted with some of the existing tools for managing and monitoring JMX-enabled platforms and applications, and should be able to start implementing application-specific management for your own application through JMX MBeans.",
    "description": "Intro (5 min) o Short intro to JMX o Management environment in Java EE 5 Connect to provided MBeans (15 min) o J2EE Management (JSR 77) o VM-provided and platform-provided MBeans o Demo : JConsole o Demo : MC4J Application specific MBeans (15 min) o Areas of application management o Building a manageable application with Spring o Best practices / lessons learned Demonstrations (15 min) o Configuration of logging o JMX and Ajax o Application statistics Q & A (10 mins) Duration 50 minutes with 10 minutes to Q and A. Language Norwegian Level: Intermediate Required experience General JEE knowledge, interest in JMX technology and examples of good use of JMX. Expected audience Devlopers / architects that are curious about JMX and want to learn more about how to use JMX to configure, manage and monitor your application.",
    "language": "en",
    "speakers": [
      {
        "name": "Per Mengshoel",
        "biography": "Per Mengshoel works as a developer and architect for BEKK. With valuable experience from working with enterprise Java for more than 8 years, he is now focusing on agile methods, testing and application management. He heads the Systems development competency group in BEKK."
      }
    ],
    "year": 2006
  },
  {
    "title": "MVC and DCA: Two complimentary system architectures.",
    "level": "intermediate",
    "summary": "My MVC (Model-View-Controller) is a well known architecture for bridging the gap between the user’s mental model and a computer. MVC supports the user illusion of working directly with the domain information (models) as seen in different perspectives and presented in different views. All I/O code is pulled out of the model programs; making them simpler and more readable. The MVC is particularly applicable to situations with complex information and knowledgeable users. My DCA (Data-Collaboration-Algorithm) is a new architecture for creating simple solutions to complex problems. It uses a divide and conquer approach to hide object substructures within components that appear as regular objects in their environment. The DCA architecture further simplifies the internals of complex components; data and collaboration aspects are refined and made explicit in specialized data and interaction objects. The result is disentangled and more intelligible code with member objects being purified to implement the essential algorithms only.",
    "description": "Outline 1) Intro (4 min) The BabyUML project - “The price of reliability is the pursuit of the utmost simplicity” 2) The well-known MVC: Model – View – Controller (15 min) a) Goal and abstract architecture. b) Example demo for whole talk: Project panning with activity network. c) MVC Structure. View and controller details. d) Behavior example: Controller coordinates selection. Example code. 3) The new DCA component separates Data – Collaboration - Algorithm a) Data as base relations (a “micro database”). Code explicitly declares “What are the objects”? b) Collaboration as a temporary relations; queries. Provides a tailored object structure. Code explicitly declares “How are they interconnected”? c) Algorithm specifies interobject interaction. Code explicitly defines “How do they interact?” d) Two code examples: i) A View access base objects through a collaboration. ii) A network method (frontloading) access database through a different collaboration. 4) Summary and conclusion (6 min) a) MVC and DCA paradigms summary b) Critique: when to use and not use MVC and DCA c) Final claim: MVC and DCA scales! 5) Q and A (10 min) Duration 50 minutes + 10 minutes to Q and A and transition to next talk. Language English or Norwegian as preferred by organizers. Level Intermediate Required experience Some knowledge of Java. Expected audience The talk is for system designers and architects who will see novel principles for structuring complex systems of interacting objects. The goal is to build self-documenting systems that can be modified with confidence.",
    "language": "en",
    "speakers": [
      {
        "name": "Trygve Reenskaug",
        "biography": "Trygve Reenskaug has nearly 50 years experience with the development of professional software and software engineering methodologies. He is now a researcher and professor emeritus of informatics at the University of Oslo. He has extensive teaching and speaking experience including keynotes, talks and tutorials. His firsts include the Autokon system for computer aided design of ships with end user programming, structured programming and a data base oriented architecture in 1960. Object oriented applications and collaboration (role) modeling in 1973. Model-View-Controller, the world's first reusable object oriented framework, in 1979. OOram role modeling method and tool in 1983. The premier book on role modeling in 1995. He was a member of the UML Core Team, adding role modeling under the name of Collaborations. He is currently developing BabyUML, a new discipline for high level programming of object systems where a program = Data + Communication + Algorithm."
      }
    ],
    "year": 2006
  },
  {
    "title": "Comparing design pattern implementations in Java and AspectJ.",
    "level": "advanced",
    "summary": "The use of design patterns in our applications gives us a great tool for communicating design decisions, and represents best practices for solving recurring design problems, but they can also be quite cumbersome to write. In this talk I will take a look at some of the classic Gang of Four patterns and contrast the Javabased and AspectJbased implementations. I will also illustrate that some of these patterns are much easier to grasp and that some are no longer needed with AOP.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Kaare Nilsen",
        "biography": "Software developer, architect and senior consultant ( Objectware ) Kaare Nilsen is a software developer and architect working as a senior consultant in Objectware AS. He has more than 10 years of programming experience and currently focuses on AOP and lightweight component containers. He also gives courses in AOP, where he has been secondary instructor to the AspectJ lead programmer Adrian Colyer, and maintains the AspectJ compiler plugin for Maven2."
      }
    ],
    "year": 2006
  },
  {
    "title": "DTracing Java - Super Powers for the Developer!",
    "level": "advanced",
    "summary": "This session will demonstrate how to use the revolutional dynamic tracing framework, DTrace, that ships with Solaris 10 to profile java applications. DTrace allows the developer to profile a complete system, including the kernel and I/O, and is thus not limited to the application layer. After this session you will be familar with the DTrace concept and ready to write your very first own D program.",
    "description": "Author introduction (5 min) o Rikard o Peter DTrace intoduction (15 min) o What is DTrace o Compared to usual Profiling tools + the added value o Usage scenarios + System in production + Black box - crash analysis The D language (5 min) o Hello world Using DTrace with Java (25 min) o Core presentation Demo (through out the session) o 5-6 demos The future for DTrace and Java SE 6.0 (5 min) Q&A (5 min)",
    "language": "en",
    "speakers": [
      {
        "name": "Rikard Thulin",
        "biography": "Rikard Thulin is a Senior Software Engineer at IBS JavaSolutions. Rikard is one of the lead persons for the Java User Group in Gotenburg, JavaFroum. In a previous life, Rikard worked as a Java Architect at Sun Microsystems. Rikard holds a M.S. in Software Engineering."
      },
      {
        "name": "Peter Lindh",
        "biography": "Peter Lindh is a senior developer and technical architect at IBS JavaSolutions, a company specialized in Java/JEE mentoring, education and consultant services. Peter has over the years most been seen designing/implementing business critical, transaction intensive software on the JEE platform. Peter holds most professional certifications worth mentioning;-)"
      }
    ],
    "year": 2006
  },
  {
    "title": "Our stuff, your way - Developing Microsoft .NET applications with \"Java\" frameworks",
    "level": "beginner",
    "summary": "The session will introduce Java developers to the Microsoft .NET port of the popular framework Spring, and show how they can leverage their Spring experiences to develop enterprise grade .NET applications. The session also touches on .NET implementations of Hibernate and iBatis.",
    "description": "Why Java developers should care. A swift comparison of C# 2.0 and Java 5. Introducing Spring.NET An overview of Spring.NET Key differences between Spring and Spring.NET A well-known demo in an unknown environment – MovieFinder.NET Developing ASP.NET applications with Spring.Web Data access with Spring.NET and NHibernate Developing Windows Services with Spring.Services Connect the dots – A walkthrough of the SpringAir reference application Spring.Core Spring.AOP Spring.Data.Ado Spring.Data.Ibatis Spring.Web",
    "language": "en",
    "speakers": [
      {
        "name": "Anders Norås",
        "biography": "Solution Architect ( Objectware ) Anders Norås is a solutions architect working for Objectware (www.objectware.no) He has ten years of experience developing web applications using both Java and Microsoft technologies. His blog can be read at http://dotnetjunkies.com/weblog/anoras/"
      }
    ],
    "year": 2006
  },
  {
    "title": "Software Visualization and Model Generation",
    "level": "intermediate",
    "summary": "Models are often viewed as something you create during design time and use to generate code. What if we turn the approach upside-down and generate models from code? Humans are very good at recognizing patterns in images, making visualizations a valuable tool to, for example, recognize dependencies or data flow. This is particularly true for dynamic, loosely coupled systems that are often less explicit and evolve over time. Once you have generated a model you can take things a step further and run checks and validations against it. Visualizations can also be used to plot out source code metrics over various dimensions to detect potential “hot spots” in the application that may require special attention.",
    "description": "This session applies the concepts of visualization and model generation to a broad range of usage scenarios, such as asynchronous messaging, software components and object-oriented applications.",
    "language": "en",
    "speakers": [
      {
        "name": "Erik Doernenburg",
        "biography": "senior developer and architect ( ThoughtWorks ) Erik Doernenburg is a senior developer and architect at ThoughtWorks where he is helping clients with the design and implementation of large-scale enterprise solutions. Based on his experience with J2EE, Microsoft .NET and other environments, Erik is continually exploring new patterns of enterprise software. Erik has been an advocate of agile, test-driven, object-oriented development and Open Source software for many years."
      },
      {
        "name": "Gregor Hohpe",
        "biography": "Software engineer Gregor Hohpe is a software architect with Google, Inc. Gregor is a widely recognized thought leader on asynchronous messaging and service-oriented architectures. He co-authored the seminal book \"Enterprise Integration Patterns and speaks regularly at technical conferences around the world. Find out more about his work at www.eaipatterns.com."
      }
    ],
    "year": 2006
  },
  {
    "title": "Fly by Wire",
    "level": "beginner-intermediate",
    "summary": "Quite often when teams are faced with the pressure of dealing with poor performance, the first instinct is to revert to those development techniques that are all so like your favorite pair of slippers. The problem is, it is almost impossible to diagnose a performance problem using static analysis of the code. To be successful (rather then lucky) one must be able to acquire dynamic data from the runtime and then be able to understand what that data is telling them. This talk will dive into how one can instrument J2EE/J2SE applications to diagnose performance problems. But since power point slides are cheap, we will minimize time looking at them in favor of spending more time solving performance problems together.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Kirk Pepperdine",
        "biography": "Kirk Pepperdine has more than 10 years of experience in OO technologies. In edition to his work in the area of performance tuning, Kirk has focused on building middleware for distributed applications."
      }
    ],
    "year": 2006
  },
  {
    "title": "Simplifying enterprise applications with Spring 2.0 and AOP",
    "level": "intermediate",
    "summary": "In this session Rod Johnson will describe the new AOP support in Spring 2.0, how it integrates with AspectJ, and how it fits in the construction of enterprise applications. Using an example-driven approach, attendees will learn how to simplify the implementation of many common enterprise application requirements. The way you think about software may never be the same again... In this session Adrian Colyer will describe the new AOP support in Spring 2.0, how it integrates with AspectJ, and how it fits in the construction of enterprise applications. Using an example-driven approach, attendees will learn how to simplify the implementation of many common enterprise application requirements. The way you think about software may never be the same again...",
    "description": "<TBD>",
    "language": "en",
    "speakers": [
      {
        "name": "Rod Johnson",
        "biography": "Father of Spring Framework ( Interface21 ) Rod is the father of Spring. The Spring Framework open source project began in February 2003, based on the Interface21 framework published with Rod's best-selling Expert One-on-One J2EE Design and Development. Rod is one of the world's leading authorities on Java and J2EE development. He is a best-selling author, experienced consultant, and open source developer, as well as a popular conference speaker. Rod's best-selling Expert One-on-One J2EE Design and Development (2002) was one of the most influential books ever published on J2EE. The sequel, J2EE without EJB (July 2004, with Juergen Hoeller), has proven almost equally significant, establishing a comprehensive vision for lightweight, post-EJB J2EE development. Rod has extensive experience as a consultant in a wide range of industries: principally, finance, media and insurance. He has specialized in server-side Java development since 1996. Prior to that, he worked mainly in C and C++. His experience as a consultant has led him to see problems from a client's perspective as well as a technology perspective, and has driven his influential criticism of bloated, inefficient, orthodox approaches to J2EE architecture, which have delivered very poor results for stakeholders. Rod is the founder of the Spring Framework, which began from code published with Expert One-on-One J2EE Design and Development. Along with Juergen Hoeller, he continues to lead the development of Spring. He regularly speaks at conferences in the US, Europe and Asia, including the ServerSide Symposium (2003, 2004 and 2005), JavaPolis (Europe's leading Java conference), and JAOO (2004). Engagements in 2005 include two presentations at JavaOne 2005 and a keynote at the JavaWorld 2005 conference (Tokyo, June). Rod serves in the JCP on the Expert Groups defining the Servlet 2.4 and JDO 2.0 specifications. Rod continues to be actively involved in client projects at Interface21, as well as Spring development, writing and evangelism."
      }
    ],
    "year": 2006
  },
  {
    "title": "First Aid for Swing",
    "level": "beginner",
    "summary": "This session describes how to build a Swing application that looks good and works well. It presents the most critical Dont's things you should avoid and the most important Dos - guidelines you should follow. You learn about easy steps for improving the appearance of your visual design and how to compete with or outperform decent native desktop applications. Several examples of good and poor design demonstrate the effect of the techniques described in this session.",
    "description": "Introduction Presentation Goal Agenda The problems we face 10 Steps to improve your UI Focus of this talk Don'ts Principles Colors, Fonts, Icons Dos Clutter Reduce to its essence Special Swing problems Negative space Align,group, relate, balance Consistency, aspect ratios, contrast Scaling with font, resolution Tips & Tricks Looks&Feels Advanced layout issues Responsiveness, application startup Performance The power of the Java Foundation Classes Before & After Examples Summary & References Summary References: libraries, projects, articles, books Questions & Answers Required experience Basic Swing experience Expected audience Everyone interested in improving a Swing UI. The attendee will learn simple techniques for improving his Swing design.",
    "language": "en",
    "speakers": [
      {
        "name": "Karsten Lentzsch",
        "biography": "( JGoodies ) As architect and designer of Java tools, demos and several professional Swing libraries, Karsten Lentzsch is considered a leading expert in Java user interface technology and pluggable look&feel. He brings a wealth of experience in designing usable and elegant Java application to JGoodies. For over 15 years Karsten has been involved in object technologies and user interface design as a consultant, trainer, architect and expert developer. Since adopting Java programming early in 1997 he has designed and developed stand-alone applications, application frameworks, Java libraries and enhancements to the Java look. He publishes articles about Java UI topics and talks at major Java conferences."
      }
    ],
    "year": 2006
  },
  {
    "title": "Filthy Rich Clients",
    "level": "intermediate",
    "summary": "Animation and whizzy graphical effects can be totally gratuitous, but they can also be used to make applications more effective and users more productive. This session examines fundamentals of timing and animation and shows techniques for implementing cool effects on Swing components. It also discusses recent advances in combining 2-D and 3-D effects in the Java™ Platform, Special Edition (Java SE) 6 (\"Mustang\") release.",
    "description": "Fundamentals of animated Swing effects (20 minutes) timing component animation animated transitions Advanced demos and custom effects (15 minutes) Combining 2D and 3D with the OpenGL bindings (15 minutes) Overflow/Q&A (10 minutes) Required experience Attendees must be familiar with Java/Swing GUI development. Knowing how to create a custom component is a plus. Expected audience This session is meant for all developers that have to write rich clients. With the uprising of advanced rendering effects and animations in modern operating systems (Windows Vista and MacOS X.) The goal of this talk is to teach how to achieve the same results effectively with Java/Swing. Attendees will learn how to improve the user experience by providing richer user interfaces.",
    "language": "en",
    "speakers": [
      {
        "name": "Romain Guy",
        "biography": "Romain Guy: Romain has been working with Swing since 1998 and recently joined the Swing engineering team at Sun Microsystems. His main interests are rich clients design and development. Romain spends as much time as possible writing demos and applications that show the power of Java user interfaces. Past experience include talks at JavaOne and JavaPolis."
      }
    ],
    "year": 2006
  },
  {
    "title": "Java DB: A small, easy to use, pure Java RDBMS",
    "level": "intermediate",
    "summary": "Java DB is Sun Microsystems branding of the Apache Derby database (http://db.apache.org/derby). Java DB is a pure Java, small footprint, easy to use relational database engine.",
    "description": "Part I: Java DB overview What is Java DB: Open source Apache project, pure Java, small footprint History from Cloudscape via IBM & Informix, to Apache Derby and Java DB Java DB features Implemented features, standards, platforms, security Client/server vs. embedded Java DB Java DB performance Java DB compared to other open source databases Java DB bottlenecks and tuning Java DB architecture The architectural structure of Java DB the basic principles of the database engine Java DB future Where to go from here Planned (and not-so-planned) new features Part II: Java DB usage Embedded Java DB Java DB embedded in small applications \"Database-on-a-jar\" - Java DB read-only database in a zip/jar-file. \"Database-on-a-stick\" - Java DB on e.g. a memory-stick Server Java DB Normal Client/Server operations Combined embedded and server usage Scaling How Java DB scales Horizontal scaling with e.g Sequoia (C-JDBC) HA Java DB Java DB high availability with Sequoia How is this compared to a real HA solution In-memory Java DB What is meant by \"in-memory\"? Speed or no durability? Comparision to e.g. HSQLDB Q&A Approx 45 minutes + Q&A",
    "language": "en",
    "speakers": [
      {
        "name": "Bernt M. Johnsen",
        "biography": "Staff Engineer ( Sun Microsystems ) Bernt M. Johnsen is Staff Engineer at Sun Microsystems' Database Technology Group in Trondheim, Norway. He joined Clustra (which developed a high availability distributed database) in 2000. At Clustra he was architect for distributed SQL execution and project leader for Clustra's JDBC driver. Clustra was acquired by Sun in 2002 and the database renamed to HADB. At Sun he was architect for HADB distributed management system. Earlier experience includes expert systems, compilers, internet protocols and he also pioneered Internet bank services in the late 1990s."
      }
    ],
    "year": 2006
  },
  {
    "title": "@OP - Aspect Oriented Programming and Metadata",
    "level": "intermediate",
    "summary": "This talk will investigate how metadata, and in particular the annotation support introduced in Java 5, can be combined with aspect oriented programming. Used carefully the combination can be both powerful and interesting.",
    "description": "AOP in 4 minutes. Pros and cons with signature based join points. Introducing annotations. Pros and cons with annotation based join points. @OP example application. Summary and some final thoughts on @OP. Q&A Required experience Experience with object oriented programming. Expected audience Anyone interested in AOP.",
    "language": "en",
    "speakers": [
      {
        "name": "Yngvar Sørensen",
        "biography": "Bouvet ( Bouvet ) Yngvar currently works as a consultant for Bouvet AS with Java experience since 1997. His primary fields of interests within the Java sphere are AOP and UI development, especially the combination of the two. In the past he has held talks on these subjects for javaBin as well as workshops and courses with customers across the country."
      }
    ],
    "year": 2006
  },
  {
    "title": "Hvordan få til ORM med god ytelse?",
    "level": "intermediate",
    "summary": "De siste årene er bruk av Object-Relational Mapping-verktøy som Hibernate, TopLink og JDO blitt stadig mer populært. Dette er blitt enda mer aktuelt med Java Persistens API som er kommet som en del av EJB3.0, samtidig som at det er et felt som lett blir undervurdert. I dette foredraget vil man få lære hvilken innvirkning ORM-teknologi har på arkitekturen og få se mer av hva som skjer i bakgrunnen når man benytter ORM for persistens og hvilken innflytelse dette kan ha på ytelsen. Jeg vil først ta utgangspunkt i de fundamentale forskjellene mellom Java- og database-teknologi, både fra et teknisk og organisatorisk perspektiv for å se hvilke utfordringer man står ovenfor. Jeg vil deretter se kort på forskjellige metoder for å implementere persistens, både for å vise hva dette valget gjør med arkitekturen og spesielt hvordan valg av ORM skiller seg fra andre teknikker. Deretter vil jeg se nærmere på hvilken innflytelse forskjellige implementasjoner av arv, lesing av objekter med lazy-loading og caching har på ytelsen. I tillegg vil jeg også bruke en del tid på n+1-queries problemet og forskjellige måter å håndtere dette på da dette illustrerer mange av de utfordringene man møter ved bruk av ORM-teknologi Foredraget vil ikke basere seg på et spesifikt ORM-produkt men fokusere på hva som skjer i kulissene og hva slags SQL som faktisk kjøres, hvilket er felles for de fleste produkter. Til slutt vil jeg også se på tilfeller hvor ORM kan komme til kort og hvor andre alternativer kan passe bedre.",
    "description": "Outline Utfordringer med persistens, The Object-Relational impedance mismatch (5 min) Tekniske Organisatoriske Tre forskjellige typer design for persistenslaget (5 min) Vanlig JDBC Lagrede prosedyrer Object Relational Mapping ORM-implementasjonsteknikker (10 min) Lazy-loading Arv ORM-tuning (15 min) Caching N+1-queries problemet, et lite eksempel og hvordan det kan løses Projeksjoner Skriving (5 min) Minimering av skriving til basen Utnyttelse av databasen (5 min) Når bør man vurdere andre alternativer? (5 min)",
    "language": "no",
    "speakers": [
      {
        "name": "Bjørn Vidar Bøe",
        "biography": "Seniorkonsulent ( Objectware ) Bjørn jobber som seniorkonsulent hos Objectware, jobber til daglig med J2EE-basert utvikling. I det siste har han hatt fokus på tjenestebasert utvikling med produkter og teknologier som Spring, AOP og TopLink og han har også holdt foredrag på JavaZone i 2003 og 2005."
      }
    ],
    "year": 2006
  },
  {
    "title": "Using Maven Effectively",
    "level": "intermediate-advanced",
    "summary": "This tutorial is designed for those familiar with Maven who wish to make the most of Maven in a team collaboration environment. A brief overview of Maven will be provided before digging into some advanced uses of Maven in the context of team development, and how to leverage related Maven technologies to help with team development.",
    "description": "In this session you will learn: How Maven helps teams to collaborate more effectively How to set up consistent developer environments How to setup Continuum for team continuous integration We currently do not have an outline for the talk, but will make one in the next few days. Duration: 5 minutes Main part: 55 minutes. Given the practical nature of this talk we assume most questions will come while talking so we won't make a particular long A&Q session in the end. Language: English. Required experience: Knowledge of Maven required. Expected audience: This talk is suited for developer of all experience levels and project managers who manage teams of developers. It will benefint everyone who's involved in a the day to day operations of a development team.",
    "language": "en",
    "speakers": [
      {
        "name": "Jason van Zyl",
        "biography": "Founder of the Apache Maven project ( Mergere ) Jason van Zyl is the founder of the Apache Maven project and currently serves as the chair of its PMC. Jason is a co-founder of Mergere whose aim is to to promote the use of Maven technologies in the Enterprise. Jason currently serves as the Chief Architect at Mergere."
      },
      {
        "name": "Trygve Laugstøl",
        "biography": "Trygvis ( Objectware AS )"
      }
    ],
    "year": 2006
  },
  {
    "title": "Test Driving Swing Apps",
    "level": "beginner-intermediate",
    "summary": "Client side applications are notoriously difficult to test, with many of the traditional approaches leveraging screen scraping techniques resulting in both brittle and costly tests. There are a number of alternative ways of testing Swing GUIs, and we will be looking at one of these that make testing Swing applications easier and more reliable. We will investigate how you can apply this testing technique for TDDing an entire Swing application that will be both robust and reliable. We will look at how you write acceptance level tests and the patterns that you could implement in a swing application that allows you to fully test all the components before you get an acceptance test passing. We will demonstrate the robustness of tests by demonstrating how you can changing the way the components are laid out without breaking tests. We will also discuss all the difficulties, tips and tricks that you should be aware when you do decide to write tests for your application.",
    "description": "Introduction Overview of TDDing 5 minutes Writing Acceptance Tests Live demonstration of how you go about writing an acceptance test and watching it fail 5 minutes Structuring Swing Applications Talking about the different parts that make up the Swing application and how they interact, highlighting the way that they get used 10 minutes Implementing Acceptance Test Live code demonstration as we add more unit tests and code to get the acceptance test passing 10 minutes Robustness Demonstration Changing the layout of a component without breaking a test 10 minutes Top Tips Discussing all the things to be aware of including threading, timing, how you can test drag and drop, double clicking, modal dialog boxes, resizing, etc 10 minutes Questions and Answers 10 minutes",
    "language": "en",
    "speakers": [
      {
        "name": "Patrick Kua",
        "biography": "Agile Coach ( Thoughtworks ) Patrick is a budding agile coach and hardcore agile developer who is currently working for Thoughtworks, a software development consultancy. He is driven by lightweight methods of delivery that means his team gets to write more code more often that delivers greater value. He is a big believer in self-empowered teams and achieves this by continually spreading the word about better ways of writing software. He believes Dependency Injection is an effective technique that leads to software that is more understandable by getting people focusing on objects and how they interact instead of simply writing code."
      }
    ],
    "year": 2006
  },
  {
    "title": "Early Detection of Java Memory Management Problems",
    "level": "beginner-intermediate",
    "summary": "Memory management problems in object oriented programming languages are so serious that Java provides automatic garbage collection. Unfortunately problems of efficiency and space leaks remain. Early detection of these is vital but is complicated by the fact that these problems often do not show unless a program is run for an extended time which can happen after testing occurs. This paper considers what tools a Java programmer can use to monitor memory use and detect problems as early as possible.",
    "description": "Time Introduction - what the problems are and why early detection is important - 10 minutes How to detect Memory management problems in a language like Java which does not give the programmer access to the garbage collector - 40 minutes Conclusions - 10 minutes Questions - 10 minutes",
    "language": "en",
    "speakers": [
      {
        "name": "Dr. Averil Meehan",
        "biography": "Lecturer at Letterkenny Institute of Technology in Ireland and PhD in the area of memory management of Object Oriented Programming Languages ( Letterkenny Institute of Technology ) A lecturer at Letterkenny Institute of Technology in Ireland, Dr Averil Meehan teaches Programming and Distributed Systems at undergraduate level as well as supervising MSc students. She has a PhD in the area of memory management of Object Oriented Programming Languages."
      }
    ],
    "year": 2006
  },
  {
    "title": "Creating Professional Swing UIs Using NetBeans™ GUI Builder (Formerly Code-Named \"Matisse\")",
    "level": "intermediate",
    "summary": "The NetBeans™ 5.0 IDE introduced a next-generation GUI builder tool that radically simplifies layout design of Swing based-GUIs. It has never been easier to design professional UIs that can run on various platforms, be translated to different languages, look good, and behave consistently. All that without the usual need of fighting with layout managers. In this presentation, the developers of the NetBeans GUI Builder (formerly code-named \"Matisse\") take you through a tour of the GUI builder, demoing and explaining main features, and focusing on how to solve typical UI design problems. The session presents various tips and tricks for layout design and effective use of the Swing in a GUI builder. See how to internationalize the UI, how to use custom components, and more. Learn from the experts about the main principles of cross-platform UI design, UI guidelines in layout, comparison of various approaches and design styles, and typical mistakes to avoid. Last but not least, the Matisse authors reveal some new things being prepared for the next release and ideas about the future of the GUI builders field. Overall, the presentation provides a solid theoretical and practical basis for anyone who needs to quickly create a good-looking Swing UI that just works. The session requires a basic level of prior experience in programming Swing GUIs and using GUI builder tools.",
    "description": "1. A tour of the GUI builder -- Demoing and explaining main features -- Focusing on how to solve typical UI design problems -- Various tips and tricks for layout design and effective use of the Swing in a GUI builder. 2. How to internationalize the UI, 3. How to use custom components 4. New things being prepared for the next release 5. 15 Minute Demo: JFugue Music Application Built with the Matisse GUI Builder",
    "language": "en",
    "speakers": [
      {
        "name": "Geertjan Wielenga",
        "biography": "Technical Writer for Sun Microsystems on the NetBeans project ( Sun Microsystems ) Geertjan Wielenga has been a software technical writer for the past 10 years, working mainly on rapid application development and IDE's, currently on NetBeans, but previously on UNIFACE by Compuware and SuperNova by the now-defunct Four Seasons Software. He works for Sun Microsystems as a Technical Writer on the NetBeans project."
      }
    ],
    "year": 2006
  },
  {
    "title": "Java Specialists in Action",
    "level": "intermediate",
    "summary": "Java allows the experienced developer to write highly flexible code, especially when using dynamic features like proxies and references. In this talk, we bring these together with generics and enums. We will demonstrate some approaches of using Java's dynamic proxies to create virtual proxies, protection proxies, dynamic object adapters and dynamic decorators. A part of the talk will also explore the performance implications and compare it with the benefits gained. P.S. If you are wondering why \"enum\" is listed under \"advanced features\" you should definitely attend this talk.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Dr. Heinz M. Kabutz",
        "biography": "Part-owner of Maximum Solutions ( Maximum Solutions ) Heinz is a well-known contributor to the Java community through his Java Specialists Newsletter. Recently, he was chosen as a Java Champion. Heinz is part-owner of Maximum Solutions, a company specialising in Java software development and Java specialist training. Kabutz has worked on several large Java applications since 1997 (ranging from ½ to 1 million lines of Java code). He uses the experience gained \"in the field\" to write articles in his publication \"The Java™ Specialists' Newsletter\", which is read by thousands of Java Specialists in over 100 countries. In the newsletter, Kabutz explored topics such as reflection, Swing, patterns, dynamic proxies and the new features of JDK 5.0."
      }
    ],
    "year": 2006
  },
  {
    "title": "Developing in a Service-Oriented World",
    "level": "beginner-intermediate",
    "summary": "The software development community is at an interesting inflection point. Distributed and interconnected systems are becoming the norm for new development efforts to the extent that the word \"application\" itself might have to be redefined. Loosely coupled solutions, such as Service-Oriented Architectures, enable independent variability and evolution of components. While many of the architectural benefits of SOA have been belabored over and over we are often kept wondering what it means for developers to code in a service-oriented environment. Will business analysts wire together components in visual tools and make developers obsolete? What kind of new tools should we expect to see? Are there new patterns and guidelines to follow? How can you get ready?",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Gregor Hohpe",
        "biography": "Software engineer Gregor Hohpe is a software architect with Google, Inc. Gregor is a widely recognized thought leader on asynchronous messaging and service-oriented architectures. He co-authored the seminal book \"Enterprise Integration Patterns and speaks regularly at technical conferences around the world. Find out more about his work at www.eaipatterns.com."
      }
    ],
    "year": 2006
  },
  {
    "title": "Building Reliable and High Performance Messaging Applications with POJOs and Apache ActiveMQ",
    "level": "intermediate-advanced",
    "summary": "The use of messaging and SEDA (http://www.eecs.harvard.edu/~mdw/proj/seda/ ) are excellent tools for building reliable distributed, loosely coupled applications for high performance computing. This session will give a brief overview of the concepts involved in messaging then show how to to use JMS and POJOs to build distributed applications which scale to meet your requirements. We will then go through some advanced topics using ActiveMQ, the open source message broker, such as load balancing, clustering & high availability, pooling, XA and how to use clients in both Java, C# and Ruby.",
    "description": "In this session, you will learn: • A brief overview of the concepts involved in messaging; • How to to use JMS and POJOs to build distributed applications which scale to meet your requirements; • Some advanced topics using ActiveMQ, the open source message broker, such as load balancing, clustering & high availability, pooling, XA and how to use clients in both Java, C# and Ruby.",
    "language": "en",
    "speakers": [
      {
        "name": "James Strachan",
        "biography": "Chieft Architect and co-founder of LogicBlaze, Co-Founder of Apache Geronimo, JSR 241 Spec Lead, JCP expert group member (JSR 52, 107, 127, 152, 174, 208, and 223) ( LogicBlaze ) James is the Chief Architect and co-founder of LogicBlaze. James co-founded LogicBlaze to deliver an open source-based Enterprise Transaction Platform for distributed organizations requiring secure, high-performance messaging, cache and cluster management solutions. Before founding LogicBlaze, James spent more than 20 years in enterprise software development. He has specialized in work for both financial institutions, including leading firms such as JPMorgan Chase, Nomura Research Institute, and Dresdner Bank, for middleware providers such NEON. Previously, James founded SpiritSoft, Inc., a company providing Enterprise Java middleware services. James is heavily involved in the open source community: he was one of the founders of the Apache Geronimo project (Apache's J2EE container), ActiveMQ, and Groovy and a number of other open source projects including dom4j, jaxen and Jelly. He currently serves as a member of the Apache project, and is an active committer on a variety of leading open source projects including Spring, Maven and Jakarta Commons. James also holds the role of Specifications lead on JSR 241 and sits on a number of other JCP expert groups including JSR 52, 107, 127, 152, 174, 208, and 223."
      }
    ],
    "year": 2006
  },
  {
    "title": "Java/Ruby integration",
    "level": "intermediate",
    "summary": "The Ruby platform is growing nearly exponentially. We'll look at bridging technologies, including: 1) Ruby on Rails web services. Build your user interfaces in Ruby on Rails, and your object models in Java. Take advantage of the excellent AJAX support and the clearest, cleanest web development environment around, without losing the Java features that are most important to you. 2) JRuby, the Ruby virtual machine that's implemented on Java. With it, you can use first class scripting language to do your scripting for things like web pages, business rules integration, and simple scripting extensions. 3) Ruby/Java bridges. Use tactical XML/RMI to communicate between Java and Ruby.",
    "description": "JRuby: 20 minutes Rails web services: 20 minutes Java to Ruby bridges: 10 minutes",
    "language": "en",
    "speakers": [
      {
        "name": "Bruce Tate",
        "biography": "President, J2Life, LLC ( J2Life, LLC ) Bruce Tate is a fifteen year veteran of the information technology profession. He has delighted hundreds of customers in a variety of roles from Internet development, to database performance and design sessions. He has served as CTO of two startups and also served as lead architect of various organizations. At IBM, Bruce filled a variety of roles, including Java proof of concept work, Java architectures, national sales and support, object oriented systems programming and database systems programming. He served on the certification board for the I/T profession, and has been a leader throughout his career. Bruce is named on eight IBM patents. As an independent consultant, Bruce is the author of five books, including the best-selling Bitter Java and Better, Faster, Lighter Java. He is the founder and principle author and editor for Manning's Bitter series. Bruce speaks at a variety of conferences and users groups spanning North America. Bruce is a strong persistence expert, a proven performance analyst, an adept architect and facilitator, and an excellent communicator. This makes him an outstanding choice for public speaking, performance analysis, design reviews and a wide variety of other engagements."
      }
    ],
    "year": 2006
  },
  {
    "title": "Caching and Grid in a Nutshell. An overview of caching and grid products with case studies",
    "level": "intermediate",
    "summary": "This session covers application design and development in distributed and high performance environments, in particular John will contrast and compare some of today's caching and grid technologies providing real-life use-cases. Rather than bake one technology off against the other John aims to demonstrate their unique benefits and show that, in many cases, they actually compliment each other. Grid and caching have evolved around the needs of high performance, large volumes, low latency and complex data, messages today are orders of magnitude more complex than 20 years ago, volumes are on a global scale and we need everything through in increasingly shorter time scales. From his perspective of the banking world John will demonstrate processing of complex financial derivatives through several vendor products; Modelling and Java Binding with C24's Integration Objects, High performance Web Services and a distributed ESB with IONA's Artix, eliminating the database with Tangosol's Coherence and distributed High Performance Computing with GigaSpaces.",
    "description": "Agenda Introduction Primer to the needs of the banking world Case Studies (code & demo) o Message complexity and modelling o Integration, EAI, SOA and ESBs o Data Caching o High Performance Computing Q&A",
    "language": "en",
    "speakers": [
      {
        "name": "John Davies",
        "biography": "CTO ( C24 ) John is CTO and co-founder of C24. Founded in 2000, C24 hit the market a year later with an innovated Java-binding technology for financial services messaging standards. Integration Objects (IO) can generate Java code for almost every financial services messaging standard, from FpML (including validation rules) to SWIFT. It's unique niche in the market has seen it OEM'd by many of the leading middleware, messaging and application server vendors. The largest clients now feed over $500million of trades a day through the code, the fastest process thousands of messages second. The wide coverage of C24-IO has given John a unique view into the internals of many of the world leading financial institutions. John has nearly 20 years in Investment Banking and over 25 years in IT, mostly as a consultant. He has co-authored several books on Java and J2EE, was the author of Learning Tree's distributed Java course and a regular speaker on grid, Jini and JavaSpaces in the Java and banking world. Over the years John has held more than one high-profile position as Head of Technical Architect in banks such as JPMorgan."
      }
    ],
    "year": 2006
  },
  {
    "title": "Interoperability",
    "level": "intermediate-advanced",
    "summary": "Interoperability in software, systems and technologies is seen in the marketplace as important as security and reliability. At Microsoft, interoperability is now a core part of our initiatives to make computing more trustworthy. We believe, that interoperability is achieved by design, collaboration and standards. Interoperability based on standards is just one part of a bigger picture, the whole story goes well beyond that: it is about business (processes) and people, and the needs of both suggest how IT should behave. We will discuss an architectural case that provides some evidence for this holistic perspective on interoperability. And of course we’ll give an overview of some interoperability work in core technology areas that are of interest to the Java community (e.g. WS- , SOA, Open XML vs. ODF etc).",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Jürgen Pfeifer",
        "biography": "Architect Evangelist ( Microsoft ) Jürgen Pfeifer won his first programming award 1976 for a geographical survey solution he developed during his military service. Since then his passion is software. He worked as a systems engineer for Data General and Digital Equipment on their systems (AOS/VS and VMS) and started to work there with UNIX and Internet technologies in the mid-80ies. He finally worked there as project lead for large customer middleware projects. For a long time he worked as development engineer and later as architect for Software AG. There he worked on mainframes, UNIX, and Windows platforms, and architected middleware software that runs on all these platforms. He eventually became lead architect for large parts of their ENTIRE middleware technology, member of their internal architect council, and finally heads a team of architects to research a new generation of application development platform. He was also involved as architect in the initial design of the “TAMINO” XML database. In the late 90ies he joined Deutsche Bank and became an architect and project lead for their Internet payment technologies. In 1999 he joined Microsoft as a Principal Consultant, and since 2001 he is an Architect Evangelist in the Developer & Platform Evangelism group. In November 2005 he achieved the Microsoft Certified Architect credential. He graduated from the Heinrich-Heine-University in Düsseldorf (Germany) with a masters degree (“Diplom”) in mathematics and biology."
      }
    ],
    "year": 2006
  },
  {
    "title": "Nutch Nutch, Wink Wink",
    "level": "advanced",
    "summary": "This talk will give a detailed presentation of large-scale searching, using Nutch as an example. Large-scale searching involves various challenges, such as: Retrieving large amounts of data, keeping changing indexes up to date, and supporting many simultaneous searches. Nutch is based on the search API Lucene, but adds functionality for parallel searching, distributed storage, advanced web crawling and file format parsing.",
    "description": "The basics of the Nutch architecture (5 min) How to perform file crawling (5 min) How to perform crawling (10 min) Parallel searches: Making it work. Gotchas. (15 min) Summary and experiences: Things to keep in mind (15 min) Q&A (10 min) Required experience: A good understanding of search engines Expected audience: People interested in Nutch, or in performing large-scale searching",
    "language": "en",
    "speakers": [
      {
        "name": "Kristoffer Dyrkorn",
        "biography": "Kristoffer Dyrkorn is a Manager at Bekk Consulting. He has developed Java-based applications since 1997 and usually works as a systems developer, architect or project manager. The latest years he has focussed on search engines and on how to utilise technology to give users better functionality."
      }
    ],
    "year": 2006
  },
  {
    "title": "Memory Leaks in Java™ Applications: Different Tools for Different Types of Leaks.",
    "level": "intermediate",
    "summary": "Not all memory leaks are the same. Some eat away at memory slowly over time. Others grab huge chunks of memory all at once. What is common for most of them is that they ultimately cause the virtual machine's heap to run out of space. A large variety of tools provides a high-level view of a Java™ application's memory usage, but not all of them are appropriate for doing the detailed analysis needed to find the cause of a memory leak. Depending on the type of memory leak, some tools are more appropriate than others. This BOF session examines some of the tools and techniques available and uses example memory leaks from real-world Java applications.",
    "description": "The presentation shows how to track down a memory leak where multiple object instances of the same class are created over time, some of which are the source of a leak and others of which are not. It also examines how to debug a memory leak where only a single object instance is the source of the problem. Each of these examples involves a brief examination of the source code and a demonstration using a monitoring/profiling tool. Comparisons are done between the two different situations and the capabilities of the different tools. 1. The easy part: watching the heap and learning you have a problem (15 minutes) 1.1 JVM Command line parameters and associated tools 1.2 VisualGC 1.3 JConsole and other JDK tools 2. A huge object taking up heap space (15 minutes) 2.1 Sample application description 2.2 Heap walking: how to's and what to watch out for 2.3 Using a heap walker to track down the problem 3. A slow death: a small leak that adds up over time (15 minutes) 3.1 Sample application description 3.2 A statistical approach to memory leak detection: pros and cons 3.3 Using a statistical approach to track down a small leak 4. Q&A/Discussion (15 minutes)",
    "language": "en",
    "speakers": [
      {
        "name": "Gregg Sporar",
        "biography": "Technical Evangelist ( Sun Microsystems ) Gregg Sporar has been a software developer for over twenty years, working on projects ranging from control software for a burglar alarm to 3D graphical user interfaces. He has been using Java since 1998 and his interests include user interfaces, development tools, and performance profiling. He works for Sun Microsystems as a Technical Evangelist on the NetBeans project."
      }
    ],
    "year": 2006
  },
  {
    "title": "EJB3 Java Persistence API: The Good, The Bad, and The Ugly",
    "level": "intermediate-advanced",
    "summary": "The upcoming EJB3 Java Persistence API (JPA) is the successor to the oft-lambasted EJB2 container-managed persistence entity bean model. How well does it meet its goals? Will it get a better reception than its predecessors? In this talk, Patrick Linskey (EJB team lead at BEA, member of the EJB expert group and standards-based persistence evangelist) discusses his thoughts about the best and the worst of the JPA. Patrick categorizes key features (and missing features) as good, bad, or just plain ugly. Come get a glimpse of what's coming to a JVM near you, and hear Patrick's predictions about upcoming best practices and antipatterns.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Patrick Linskey",
        "biography": "Patrick Linskey has been involved in object/relational mapping for 5+ years. As the founder and CTO of SolarMetric, Patrick drove the technical direction of the company and oversaw the development of Kodo. Now at BEA, he leads the EJB team in designing and implementation of the WebLogic Server EJB solution. Patrick is one of the leaders on the EJB3 and the JDO specification teams, and is BEA's representative on the EJB3 expert group. Patrick is involved in several industry consortia, serving as a luminary on JDOcentral and as the moderator on forthcoming JavaPersistence.com. He has been the face of standards-based persistence, having evangelized JDO and EJB Persistence in hundreds of talks throughout the world. Patrick is co-author of Bitter EJB, and is on the JAOO Conference Program Committee. Patrick has also worked for TechTrader, MIT's Media Lab and Bank One in various technical roles. Under Patrick's leadership, Kodo has become the market leading JDO implementation with over 350 customers throughout the world spanning all industries, and is now the basis for the WebLogic Server EJB persistence provider. Patrick holds a B.S. in Computer Science from the Massachusetts Institute of Technology."
      }
    ],
    "year": 2006
  },
  {
    "title": "Developing Document-driven Web services with Spring-WS",
    "level": "intermediate-advanced",
    "summary": " Spring Web services (Spring-WS) is a new product from the Spring community that aims to help developing document-driven Web services. In this talk, we will describe the difference between RPC and document-driven Web services, and show that most document-driven Web services are actually RPC in disguise! Additionally, we will show how to implement the following features using Spring-WS: Validating requests and responses the difference between SOAP vs. REST XML Marshalling with Castor, JAXB, JiBX and others Binding domain objects to incoming and outgoing Web service messages Besides showing how to implement these features, we also talk about the possible dangers of them.",
    "description": "After a brief introduction and agenda, we talk about the properties of RPC-based en document-based Web services. We will investigate how these latter services can be built in Spring-WS, and shortly describe what the advantages and disadvantages are to a RPC-approach. Next, we cover the aforementioned list of features: we investigate the worth of each item, and how it can be implemented with Spring-WS. Required experience: Knowledge of XML en SOAP required; Spring knowledge useful Expected audience: Spring users, Web service developers",
    "language": "en",
    "speakers": [
      {
        "name": "Arjen Poutsma",
        "biography": "( Interface21 ) Arjen Poutsma is a senior enterprise application architect with more than ten years of experience in commercial software environments. During these years, he has used both J2EE and Microsoft .NET. Three years ago, he started to specialize on Web Services and Service Oriented Architectures. In this period, he has conducted trainings, and has researched SOAs in large organizations. Arjen is the founder and the lead for the Spring Web Services project. This Spring project aims at facilitating development of document-driven Web services. Additionally, Arjen has contributed to various other open source projects, including XFire, NEO, and others. Since early 2005, Arjen is a consultant for Interface21 in The Netherlands. You can find his blog at blog.interface21.com/arjen."
      }
    ],
    "year": 2006
  },
  {
    "title": "The Essential Lessons of Distributed Caching",
    "level": "intermediate",
    "summary": "This session covers application development considerations for achieving maximum scalable performance and reliability in clustered Java Platform, Enterprise Edition (Java EE) environments, improving the scalability and scalable performance of applications through the use of clustered caching to reliably share live data among clustered Java Virtual Machine (JVM) machines in the application tier, providing transparent failover as a key element of uninterrupted operation, and reduced load on the database tier as a key element of scalability. The concept behind the material is quite simple: When it comes to distributed caching, I've seen a lot of approaches that work well and a few too many that don't. The presentation will explain why certain approaches work well, and gives specific suggestions as to how applications should be architected to make optimal use of distributed caching. Attendees Will Learn Cache aside, read/write through and write behind architectures, where and when to use Caching Topologies: the limitations, trade-offs and benefits The 12 essential lessons of Distributed Caching Use cases and a topology quiz",
    "description": "Agenda Introduction Primer to distributed caching Essential lessons Case Studies Q&A",
    "language": "en",
    "speakers": [
      {
        "name": "Jonathan Purdy",
        "biography": "Co-founder and Technology Evangelist of Tangosol Jonathan Purdy is co-founder and Technology Evangelist of Tangosol, a company which provides in-memory Data Grid solutions for reliable and scalable data access across the enterprise. Jon has a wealth of experience creating high-scalability and high-availability systems, with an emphasis on both analytics and transaction processing. His creativity and leadership in product design and development have produced several award winning and market leading products."
      }
    ],
    "year": 2006
  },
  {
    "title": "Building and evolving services in a SOA context",
    "level": "beginner",
    "summary": "Service Oriented Architecture (SOA) has been among the great hypes within the software industry lately. Product vendors are currently presenting SOA as the solution to virtually all problems although many of them forget what it is all about - building good service contracts that are focused on solving real-life requirements rather than the technology of which can be used to realize a proper SOA. This presentation will address how services in a SOA context can be designed to evolve over time. This will be illustrated by examples in a non-vendor proprietary context. Attendees should learn how public services should be created in order to make them maintainable and evolvable over time. Also, the term SOA itself isn't as important as focusing on service contracts. The public service contract is more important than any term, product vendor and technology.. Also SOA is more than SOAP.",
    "description": "Evolving Services Business requirements evolve over time and this has to be reflected in services. However, in a SOA context, one cannot constantly deploy services that are not backwards compatible. Evolvability is a term that relates to services representing constantly changing business requirements. Such services are decorated over time, they must be backward compatible and they are not allowed to break existing service APIs. Outline Goals Term definitions Services in an enterprise context Maintaining services - by example: Example1: Technology driven Example2: More or less technology driven Example3: Contract driven Example4: Evolving services Summary Q&A",
    "language": "en",
    "speakers": [
      {
        "name": "Kristoffer Moum",
        "biography": "Seniorkonsulent ( Objectware AS ) Kristoffer works as a senior consultant at Objectware and has been working with Java and J2EE for six years. His focus has been in and around the Spring axis lately - as a developer as well as doing consulting, mentoring and having presentations on the topic. At the moment he is focused on frameworks that allow for short roundtrips when developing."
      }
    ],
    "year": 2006
  },
  {
    "title": "Achieving SOA made easy by Celtix 1.0 ESB",
    "level": "intermediate",
    "summary": "The talk starts with a brief overview of what ESB technology is all about and shows how it can be used to implement a successful SOA. It will then introduce Celtix 1.0, an Opensource ESB, by starting with the project’s history and philosophy and then providing a complete architecture overview of the project along with some of its key goals. The talk will then take a closer look at how each of the Celtix ESB components are designed, and how that leads to achieving easy SOA development. Then it moves on to exploring how Celtix relates to JBI and SCA in the grand scheme of things. The talk will finish by showing how to build, test and deploy a Celtix service.",
    "description": "What is SOA? What is ESB? ESB for SOA. Celtix Project History Project goals Status Celtix Architecture Architectural principles and overview. Bus Concept Message Flows Celtix Components Transports Message Bindings Language Bindings JAX-WS Webservices Celtix and JBI Celtix and SCA Building a service with Celtix. Q&A Required experience: J2EE technologies such as JMS, EJB and Web Services, with a broad understand integration issues and service oriented principals. Expected audience: Developers and architects who develop applications that interact with other applications at the middle tiers.",
    "language": "en",
    "speakers": [
      {
        "name": "Andrea Smyth",
        "biography": "Principal Engineer ( IONA Technologies ) Andrea Smyth is a Principal Engineer at IONA Technologies and open source developer who specializes in web services and service oriented architecture. She has contributed to the reliability and configuration components in the Celtix ESB project and is currently a lead developer of the incubating Apache CeltiXfire project."
      }
    ],
    "year": 2006
  },
  {
    "title": "Doing evolutionary integration with Mule & the EAI patterns",
    "level": "beginner-intermediate",
    "summary": "If we take closer look at the majority of applications in a given organization, integration is done on an ad-hoc basis. As time goes by and the application portfolio grows, the interconnection between the systems and applications start looking like a coral reef: hard and stiff inside, and with some life on the outside. Fumbling with the hard coupled integration points can potentially invoke a cascade of side effects, causing nobody to dare correct the root cause of the problems. Often, people just fix the symptoms by adding a new layer on top of the coral reef of highly coupled systems and applications. To avoid this pit fall, we need to shift the way we think of. We need to accept that IT systems evolve, and the way the organization needs support from them changes. This can only be fulfilled by choosing an integration strategy that is complementary with the evolution of its IT facilities. The talk is a practical story on how a system can evolve from a regular closed system to a dynamic system with unlimited integration points. The talk will reference the EAI patterns described in Gregor Hohpe’s book and map those to real life scenarios.",
    "description": "Introduction to the ‘integration’ problem. (5m) Presenting the first version of the application. (5m) Introduction to Mule (5m) Discovering the Enterprise Integration Patterns, problem solution (5m) Shift towards Mule, converting the core system to Mule components (10m) Adding new integration points to the system (15m) (live code/demo) Summary. (5m) Q&A (10m) Required experience Experience with object oriented programming. Expected audience Anyone involved in developing enterprise systems.",
    "language": "en",
    "speakers": [
      {
        "name": "Rune Schumann",
        "biography": "( Bouvet ) Rune Schumann is Senior Architect in Bouvet with experience since 1999 with large distributed Java systems. He as worked for several years as architect, developer and project manager with SOA systems both in telecom and the retail business. He has also held SOA talks both on international conferences and the Norwegian JUG as well. Author of the article \"Evolutionary integration with ESBs\" published at InfoQ in June 2007."
      },
      {
        "name": "Ross Mason",
        "biography": "CTO and Co-founder ( MuleSource Inc. ) Prior to founding MuleSource Ross Mason was Chief Executive Officer of SymphonySoft Limited, an EU based company that provides services and support for open source integration projects. In 2003 Ross founded Mule, the leading Java-based integration platform and Enterprise Service Bus framework. Mule is being used by top-tier financial institutions and many other high profile enterprises in Telecommunications, Retail, Insurance and Government. Previously, Mason was Lead Architect for RaboBank and played a key role in developing one of the first large-scale ESB implementations in 2002. Mason holds a B.Sc. (Hons) in Computer Science from Bristol, UK."
      },
      {
        "name": "Kjetil H Paulsen",
        "biography": "Senior System Architect ( Bouvet AS ) Kjetil H.Paulsen is currently a Senior Software Architect at Bouvet AS, with experience since 1996. He as worked on several large distributed Java systems as an architect and lead developer, mainly in the finance business. Kjetil is also a javaBin (the Norwegian JUG) board member, which among other things hosts the annual well known JavaZone conference. Kjetil has also contributed to several open source projects."
      }
    ],
    "year": 2006
  },
  {
    "title": "Mule + JavaSpaces = Stateful SOA",
    "level": "beginner-intermediate",
    "summary": "Current approaches to SOA state that services are silos of functional code that make up composite applications. Both Web Services and ESB approaches are not good at managing shared state of service architectures. Stateful SOA applications are distributed applications that require integration with each other on two dimensions: communication and state. Many workflow scenarios fall into this category, as well as distributed computing applications. Normally, states are shared through a centralized resource – such as a file system or a database -- which often creates a scalability and performance bottleneck. Maintaining consistency in such environments also requires the use of a distributed transaction coordinator with an XA interface, which significantly impairs performance. This session will demonstrate how Mule and JavaSpaces can offer a single integrated solution for both delivering the messages and sharing state. The solution is based on a common clustering architecture and deployment environment.",
    "description": "Introduction to the scenario. (5m) Introduction to Mule and JavaSpaces (5-10m) (depending on audience experience) Presenting the first version of the application using Mule. (5m) The solution using JavaSpaces and Mule (10m) Why do we need stateful services? (code example) (10m) Scaling up and out (where existing solutions fail) (5m) Summary. (5m) Q&A (10m) Required experience Experience with object oriented programming and some knowledge of ESBs Expected audience Anyone involved in developing enterprise systems.",
    "language": "en",
    "speakers": [
      {
        "name": "Ross Mason",
        "biography": "CTO and Co-founder ( MuleSource Inc. ) Prior to founding MuleSource Ross Mason was Chief Executive Officer of SymphonySoft Limited, an EU based company that provides services and support for open source integration projects. In 2003 Ross founded Mule, the leading Java-based integration platform and Enterprise Service Bus framework. Mule is being used by top-tier financial institutions and many other high profile enterprises in Telecommunications, Retail, Insurance and Government. Previously, Mason was Lead Architect for RaboBank and played a key role in developing one of the first large-scale ESB implementations in 2002. Mason holds a B.Sc. (Hons) in Computer Science from Bristol, UK."
      }
    ],
    "year": 2006
  },
  {
    "title": "Lifting the Covers of Stability and Performance",
    "level": "intermediate-advanced",
    "summary": "The talk will present experiences gathered in analysis and correction of performance and stability problems with BEA WebLogic and IBM WebSphere application servers and JVMs in general. The talk will not be product oriented, the topics presented are equally applicable to all servers/Java environments, although examples given may discuss features of popular application servers. The talk will outline simple measures to take when performing an analysis of perceived stability and performance problems. The talk will introduce experiences with both vendor, third party and freely available tools along with features of homebrewed tools. I will discuss some myths arising from vendor's best performance recommendations, possibly attempting to dispel some of them. Experiences in deployment topology will be among these. Some experiences not often discussed when reviewing vendor supplied \"best-practices\" whitepapers will be discussed. Part of the talk will delve into the JVM itself and attempt to explain what is going on in some frequently encountered failure situations and indications that may give you some forewarning. Some simple tools for analysis of JVM runtime behavior will be discussed. The Java Management Extensions (JMX) will be featured sprinkled throughout the talk and the role JMX can and should have in application development and deployment will be discussed.",
    "description": "Common traits of Application Servers Resources (get a handle on resource usage) Resources how much is too much? (very common questions surround things like thread pool, JDBC pools heap size. I will try to come up with some kind of pointers as to what may be good values and what are outrageous ones. Failure situations associated with poor resource control will be discussed like \"out of memory\" errors and \"resource handle depletion\") VMs: tuning (important aspect of good application server behavior, especially with regards to heap sizes and types.) VMs: what is going on? (How we can learn something about what the VM is doing in various situations, brief look at various garbage collection mechanisms that are available.) A kingdom for a stack trace! (How and what can be learnt form them, use them as a mechanism to analyze serious code problems that hinder maximum throughput) Performance and stability tools. Commercial offerings Make your own nix tools for dummies Use JMX JMX in application servers JMX tooling What is wrong with your test and development environment (often overlooked differences with test and development environments and how to simulate.) Never trust the flyers (Some real world examples of why vendor whitepapers often does not survive a reality check.) Q&A",
    "language": "en",
    "speakers": [
      {
        "name": "Trond Strømme",
        "biography": "Consultant ( Bouvet ) Trond Strømme is a consultant currently employed by Bouvet AS. Previously he has worked with implementation of a more distributed architecture for one of Norway's biggest net banks and related performance and stability measures. Currently he's working as an architect for part of the new merchandizing suite of a large international retailer. Trond is a member of an internal group in Bouvet that specializes in application management, profiling and stability issues."
      }
    ],
    "year": 2006
  },
  {
    "title": "Integrating BPEL,Workflow and Rules using Java EE platform",
    "level": "intermediate",
    "summary": "As enterprises move towards business process optimization, they are looking for efficient mechanisms to orchestrate interactions between systems, services and people in order to achieve their strategic and operational objectives. In this session we will discuss how WS-BPEL a standards based infrastructure can be used in Java SE/EE platform to architect a workflow solution that is integrated with a rules engine based on JSR-94. This session will further drill down into a BPM implementation done at a call center, to show how WS-BPEL, workflow services and rules are used together to create a dyanmic process flow which includes service orchestration and policy based task assignment , escalation and load balancing tasks among users.",
    "description": "Why enterprises are looking at Service Oriented Architecture 5 mintues ? Composite applications & Orchestration 15 minutes ? o WS-BPEL a standard for business process orchestration Agility to business processes via Business rules 10 minutes ? o JSR 94 Can workflow be embedded into business processes 10 minutes ? o Workflow services o Policy & Task based workflow Implementation of a business process orchestration at call center 10 minutes ? o Details of implementations o Best practices What's new 5 minutes ? o WS-BPEL 2.0 Target audience Developers and consultants who are focussed on integration technologies and enterprise application integration. Attendees will be able to understand in detail about the standards for business processes and how to build agile business process with standards-based business rules and workflow. On top of this attendees will be also able to see the architecuture used for a call center application including best practices.",
    "language": "en",
    "speakers": [
      {
        "name": "Raghu Kodali",
        "biography": "( Oracle ) Raghu Kodali is currently authoring a book on EJB 3.0 for Apress titled Beginning EJB 3 and is consulting product manager and SOA evangelist for Oracle Fusion Middleware. He leads next-generation SOA initiatives, J2EE, and Web Services feature sets for Oracle Application Server, with particular expertise in EJB, J2EE deployment, web services, and BPEL. Prior to product management, Raghu held presales and technical marketing positions in Oracle Asia-Pacific, based in Singapore. Prior to Oracle, he worked as a software developer with National Computer Systems, Singapore. He holds a master's degree in computer science and is a frequent speaker at technology and user group conferences like JavaOne, Oracle Open World, Sun Technology Days, JavaZone, JAOO, various JUG's and Oracle Developer Days with audience ranging from 100-1000. Raghu is also technical committee member for OASIS SOA Blueprints specification, and board member or Web Services SIG in OAUG, and he maintains an active blog at Loosely Coupled Corner."
      }
    ],
    "year": 2006
  },
  {
    "title": "What is a Service in the SOA context?",
    "level": "beginner",
    "summary": "Much has been said about Service Oriented Architecture lately and everyone seems to have their own interpretation of what SOA really is. Not many have focused primarily on the core part of SOA – Services. This talk will not be about SOA and how it is the solution to all your problems. The focus in this talk will be on services and what a service really is in the SOA context. In the beginning of the talk I will introduce four conceptual service layers. We will then dwelve into an example guided tour outlining the characteristics of the different service layers. Characteristics include contractual elements, implementation strategies, implementation technologies and guidance of the correct choices.",
    "description": "Introduction (1 min) Objectives (1 min) Services and SOA (5 min) Service Layers (10 min) - Human Interaction Workflow services - Application to application orchestration services - Aggregated/Composite services - Core services Characteristics of the layers (10 min) Characteristics of the implementation strategies (10 min) Characteristics of the Implementation technologies (10 min) Resources (1 min) Q&A (10 min)",
    "language": "en",
    "speakers": [
      {
        "name": "Kjartan Aanestad",
        "biography": "Kjartan is working as a consultant at Objectware AS and has about 6 years of programming experience primarily working with J2EE. He has lately been focusing on Service Oriented Architecture and services in specific."
      }
    ],
    "year": 2006
  },
  {
    "title": "Getting Service Engineering Right: From Specification to Running Java Code using Eclipse Technology.",
    "level": "intermediate",
    "summary": "Service engineering is becoming a discipline in its own right, not only in telecom but in the ICT world at large. It is challenging because services tend to depend on each other, be distributed and dynamic. High demands on time to market, compositionality and robustness make the life of service developers hard. The trend is towards loosely coupled and collaborative services both in the business and the telecom/embedded domain. To master these challenges it is necessary to understand the fundamental nature of services and service composition, and provide tools, platforms and methodologies to support them. Considering the widespread use of services and the attention received by service providing systems and architectures (e.g., SOA), surprisingly few approaches actually do this. Most approaches are targeting the business domain and neglect the communication/embedded domain. This is unreasonable since these domains are increasingly being merged. We present a model-driven approach to convergent service engineering. It considers a service as a collaboration involving loosely coupled objects playing different roles. Service development starts by specifying the behaviour of collaborations and roles. The roles are then composed into active objects with precise behaviour descriptions in form of state machines, which are checked for consistency and then automatically translated to Java code. To facilitate the approach, we developed the Eclipse-based tool suite Ramses. It supports editing of state machines, automatic code generation, visualization of running systems, and extensive consistency checks based on new and scalable principles. It has been successfully applied on student projects to develop a large number of demonstrator services.",
    "description": "Introduction to service engineering and the challenges of convergent services and service composition Using collaborations to specify services, to define interfaces, and to visualize service executions, illustrated using a service example Using Ramses to define state machines and to check internal consistency Using Ramses to generate code and visualize the running system. Lessons learned from tool integration in Eclipse",
    "language": "en",
    "speakers": [
      {
        "name": "Rolv Bræk",
        "biography": "Professor ( NTNU ) Rolv Bræk is professor in systems development at the Norwegian University of Science and Technology (NTNU), Department of Telematics, Trondheim. He received his M.Sc. from The Norwegian Institute of Technology (NTH), Department of Telecommunication Switching Systems in 1969. Rolv Bræk has ten years experience as systems designer, project manager and technical manager of product development for the telecommunication industry. Products include ACD, CAMEX, TRIDEX and Garex-14 developed for G.A. Ring AS, and MAREIK developed for Elektrisk Bureau AS; all of which has been long living industrial products on the world market. His work included specification, design and implementation of fault tolerant and distributed computer systems including the operating systems and application software. During these projects he developed and applied the SDL Oriented Methodology, SOM, for specification and design of event driven real- time systems. He initiated and headed the work to develop a graphical editor for SOM, called DASOM, and an automatic program generator called ProgGen which were used industrially by Alcatel, Stentofon and others to automatically generate product quality code from SDL designs. Rolv Bræk played a central role in the national technology transfer program SISU and its follow up SISU II where a number of companies collaborated to improve their systems engineering practices. He was responsible for the methodology work within SISU and co-authored a textbook on methodology using SDL (published by Prentice Hall), and a CD based textbook on The Integrated Methodology, TIMe. Currently his main research interest is methods, tools and platform support for rapid and incremental service engineering based on UML2 collaborations. He is one of the initiators of PATS (Program for Advanced Tele Services), which is a network of excellence between Telenor, Ericsson, Compaq and NTNU. This program has built a world- class research and student laboratory jointly operated by NTNU, Telenor and Ericsson."
      },
      {
        "name": "Frank Alexander Kraemer",
        "biography": "( NTNU ) Frank Alexander Kraemer has a master's degree (M.Sc.) in Information Technology from the University of Stuttgart. After finishing his master's thesis at the Department of Telematics at the Norwegian University of Science and Technology (NTNU) in 2003, he joined the networked systems research group. Since then, Frank is working on his doctoral thesis with professor Rolv Bræk as supervisor. His main research field is the correctness-preserving development of services based on formal refinement techniques. Frank participates in the PATS/ARTS project that brings together industry, research and customers to develop methods, tools and platforms for the rapid development of telecommunication services. In this context, he created the Eclipse-based service engineering tool Ramses that combines modeling, model checking and code generation and that has been used in a number of student projects and is used engineering tool platform in the project. He has several years of experience with tool integration in Eclipse, starting with a project during an internship at IBM Germany."
      }
    ],
    "year": 2006
  },
  {
    "title": "Rule Engine as a key component in the enterprise system architecture - Experiences from developing a complex rule-based system",
    "level": "intermediate",
    "summary": "From being something mostly associated with Artificial Intelligence (AI) and highly specialized Expert Systems in the early 90’s, Rule Engine Technology now seems to get a more important role in “ordinary” enterprise software architectures. This is most noticeable in the platform vendor space, where Rule Engine Technology is pointed out as one of the key component of a well-designed Service Oriented Architecture (SOA). These components are referred to as Business Rules Engines (BRE).   Selvaag BlueThink have several years of experience using Rule Engine Technology developing complex rule-based systems for the construction industry. The main motivation has been to offer flexibility in business critical applications, shorten the development time, along with the opportunity to implement products with great complexity. This presentation will give an introduction to Java based Rule Engine Technology in general, and insight into experiences from the development of one of Selvaag BlueThinks products, the Intelligent House Configurator (IHC). IHC is an application supporting the design/configuration process of housing products. This process is highly complex and the users must deal with an extreme amount of configuration parameters. Rule Engine Technology has shown it self as well suited for solving these problems.",
    "description": "Introduction Who we are Who Selvaag BlueThink is and what we do An Introduction to Rule Engine Technology (20%) Rulebased development: Rules, what is it? Motivation Rulebased development vs. tradition procedural development Rule Engines (RE) The main components of a rule engine Optimalization algorithms - Rete Examples of some Java based rule engines Jess Drools Standards Jsr94 standard Rule Engine API SBVR, RuleML and SWRL for rules Business Rules Engines (BRE) Experiences from The Intelligent House Configurator (IHC) (70%) An introduction to IHC What is it, and what target(s) does it have? The solution Our motivation and experiences Why use a rule engine? Experiences, have we achieved what we expected? Challenges we have had, and how we have solved them Some thoughts about the future The use of rules in a SOA and workflow perspective Combining rules and semantics Where do we see a rule engine fit in the future of the CASA Knowledge Suite?",
    "language": "en",
    "speakers": [
      {
        "name": "Espen Rustad",
        "biography": "Principal Consultant, Oracle Norge AS ( Oracle Norge AS ) Mr. Rustad have more than 5 years experience developing complex rule-based systems in Selvaag BlueThink AS. Selvaag BlueThink AS develops knowledge-based systems and methodologies to facilitate an industrialized approach in the construction industry."
      },
      {
        "name": "Per Christian Engdal",
        "biography": "System Architect, Selvaag BlueThink AS ( Selvaag BlueThink AS ) Mr. Engdal has more than 5 years experience developing complex rule-based systems in Selvaag BlueThink AS. Selvaag BlueThink AS develops knowledge-based systems and methodologies to facilitate an industrialized approach in the construction industry."
      }
    ],
    "year": 2006
  },
  {
    "title": "Understanding and Using the JSR-208 Java Business Integration Standard",
    "level": "intermediate",
    "summary": "Integration solutions have traditionally required the use of non-standard technologies to create functional systems. Java Business Integration (JBI) specification (JSR 208) defines the core of a service oriented integration bus and component architecture for SOA. It standardizes the common message routing architecture, plug-in interfaces for service engines and bindings, and a mechanism (Composite Service Description) to combine multiple services into a single executable and auditable unit of work. The presentation will include a demonstration using the OpenESB product. OpenESB is an open source, ESB implementation based from the ground-up on the JBI standard.",
    "description": "Introduction to JBI. o The motivation for JBI o The scope of the standard o Concept of an Integration MetaContainer. o Difference between the scope of JBI and ESBs as a whole JBI Architecture o Service Engines and Binding Components o Message Exchanges o WSDL 2.0 Message Exchange Patterns o Normalised Messages o Normalised Message Router o JBI Management and Administration o Service Units o Service Assemblies JBI Component Development Lifecycle o Develop, Package, Deploy, Run o Demonstration using the OpenESB product.",
    "language": "en",
    "speakers": [
      {
        "name": "Jason Baragry",
        "biography": "Senior Software Architect Sun Microsystems, Norway ( Sun Norway ) Jason Baragry is a Solution Architect with Sun Microsystems in Norway. He has a PhD in software engineering and 15 years of software architecture experience in pure research, applied research, and commercial projects."
      }
    ],
    "year": 2006
  },
  {
    "title": "The Top Ten Ways to Botch an Enterprise Java Application",
    "level": "beginner",
    "summary": "Based on actual real-world experiences (with names and details changed to protect the guilty), in this session Jonathan Purdy shares some of the best-kept secrets in the industry, including architecture and development tips that are certain to push projects over budget and beyond deadlines. Mr. Purdy will count down through the 10 biggest mistakes that lead to project failure, from specifying the wrong mechanism for data access to failure to do system testing throughout the development process. He will also discuss the best and worst practices for eliminating single points of failure in Java EE applications. A number of case studies will be presented as \"evil rules\", i.e. a tongue-in-cheek \"do this to totally botch stuff up\" set of instructions, which will show how something that seems reasonable at first blush is actually quite dangerous. Some attendees may mistakenly use this information to avoid pitfalls, errors, and other common causes of project failure.",
    "description": "Overall Presentation Goal: In these slides, you will see why that zillion dollar project failed. You’ll likely laugh - you’ll want to cry! To see these practices revealed. Agenda The Top Ten Ways to Botch an Enterprise Java Application Eliminating SPOFs 4 Evil Rules For Designing Non-Scalable Applications Q&A",
    "language": "en",
    "speakers": [
      {
        "name": "Jonathan Purdy",
        "biography": "Co-founder and Technology Evangelist of Tangosol Jonathan Purdy is co-founder and Technology Evangelist of Tangosol, a company which provides in-memory Data Grid solutions for reliable and scalable data access across the enterprise. Jon has a wealth of experience creating high-scalability and high-availability systems, with an emphasis on both analytics and transaction processing. His creativity and leadership in product design and development have produced several award winning and market leading products."
      }
    ],
    "year": 2006
  },
  {
    "title": "Anemic domain models and persistence-aware model objects",
    "level": "intermediate",
    "summary": "The \"anemic domain model\" antipattern was proposed by Martin Fowler in 2003. The antipattern describes how domain objects often become data containers instead of exhibiting behaviour. Part of the problem is making model objects aware of the persistence mechanism used so they can make changes to the persisted state of a system. Telio has since the summer of 2005 been using dependency injection (DI) in domain objects to alleviate parts of this problem. The session will show the architecture of the solution in use at Telio, which is based on Spring and Hibernate. The technique that is described has its own set of problems. Some of these problems will be dealt with in the talk.",
    "description": "Walkthrough of the transaction script, domain model and anemic domain model patterns Using hibernate interceptors to inject dependencies Using the @Configurable annotation to inject dependencies (example) Comparison of the two injection technologies Comparison of the effects of applying the domain model pattern in a production application Summary and questions",
    "language": "en",
    "speakers": [
      {
        "name": "Geir Hedemark",
        "biography": "Senior system architect, Telio Telecom AS ( Telio Telecom AS ) - M.Sc. microelectronics, University of Oslo 1996 - Experience in ASIC design, military tactical networks, web design, project management, VoIP. - Now working at Telio Telecom AS - Lead of provisioning system development group"
      }
    ],
    "year": 2006
  },
  {
    "title": "Yet another online store case-study: JavaServer Faces in the real world",
    "level": "intermediate-advanced",
    "summary": "Because of our expertise in online store web-application development, we were asked to develop yet another online storefront application by a company extending its business to online sales. Starting this new project was just about the right time to get started with JSF. Strong of our experience in such missions and outlining the requirements to the client, we soon realized a few pitfalls of the JavaServer Faces technology for such public website development. Stepping through the usual development process we encountered challenges using this new technology. Still we kept on going with it, solving every aspect of the problems coming across. Resulting is a web-application making use of JSF, Spring and Hibernate. We would like to share our experience solving the problems we ran into with JSF developing such a public web-application, like: proper doc-type declaration, templating, EL (c:forEach, c:if tags), search- engine friendly URLs, ... We also show how to make JSF integrate smoothly with the Spring framework and Hibernate ORM. This talk will cover the complete application development cycles as we implemented the solution for our client, showing how Java, using JSF together with other commonly used frameworks, enabled us to deliver a high quality web-application meeting the requirements of such public commercial websites.",
    "description": "Presentation Introduction - Introduction of the talk (what you’ll learn and so on) The mission - Project evaluation and requirements definition Architecture - This will cover what decision were made and why The JavaServer Faces technology - First why we have decided to give JSF a chance Templating Facelets Shale - Covering templating, we’ll see how these two technologies did not pass our tests and were both rejected for the project Separation of concerns The Spring Framework Hibernate ORM service - We’ll cover the integration of JSF with these both well-known and widely adopted frameworks Wiring everything - Actual deployment of the solution Front-end JSPX URL based navigation Internationalization - This part will cover how JSF did suit the requirements set and what problems were encountered actually fulfilling these Backend Remoting - Covers how the solution was managed by the customer Conclusion Q&A",
    "language": "en",
    "speakers": [
      {
        "name": "Alexander Snaps",
        "biography": "Web Developer and BEJUG Member It is in 1987 in Munich, Germany that Alexandre Snaps discovers his natural ability for computer languages and starts their studies and gets involved in different Open Source projects. In 1999, he plunges into web development and is hired as lead architect by “Toute la BD, sa” (project around French comic books that will be used as platform for many other projects). Three years later, he starts his own business, DOG7, focused on enterprise integration, for customers such as Thomson Multimedia, Technicolor, Lee Jeans. He is using Java technologies for web application development for over 5 years. He’s an active BeJUG member and speaker at JavaOne 2006."
      }
    ],
    "year": 2006
  },
  {
    "title": "Google Web Toolkit: What, Why, and How",
    "level": "intermediate-advanced",
    "summary": "The Google Web Toolkit (GWT) is a Java-centric framework for creating AJAX applications. GWT cross-compiles Java source into JavaScript, allowing Java developers to use their existing Java skills and tools to easily create AJAX applications with virtually no learning curve. After a short introduction to GWT, we will dive quickly into a few key topics including high-performance AJAX, internationalization, and integration with existing web applications.",
    "description": "- What is GWT? A short introduction to GWT with a \"Hello, world\" demo. - What capabilities does GWT provide? - What kind of skills are needed to use GWT? - Why did we choose Java as the source language? - Why does translating Java into JavaScript make sense? - Why didn't you do X instead? (where X is a huge list of alternative ideas) - How to internationalize GWT applications. - How to maximize performance of GWT applications. - How to integrate GWT with existing web applications. Intended audience: (The topics are of general interest to all types of audience members, but probably skewed toward Developers, Architects and Technical Managers) Developers, Architects, Project leaders, Technical managers Level: Intermediate-to-advanced, although since GWT is relatively new, the bar for \"advanced\" isn't that high yet.",
    "language": "en",
    "speakers": [
      {
        "name": "Bruce Johnson",
        "biography": "Software Engineer and Tech Lead Bruce Johnson is a Google Software Engineer and Tech Lead of the Google Web Toolkit (GWT). Prior to joining Google, Bruce cut his product teeth as lead developer of AppForge's MobileVB product. His experience writing a Visual Basic cross-compiler was slightly fun (in a masochistic way), designing a portable version of Microsoft COM for non-MS embedded devices was much funner, but, without question, cross-compiling Java into JavaScript for GWT is the funnest. Despite his recent Java focus, Bruce will always be a Bjarne Stroustrup groupie, and he keeps a copy of D&E in his night-stand."
      }
    ],
    "year": 2006
  },
  {
    "title": "JBoss SEAM",
    "level": "beginner",
    "summary": "Traditional web applications are incredibly vulnerable to bugs and performance problems relating to state management. Developers are forced to handle issues like back button navigation, multiwindow browsing, and session size management in an utterly ad-hoc fashion. Web frameworks offer only extremely fragile state management constructs such as HttpSession and HttpRequest. Access to transactional components from the web tier has also been problematic. J2EE provided no way to have simultaneous access to state held in contexts associated with the web request, and state held in transactional resources accessed via EJB. Finally, J2EE had no first-class construct for representing state associated with a long-running business process.",
    "description": "JBoss Seam is a new application framework for Java EE 5 that introduces the notion of declarative, contextual, application state management. Seam integrates EJB 3.0 with JSF and, optionally, business process management via jBPM, providing a uniform component model for Java EE. This presentation will discuss problems affecting stateful web applications, introduce Seam’s declarative state management model, and demonstrate how easy it is to build robust web applications using EJB 3.0, JSF, and Seam.",
    "language": "en",
    "speakers": [
      {
        "name": "Gavin King",
        "biography": "King – Hibernate Architect ( Jboss ) Gavin King is the founder of the Hibernate project. He was born in a country town named Mudgee in 1974 and has never been there since. He is currently based in Melbourne, Australia - the city with the world's highest ratio of restaurants to people. Gavin's interest in persistence was sparked at the age of 11 when his early software development efforts were all destroyed due to the notorious unreliability of the Commodore 64 cassette drive. Gavin studied mathematics at Monash University before deciding to do something useful instead. He now works for JBoss, Inc., developing Hibernate and the new Hibernate-based CMP engine - and hopes he has finally proved his usefulness. He is co-author of the book, Hibernate in Action, to be published by Manning. He is also involved in the EJB3 expert group. Gavin always enjoys writing about himself in the third person."
      }
    ],
    "year": 2006
  },
  {
    "title": "Automated acceptance tests with use of Watir in web applications",
    "level": "beginner",
    "summary": "WATIR stands for Web Application Testing in Ruby and is an open source functional testing library for automated tests to be developed and run against a web browser. The Watir project is actively being worked on and it's becoming more and more popular. This presentation covers the projects experience using the Watir test framework. How we got started with simple Watir scripts that evolved into continuous integrated executable acceptance specifications. Slides in English, talk in Norwegian",
    "description": "Introduction to Watir Writing and running Watir tests in Eclipse Adding assertions Watir as part of the agile process: Executable specifications Incorporating Watir into the continuous integration loop Lessons learned, tips and tricks Summary and QA Required experience Understand programming basics (some Ruby experience would be beneficial). Slides in English, talk in Norwegian",
    "language": "en",
    "speakers": [
      {
        "name": "Geir Wavik",
        "biography": "( BEKK ) Geir Wavik is working as a GUI programmer at Bekk Consulting. His experiences involves standards, testing and usability for the presentation layer."
      },
      {
        "name": "Vidar Alvestad",
        "biography": "( BEKK ) Vidar Alvestad is a Java architect working at Bekk Consulting. He has 11 years of experience in the software industry, and has been involved in java and J2EE application development for 7 years."
      }
    ],
    "year": 2006
  },
  {
    "title": "Ajax and Faces: Friend or Foe?",
    "level": "advanced",
    "summary": "Can a client-side Ajax solution and server-side Faces solution co-exist and play well together? Or are they each solving a similar problem in a different and incompatible way? This session will discuss how the JavaServer Faces framework can be used to embrace Ajax today, while protecting Web applications from radical rearchitecture each time there is a change in direction of client-side technology. The session will address key aspects of Faces component development, and introduce innovative techniques to adopt Ajax. Jonas and John will discuss how to best leverage Ajax to create extremely interactive rich Internet components, and issues that developers encounter when building Ajax-enabled JSF components. The session will also cover advanced techniques such as dynamic content type negotiation, JAR-based resource delivery, and dynamic render kit selection. The presenters will be using the Dojo toolkit in combination with JSF, HTML and XUL to illustrate their points.",
    "description": "Ajax Philosophy (10 minutes) From AJAX to Ajax - Brand name for a set of very useful technologies Cross-browser support? - Writing to W3C standards doesn't work File Upload Functionality Need a Sane Development Model - You need a framework to help you focus on your application Don’t re-invent the wheel - Use available Ajax toolkits Strengths of Ajax - Provides highly interactive clients and provides separated channels for server-side communication and UI refresh (XMLHttpRequest). Weaknesses of Ajax - You're still writing your Web application's UI in JavaScript and next generation of legacy applications Demo of Ajax (5 minutes) JSF Philosophy (10 minutes) What is Faces? Component Model & Rendering Abstraction UI Behavioral Split Rendering (HTML, XUL, HTC, whatever) Formal Phases - Initial Request and Postback Extensible - It is possible to override any aspect of JSF to customize its behavior Strengths of JSF - JSF is next generation ready Weaknesses of JSF - The total complexity can be intimidating Demo of JSF’s Rendering Capabilities (5 minutes) Can Ajax & JSF work together, for real? (15 minutes) Consider Joe Developer... Joe knows JSP and Swing. How can Joe use Ajax? Ajax and Faces: Friend or Foe? Handling Ajax Resources - The \"Installables\" problem Handling Ajax Resources - \"Installables\" solutions, loading resources out of JARs Ajax JSF Data Fetch - No side effects, no change to JSF component tree, no need of JSF lifecycle, right? Ajax JSF Page Refresh - Different Ajax JSF solutions Handling DOM Differences Who's Controlling the Content Type? - What impact does this have on my Ajax JSF components? Any Proof? Demo of Rich Client Development with JSF (5 minutes) QA (10 minutes)",
    "language": "en",
    "speakers": [
      {
        "name": "Jonas Jacobi",
        "biography": "J2EE Technology Evangelist ( Oracle ) Jonas is a J2EE Technology Evangelist at Oracle. A native of Sweden, Jonas has worked in the software industry for more than 15 years. Prior to joining Oracle, Jonas worked at several major software companies in management, consulting, development, and project management roles. For the past 3 years, Jonas has been responsible for the JavaServer Faces, Oracle ADF Faces, and Oracle ADF Faces Rich Client product management in the Oracle JDeveloper team. Jonas is a popular speaker at international conferences such as JavaOne, EclipseWorld, EclipseCon, and JavaPolis, and has written numerous articles for leading IT magazines such as Java Developer's Journal, JavaPro, and Oracle Magazine. Jonas is author of the recently published book - Pro JSF and Ajax: Building Rich Internet Components, Apress."
      },
      {
        "name": "John Fallows",
        "biography": "Java architect ( TXE Systems ) John R. Fallows is a Java architect at TXE Systems. Originally from Northern Ireland, John graduated from Cambridge University in the United Kingdom and has worked in the software industry for more than ten years. Prior to joining Oracle, John worked as a research scientist for British Telecommunications Plc. Prior to joining TXE Systems, John worked as a JavaServer Faces technology architect at Oracle. John played a leading role in the Oracle ADF Faces team to influence the architecture of the JavaServer Faces standard and to extend the standard to provide Ajax functionality in the ADF Faces project. John is a popular speaker at international conferences such as JavaOne and JavaPolis, and has written numerous articles for leading IT magazines such as Java Developer's Journal. John is author of the recently published book - Pro JSF and Ajax: Building Rich Internet Components, Apress."
      }
    ],
    "year": 2006
  },
  {
    "title": "Object-Oriented Web Development with Aranea",
    "level": "intermediate-advanced",
    "summary": "Aranea is a web framework that facilitates Object-Oriented techniques like encapsulation and polymorphism by using POJO components, explicitly managed by the programmer. Aranea is also a full-stack web framework providing both a powerful controller that supports nested flows, and a custom JSP tag library. This talk however is not so much about Aranea (which we dive through in about 10 minutes), but about the object-oriented programming techniques applied to the web development. We want to show how usual OO idioms and patterns can make challenging tasks suprisingly simple and how many inherent problems just seem to go away. We will also briefly discuss the integration facilities that Aranea provides and how it can help to unite the fragmented web framework ecosystem.",
    "description": "Why Object-Oriented web matters? What's wrong with the current situation? Aranea crash course Applying OO with Aranea, OO idioms and GoF patterns Bonus perks for using OO (popups, multi-submit, back button) Uniting the web frameworks  ",
    "language": "en",
    "speakers": [
      {
        "name": "Jevgeni Kabanov",
        "biography": "( Webmedia, Ltd. / Tartu University ) Jevgeni Kabanov is the lead architect of Aranea Web Framework. He is also both the R&D lead in one of the largest Estonian software development companies (Webmedia, Ltd.) and an enrolled researcher (Tartu University). For the past 3 years Jevgeni was involved in a several big web project (including a medical and telco infosystems) that motivated the development of Aranea."
      }
    ],
    "year": 2006
  },
  {
    "title": "Cutting-edge productivity with RIFE",
    "level": "beginner",
    "summary": "RIFE is a full-stack, open-source Java web application framework, offering fast results with the promise of maintainability and code clarity. While many are attracted to RIFE for the productivity gains it offers, the framework actively tries to solve difficult problems with creative solutions that combine power and flexibility with comfortability. RIFE has pioneered many novel ideas in Java web application development and we will go over a series of concise practical examples to demonstrate: RIFE's focus on developer comfortability with instant reloads and centralized declarations, native Java web continuations, metaprogramming through constraints and meta data merging, run-time POJO-driven CRUD generation, bi-directional logic- less templates, automatic context-aware components, and the integration of a content management framework.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Geert Bevin",
        "biography": "CEO ( Uwyn ) Geert is the CEO of Uwyn, a small custom application development company with a strong focus on Web applications, open-source, Java and rich internet technologies. He is the founder of the RIFE project which provides a full-stack Java Web application framework for quickly building maintainable applications with sustainable developer productivity. He also started or contributed to projects like Bla-bla List, OpenLaszlo, Drone, Bamboo, Elephant, RelativeLayers, and Gentoo Linux. Geert has spoken at Java In Action and EuroOSCON. He is an invited speaker for two sessions at TheServerSide Java Symposium 2006 US and Europe, for one sessions at Fosdem 2006 and has presented RIFE at this year's JavaPolis during a 2.5h university session, quickie and BOF."
      }
    ],
    "year": 2006
  },
  {
    "title": "REST vs. SOAP Smack Down",
    "level": "beginner",
    "summary": "You’ve heard the terms. You’ve seen the debates on the blogs. But what does it really come down to? What are SOAP and REST? Is one actually better than the other? Is SOAP too complex? Is REST too simple? Does Amazon’s REST API really get 5 times more usage than the SOAP one? Does this mean you shouldn’t bother with SOAP? This talk will pit the REST and SOAP against each other in an attempt to come to some answers as to which one you should choose!",
    "description": "Outline What is REST? What is SOAP? Debate topics: Are SOAP and REST opposed to each other? Is SOAP too complex? Is REST too simple? What is easier to get started with as a web service writer? What is easier to get started with as a service consumer in Java? In .NET? In Ruby? What about transactions, reliability? What pitfalls are there to each approach? (Ideally the audience would share some experiences here). Conclusions on when to use SOAP and when to use REST",
    "language": "en",
    "speakers": [
      {
        "name": "Dan Diephouse",
        "biography": "( Envoi Solutions LLC ) Dan Diephouse is an accomplished enterprise architect and open source developer who specializes in web services and service-oriented architecture. He is the founder of the popular XFire web service framework and a committer on several other open source projects, including the Apache ServiceMix, XmlSchema and Continuum projects. He is also the founder of Envoi Solutions http://envoisolutions.com/, which provides training, support and services for companies doing web services integration and SOA development."
      }
    ],
    "year": 2006
  },
  {
    "title": "Automated Web Application Testing with Selenium",
    "level": "intermediate",
    "summary": "Selenium is a test tool that allows you to write automated web application UI tests in any programming language against any HTTP website using any mainstream JavaScript-enabled browser. This talk will start with a quick demo of writing/recording automated tests using the Selenium IDE, then discuss how you can use Selenium together with your existing Java tests. We'll discuss how you can use Selenium to effectively test Model-View-Controller web UI applications (using a JSF application as an example), how to write robust tests, and how to structure your tests to make them more reusable.",
    "description": "Key points Introduction to Selenium, with Demo (10m) Unit testing vs. Functional testing (10m) Writing testable web applications (10m) Testing a Model-View-Controller (MVC) framework (20m)",
    "language": "en",
    "speakers": [
      {
        "name": "Dan Fabulich",
        "biography": "Staff Engineer at BEA Systems' Business Interaction Division and a Developer Lead for Selenium ( BEA Systems ) Dan Fabulich is a Staff Engineer at BEA Systems' Business Interaction Division and a Developer Lead for Selenium. He has been writing and running multi-platform automated tests in Java and .NET since 2002, and has specialized in developing automated testing tools and infrastructure. He has a B.S. in Biomedical Engineering and Philosophy from Yale University."
      }
    ],
    "year": 2006
  },
  {
    "title": "The Sun Small Programmable Object Technology (Sun SPOT): Java™ Technology-Based Wireless Sensor Networks",
    "level": "beginner",
    "summary": "The Sun Small Programmable Object Technology (Sun SPOT) is a small wireless sensor that runs a version of Java™ technology called Squawk that is compliant with the Java ME platform. The Sun SPOT platform, developed at Sun Labs, is a small, battery-powered wireless device with an application development environment based on the Java programming language. The Sun SPOT, smaller than a deck of cards, comes equipped with a 32-bit ARM processor and an IEEE 802.15.4 radio for wireless communication. Stackable boards include sensors and actuators such as accelerometers, light detectors, temperature sensors, LEDs, push buttons, and general I/O pins. The devices can be duty-cycled to run for months on a single charge of their rechargeable battery. The small-footprint Java virtual machine, called Squawk, can host multiple applications concurrently and requires no underlying operating system. The full platform includes tools for programming, deploying, configuring, monitoring, and debugging the Sun SPOT network. Join this session and learn all you need to know about Sun SPOT and enjoy the demos.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Angela Caicedo",
        "biography": "Technology Evangelist ( Sun Microsystems ) Angela Caicedo is a Technology Evangelist at Sun Microsystems. Angela's expertise includes: Java ME, Java SE, Java EE, and the entire Sun Java Enterprise System. She loves spending time in new and cool technologies like: Game developments, 3D, bluetooth, smartdust (Sun' SPOTs), and others. She has also presented these topics at developer conferences around the world. Angela graduated from the University EAFIT of Medellin Colombia in 1998 with a B.S. in Computer Science. During 1996-1997 Angela was a visitor student at Center for Educational Computing Initiatives at MIT. Prior to joining Sun, Angela worked for three years as a software developer and researcher at the Swiss Federal Institute of Technology (EPFL), in Lausanne Switzerland, and participated in several European Projects. Angela has also done research on Intelligent Agents which is one of her specialties."
      }
    ],
    "year": 2006
  },
  {
    "title": "Real Time Java and The Mars Rover: Java out of this world",
    "level": "beginner",
    "summary": "JSR-001 is the specification for real-time Java giving extremely low latency response from the JVM even with garbage collection happening. This session will look at the realities of real-time Java, how to write programs that use this functionality and some examples of its application. There will also be a discussion of the Mars rover project that used the real-time Java impplementation to test the use of Java in autonomous extra-terrestrial vehicles.",
    "description": "<TBD>",
    "language": "en",
    "speakers": [
      {
        "name": "Simon Ritter",
        "biography": "( Sun ) Simon Ritter is a Java Technology Evangelist at Sun Microsystems. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K. Originally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon moved to Sun in 1996. At this time he started working with Java technology and has spent time working both in Java technology development and consultancy. He now specialises in looking at emerging technologies including grid computing, RFID, robotics and wireless sensor networks. Simon and his performing LEGO robots have appeared before audiences worldwide."
      }
    ],
    "year": 2006
  },
  {
    "title": "ServiceFrame - advanced Java programming for the mobile and enterprise development",
    "level": "intermediate",
    "summary": "The convergence of the telecom and the IT industry has enabled new and innovative applications and services. Telecom operators are starting to provide open API's (such as OSA / PARLAY and CPA) that the application developers can use to get the position of the mobile, send and receive SMS and MMS, and to set up calls between mobile phones. Most operators today support IP communication (GRPS/3g) with the mobile. The Mobile network and the Internet have thus merged into a technology arena where the IP protocol integrates the different worlds together. This trend will be further strengthened when laptops come equipped with 3g connectivity. The combination of Java enabled (J2ME) mobile phones and GPRS/3g, enables programs running on the mobile phones to communicate with application servers being somewhere on the Internet. In this way a broader market for applications and services is emerging. However, the telecom and the information system industry have different demands on the underlying architecture and communication mechanisms needed to support distributed applications. The telecom industry uses a Peer-2-Peer architecture where the distributed applications communicate asynchronously using messages (objects that contain the information). This is necessary in a world where all parts can take the initiative to a communication and are inherently distributed. The information system industry uses client-Server architecture. This is sufficient where only the client application (user) takes the initiative. In a truly convergent framework both have to be supported, but how can this be done? Ericsson (and now TellU as subcontractor to Ericsson) has as part of the ARTS research project, developed a Java framework (ServiceFrame) designed to become the desired converged technology platform. It can support loosely coupled applications that can be transparently distributed on Java enabled mobile phones as well as on application servers. This talk will present the underlying principles of ServiceFrame and how they are used to bridge the two worlds together.",
    "description": "1.Introduction, (10 min) a.Background, Research project b.Telecom opens APIs, OSA / Parlay c.Convergence of the two industries 2.Network services ( 10 min) a.The difference of the two industries b.Characterizing of services c.Communication style, asynchronous versus synchronous d.Differences in modelling languages, tools and platforms 3.ServiceFrame – a Java framework for service development and execution (20 min) a.Overview b.Concepts used, Actors (UML2.0) c.The execution framework, features, d.Mapping to different Java Technologies (J2ME, J2EE) e.Tools, code generation, hot deployment, viewers f.Examples 4.Summary (5 min)",
    "language": "en",
    "speakers": [
      {
        "name": "Geir Melby",
        "biography": "Partner ( TellU AS ) Geir Melby is partner in tellU, a spin-off from Ericsson founded on the results of several years of research in Ericsson. He holds a master’s degree in Computer Science from Agder University College. Geir Melby was research manager in Ericsson, where he has been responsible for several research projects working on application development, modelling techniques and framework design. Recently has been working on service frameworks specifically targeting the convergence of the telecom and IT sector. He has also experiences from product development especially in the real time domain."
      },
      {
        "name": "Knut Eillif Husa",
        "biography": "Partner ( TellU AS ) Knut Eilif Husa (knut.eilif.husa@tellu.no) is a partner in tellU, a spin-off from Ericsson founded on the results of several years of research in Ericsson. He holds a master’s degree in Computer Science from NTNU. Knut Eilif has 8 years of experience from Ericsson where he has been performing research on service frameworks specifically targeting the convergence of the telecom and IT sector. In Ericsson he has also been involved in development of mobile eCommerce solutions. Previously, he has been working in ABB Corporate Research with several internet related projects. Lately he has been engaged by enCap and has the technical responsibility for the enCap security solution."
      }
    ],
    "year": 2006
  },
  {
    "title": "MSA (JSR 248) and Sun's Java Wireless Toolkit",
    "level": "beginner",
    "summary": "There's a new umbrella JSR coming to town, the Mobile Service Architecture (JSR 248), which groups together many Java ME JSRs, some old and some new. Come and see an overview of this specification, which JSRs it includes and what additional clarifications it holds. See how the Wireless Toolkit supports MSA by implementing the APIs and bringing supporting tools to aid developers in building MSA complaint MIDlets. See the demos that show off the different JSRs that are part of this new umbrella JSR.",
    "description": "Agenda: Overview of MSA New WTK tools to support the JSRs Demos of new APIs",
    "language": "en",
    "speakers": [
      {
        "name": "Richard Gregor",
        "biography": "Software Engineering Manager ( Sun Microsystems ) Richard Gregor is Software Engineering Manager at Sun Microsystems. Since November 2005, Richard has been leading the Sun Java Wireless Toolkit Team, focusing on JSR 248 reference implementation and the next version of the fabulous Sun Java Wireless Toolkit. Richard has been with Sun Microsystems for over 5 years, working also as NetBeans IDE developer in Prague Sun Development Center. In his current role, Richard is responsible for managing of toolkit implementation, innovation and promotion of mobile platforms."
      }
    ],
    "year": 2006
  },
  {
    "title": "Designing Applications for the Mobile Java JSR-232 platform",
    "level": "intermediate",
    "summary": "Next Generation Mobile Java is a platform that brings the service-oriented architecture defined in JSR-232 to the mobile space. The platform promotes the creation of components and services which can be reused and extended, providing at the same time a framework to control their installation, management and security. The platform is built on the foundations of the OSGi framework and the JSR-232 environment. Next Generation Mobile Java provides the developer with a rich environment for the development of applications and services including support for applications using the MIDlet application model. This feature lets MIDP developers leverage their existing expertise and further enrich their applications using product quality services and components supplied by the platform itself or by third-party developers. In this tutorial we will introduce the Next Generation Mobile Java platform and show how applications are supported. We will then focus on the extended MIDlet application model and how it can be used to get the most benefit from the platform. We will show the full development cycle of an application using the MIDlet application model that uses the framework’s features, including shared packages, built-in and external services and the framework’s event bus. We will demonstrate the tools used to package and deploy such applications to a real device. This tutorial aims to introduce the Next Generation Mobile Java and show existing MIDP developers the benefits of the platform, giving them the tools needed to start developing applications for the platform.",
    "description": "1. Introduction, 3m 2. The Next Generation Mobile Java platform architecture, 7m 3. Application Models in JSR-232, 3m 4. Application design using the MIDlet application model, 5m 5. Basics of MIDlets in JSR-232, 5m 6. Use of package sharing, 5m 7. Security, 5m 8. Service consumption, 5m 9. User-interface construction, 7m 10. Packaging and deployment, 2m 11. Summary, 2m 12. Q&A, 10m Duration: 55m Required Experience: Knowledge and interest on MIDP development is expected as well as understanding of component frameworks. Expected audience: The expected audience consists of mobile developers wishing to understand the Next Generation Mobile Java platform as well as enterprise developers that want to extend their applications to the mobile space. Attendants will benefit by getting a first-hand experience on the subject and acquire a broad view of the platform.",
    "language": "en",
    "speakers": [
      {
        "name": "Carlos Quiroz-Castro",
        "biography": "Research Engineer Carlos Quiroz-Castro is a Research Engineer working at the Nokia Research Center in Helsinki Finland. He has worked in several mobile Java related projects and has published several documents and tutorials on the subject at the Forum Nokia website. In 2003 he presented at the JavaOne conference the BOF: “Implementing Multi-Player MIDP 2.0 Games Using Bluetooth”. He has been recently working in the Next Generation Mobile Java platform."
      }
    ],
    "year": 2006
  },
  {
    "title": "Mobispace - et distribuert tuplespace for j2me-omgivelser",
    "level": "intermediate",
    "summary": "The tuplespace programming model is based on the concepts of shared storage and synchronized retrieval. There has been much work on the design of distributed applications over tuplespaces. However, work in the use of tuplespaces in mobile distributed environments is still in its early stages. Our work proposes a system that is targeted at these environments. Our system is called MobiSpace and is implemented in Java 2 Micro Edition. This paper introduces MobiSpaces and discusses our approach taken to consistency and replication, as well as our experiences in implementing our prototype system.",
    "description": "Foredraget vil basere seg på et paper som ble presentert på IASTEDs Parallel and Distributed Computers and Systems, Phoenix, AZ i November 2005.",
    "language": "no",
    "speakers": [
      {
        "name": "Anders Fongen",
        "biography": "Researcher dr.Anders Fongen, forsker ved FFI. E-post: anders@fongen.no. 17 års erfaring som konsulent og programmerer fra industrien, samt 8 års erfaring fra undervisning på høgskole. Forskningsinteresser inkluderer distribuerte programmeringsmodeller, tuplespace, distribuerte søkemotorer og mobil mellomvare."
      }
    ],
    "year": 2006
  },
  {
    "title": "Carrying the Enterprise in your Pocket",
    "level": "intermediate",
    "summary": "Creating standalone applications for your mobile device can be fun, say a tip calculator or currency converter. However, we're talking about a CONNECTED device, so let's build an application that connects to something. Hey, how about our enterprise data center - so for example, I could track the status of my machines from anywhere in the world? And what if I could build that application using a drag & drop visual designer? Get it to seamlessly run on emulators from Nokia, Sprint and others? Better yet, how about using a debugger to walk through the application as it runs on my very own phone? All of this is possible today using NetBeans Mobility. This session is an introduction to J2ME development and demonstrates the features of the NetBeans Mobility Pack.",
    "description": "Creating standalone applications for your mobile device can be fun, say a tip calculator or currency converter. However, we're talking about a CONNECTED device, so let's build an application that connects to something. Hey, how about our enterprise data center - so for example, I could track the status of my machines from anywhere in the world? And what if I could build that application using a drag & drop visual designer? Get it to seamlessly run on emulators from Nokia, Sprint and others? Better yet, how about using a debugger to walk through the application as it runs on my very own phone? All of this is possible today using NetBeans Mobility. This session is an introduction to J2ME development and demonstrates the features of the NetBeans Mobility Pack. Visual Mobile Designer Mobile Client to Web Application Connection Generator Emulator support Preprocessor support for device fragmentation - develop code for any number of devices with a single code base. BlueTooth On Device Debugging Outline An introduction to Java ME (4 minutes) An introduction to NetBeans Mobility (4 minutes) Tutorial - Extending the Enterprise (45 minutes) Visual Mobile Designer (10 minutes) Mobile Client to Web Application Connection Generator (10 minutes) Emulator support (Nokia, SonyEricsson) (5 minutes) Preprocessor support for device fragmentation - develop code for any number of devices with a single code base. (10 minutes) BlueTooth On Device Debugging (10 minutes) Q&A (7 minutes)",
    "language": "en",
    "speakers": [
      {
        "name": "Brian Leonard",
        "biography": "Senior Software Engineer ( Sun ) Brian Leonard works as a senior software engineer with Sun Microsystems. He's been working with application servers before there was a J2EE standard, helping develop applications as well as the servers that run them. Until most recently, Brian's been focused on helping large enterprises implement and deploy highly-available architectures. In his current role, Brian is an evangelist for the NetBeans open source IDE."
      }
    ],
    "year": 2006
  },
  {
    "title": "The mobile as a Java-based security device",
    "level": "intermediate",
    "summary": "Mobile based user authentication has been around for almost a decade, but has never really been a success due to lack of user friendliness, insufficient security or proprietary solutions. This presentation will focus on the emerge of a Java-based security product, which makes the mobile terminal an attractive and accessible security device for any service provider on the internet.",
    "description": "There is a growing demand for cost-effective solutions for secure user authentication. Mobile based user authentication has been around for almost a decade, but has never really been a success due to lack of user friendliness, insufficient security or proprietary solutions. This presentation will focus on the emerge of a Java-based security product, which makes the mobile terminal an attractive and accessible security device for any service provider on the internet. The presentation cover the enCap security product’s Java- and channel architecture, the functions and APIs. Applied technology is Java/JEE on the server side and JME/MIDP on the client side. The use of the new PATS (Program for Advanced Telecom Services)-lab supporting functions will be covered. The PATS-lab is a research agreement between the Norwegian University of Science and Technology (NTNU) Department of Telematics, Ericsson, Telenor and Hewlett-Packard. The experiences from using the PATS-lab and recent pilot-projects will be presented. Why has this been successful choices and what has been the main challenges, from a development point of view? The presentation will also elaborate on how proper authentication and a secure communication channel can boost mobile applications and services. There will be live demonstrations and possibilities for participation from the audience. Bring your mobile!",
    "language": "en",
    "speakers": [
      {
        "name": "Bjørn Sloth",
        "biography": "Marketing Manager ( Systek ) Bjørn Sloth works as a consultant and also as marketing manager in Systek. He holds a bachelor’s degree in Computer Science from University of Colorado and in economics from Norwegian School of Management. Bjørn has, since 1982, been involved in numerous development projects for Norwegian industry, the telecom sector and the bank/finance sector. He has been involved in mobile and mCommerce projects for the past 5 years and ”knows a lot about how the adoption of a mobile service can fail”. He has been the project manager for one of the pilot projects."
      },
      {
        "name": "Knut Eillif Husa",
        "biography": "Partner ( TellU AS ) Knut Eilif Husa (knut.eilif.husa@tellu.no) is a partner in tellU, a spin-off from Ericsson founded on the results of several years of research in Ericsson. He holds a master’s degree in Computer Science from NTNU. Knut Eilif has 8 years of experience from Ericsson where he has been performing research on service frameworks specifically targeting the convergence of the telecom and IT sector. In Ericsson he has also been involved in development of mobile eCommerce solutions. Previously, he has been working in ABB Corporate Research with several internet related projects. Lately he has been engaged by enCap and has the technical responsibility for the enCap security solution."
      }
    ],
    "year": 2006
  },
  {
    "title": "Emnekartdrevet innbyggerportal for Bergen kommune",
    "level": "beginner",
    "summary": "Case study av Bergen kommunes nye innbyggerportal basert på emnekart. Datagrunnlaget for portalen er fagsystemer, innhold fra publiseringsløsningen Escenic og eksterne kilder (LivsIT, Nasjonal Tjenestekatalog); alt dette sys sammen automatisk for å produsere portalen. Presentasjonen forklarer hva emnekart er, gir litt bakgrunn for prosjektet og beskriver selve den tekniske løsningen (arkitektur, datamodell og integrasjon) samt hvordan den resulterende portalen ser ut.",
    "description": "Hva er emnekart (8 minutter) Kort om prosjektet (2 minutter) Om løsningen (20 minutter) Konseptuel arkitektur Hva brukes emnekart til (og hvordan) Integrasjon mellom emnekartmotor fra Ontopia og publiseringsløsning fra Escenic. Hvordan er søk i portalen løst Erfaringer (10 minutter) Hva var suksess Hva var ikke Oppsummering Required experience: Ingen spesielle Expected audience: Alle som er interessert i nye konsepter",
    "language": "no",
    "speakers": [
      {
        "name": "Øyvind Litlere",
        "biography": "Systemarkitekt ( Bouvet ) Øyvind Litlere. Arbeider ved Bouvet i Bergen. Prosjektleder for implementasjon av ny innbyggerportal I Bergen kommune. Har bakgrunn som utvikler, prosjektleder og systemarkitekt."
      },
      {
        "name": "Geir Ove Grønmo",
        "biography": "Sjefsarkitekt ( Ontopia ) Sjefsarkitekt hos Ontopia. Har vært hovedutvikler for Ontopias emnekartprodukter siden oppstarten i 2000, og har også bidratt i flere emnekartprosjekter. Har skrevet tre emnekartmotorer, og flere open source-produkter rundt XML. Utdannelse som grafisk ingeniør."
      }
    ],
    "year": 2006
  },
  {
    "title": "Secure Public Portal for Service Aggregation",
    "level": "intermediate",
    "summary": "MyPage is a central part of the Norwegian governmental strategy to make everyday life simpler for most people by establishing a common gateway for electronic dialogue with the government. According to the “eNorway 2009 – the digital leap” IT strategy roadmap, all new public services should be made accessible through MyPage. By 2007 it should be established an electronically communication channel between citizen and public services as an alternative to the traditional channels. By 2009 all interactive public services should be reachable in MyPage. As a part of the same initiative there is established a common PKI infrastructure, “The Security Portal” which can authenticate all Norwegian citizens based on open standards like Liberty/SAML. This also enables single-sign-on, federation between all service providers sharing this security context.",
    "description": "The MyPage portal is a virtual service office, a web portal for easy access to aggregating all public services accessible on the Internet. It provides an intuitive and easy way to navigate and search for information, and insight into data that the public authorities have registered on each individual citizen. MyPage offers several personalized services for the citizen, and the citizen can themselves choose which service and that are relevant in their personal profile. Among the services offered in MyPage is register, transactional, messaging, calendar. The register service gives the citizen insight into data stored by the public authorities. The transactional service provides a single-sign-on feature across external services and service providers. The messaging service is a two way communication channel between the public authorities and the citizen, exchanging all kind of personal information, documents, schemas etc. The calendar service gives a personal view into all important personal dates between the citizen and the public authorities. MyPage is build on top of a portal framework based on java, and J2EE running on Solaris. The architecture is SOA enabled to easy aggregate new services at runtime. Web Services is used for inter service provider communication and exchange of data. There is ongoing work to support additional types of services like municipality services etc. within MyPage. The number of integrated services and service provider is most likely to increase heavily in the years to come. Required experience: Some knowledge about security, SSO, portals, Web Services, XML, XSL. Expected audience: Some interested in the above, and those who are interested in the development of the Norwegian citizen portal \"MinSide\", or a generic portal addressing the issues listed above.",
    "language": "en",
    "speakers": [
      {
        "name": "Stein Myrseth",
        "biography": "Technical architect ( Software-innovation ) I have been the solution and technical architect from the very start of the MyPage project. And I'm still working in the project defining, and designing new versions."
      }
    ],
    "year": 2006
  },
  {
    "title": "Technical case study: The architecture of InfoQ.com- global enterprise development community",
    "level": "intermediate",
    "summary": "InfoQ.com is a next generation web app/portal implementation combining the latest advancements in portal technology (JSR 170) and web development (WebWork, Spring, AspectJ). This session will walk the viewer through the good, the bad, and the ugly of building InfoQ.com. Walk with us from initial requirements (or lack theoreof), designs, implementation choices, and deployment issues, and all the lessons learned along the way. The talk will examine some of the most interesting features of the site and show their implementation in the web layer, domain model, and DB. The audience should expect an educating and revealing presentation on how to transition from standard web development paradigms to modern tag-driven CMS approaches.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Floyd Marinescu",
        "biography": "co-founder of InfoQ.com ( InfoQ.com ) Floyd Marinescu is co-founder of InfoQ.com and was also previously the creator of TheServerSide.com and TheServerSide Java Symposium conferences. Floyd is the author of the best seller \"EJB Design Patterns\" (2002, John Wiley and Sons). Floyd also publishes a blog on Enterprise Java topics at http://dynamicsemantics.blog-city.com/."
      },
      {
        "name": "Alexandru Popescu",
        "biography": "Chief-Architect ( InfoQ.com ) Alexandru Popescu is Chief-Architect of InfoQ.com. Alexandru is involved in many open source initiatives and bleeding-edge technologies (AOP, testing, web, etc.), being co-founder of the TestNG Framework and a committer on the WebWork and Magnolia projects. Alexandru formerly was one of three committers on the AspectWerkz project before it merged with AspectJ. Alexandru also publishes a blog on tech topics at http://themindstorms.blogspot.com/."
      }
    ],
    "year": 2006
  },
  {
    "title": "Development Environment and Architecture for the Enterprise",
    "level": "beginner",
    "summary": "Rikstrygdeverket valgte, i 2001, J2EE med IBM som leverandør, som strategisk plattform for modernisering. Rikstrygdeverket er en stor organisasjon med et svært heterogent applikasjonmiljø og mange samtidige prosjekter av forskjellig størrelse og omfang. I tillegg er det mange forskjellige leverandører inne på forskjellige prosjekter. I Rikstrygdeverket har vært at det er mange prosjekter som kjører og mange leverandører som er inne og leverer disse prosjektene. En stor utfordring har vært å skape en effektiv og standardisert utviklingsarkitektur som understøtter både god kvalitet, standardisering, produktiv utvikling og ikke minst ensartet deployment og konfigurering. Foredraget vil se på hvordan Rikstrygdeverket har bygge et utviklingsmiljø og utviklingsarkitektur for å effektivisere utviklingen og supportere mange paralelle prosjekter i en stor og kompleks infrastruktur sammensatt av mange forskjellige applikasjoner. Dette for å sikkre kvalitet i leveranser og holde orden på versjoner av applikasjonene kjørende i de ulike miljøene.",
    "description": "- Introduksjon - Dagens situasjon - Utfordringer - Løsningen - Resultater og erfaringer - Videre arbeid og utfordringer - Oppsummering - Spørsmål Required experience: Kjent med Java/JEE Expected audience Utviklere Arkitekter",
    "language": "no",
    "speakers": [
      {
        "name": "Thomas Kvalvåg",
        "biography": "Arkitekt ( Accenture ANS ) Utdanning: Master of Science - Distributed Mulitmedia Systems Erfaring: Har jobbet 6 år i Accenture med hovedfokus på Java/J2EE platformen. 4+ års arkitekturerfaring på platformen. Har jobbet for Rikstrygdeverket i 2,5 år, her hovedsaklig som arkitekt for utviklingsarkitektur. Hovedintresser: - Utviklingsarkitektur - Integrasjonsakriktektur - Java/JEE Arkitektur"
      },
      {
        "name": "Lars Moen",
        "biography": "Arkitekt ( Rikstrygdeverket ) Utdanning: Høgskoleingeniør, videreutdanning Institutt for Informatikk, Universitetet i Oslo Erfaring: 8 års erfaring med utvikling og arkitektur. Jobbet 4 år som arkitekt i IT-Avdelingen i RTV som fagansvarlig for J2EE-plattformen. Arkitekt, utvikler og kvalitetssikrer på diverse prosjekter. Tidligere jobbet i CSC og Newmad Technologies. Hovedinteresser: - Enterprise Architecture - Development Architecture - Integrasjonsarkitektur - Storskala systemer."
      }
    ],
    "year": 2006
  },
  {
    "title": "Et liv etter leveransen før leveransen",
    "level": "beginner",
    "summary": "Systemutvikling med fokus på drift og vedlikehold blir ofte forsømt av mange i dag. Dette skjer ofte på grunn av press på tid og økonomi, men også fordi man benytter verktøy som ikke er laget eller er velegnet for en drifts- og vedlikeholdssituasjon. Foredraget vil peke på en del ting som kan gå feil og som man bør tenke på. Eksempler er hentet fra relle prosjekter. Målet er å belyse områder som mange ikke tenker på til daglig, men som man bør fokusere mer på fremover.",
    "description": "Introduksjon (5 min) bakgrunn og erfaringer Anders Bjørnestad Problemområdet, konsekvenser, eksempler (30 min) Feller og feil, tips og triks (10 min) hva bør man tenke på hva bør man se etter Oppsummering (5 min) Q&A / diskusjon",
    "language": "no",
    "speakers": [
      {
        "name": "Anders Bjørnestad",
        "biography": "Seniorkonsulent ( Webstep ) Seniorkonsulent i Webstep med hovedfokus på systemutvikling og arkitektur med Java som plattform. Spesielle interesseområder innen løsningsorienterte oppgaver i grensesnitt mellom teknologi og forretningsprosesser. Bred erfaring fra prosjekter innen offentlig og privat sektor. Har holdt foredrag om server-basert java i inn- og utland tidligere."
      }
    ],
    "year": 2006
  },
  {
    "title": "Distributed middleware factory.",
    "level": "intermediate",
    "summary": "In year 2000 Telenor established a new middleware integration platform for it’s fixed-line service. At present this platform is running over 60 different java enterprise applications developed by teams distributed around the company and the world. The platform integrates with over 50 of Telenor’s back-end systems. To support the developer teams, a centralized platform team has created a common application architecture backed by a standardized development process, tools, guidelines and runtime platform. The name of this platform is Metro and it acts as a distributed middleware factory! In this talk we’ll share our experiences from this process and some secrets from the past 6 years!",
    "description": "Outline of \"(Evolution of a) Distributed Middleware Factory\" What is a Distributed Middleware Factory? Epochs in Metro history Epoch 0 - Medieval Age - Kings and Kingdoms - Technologies Epoch 1 - Gunpowder Age - Distributed development model - Distributed vs. centralized model - Technology at the base - Layered architecture - Informal roles - Test Environments - Statistics Epoch 2 - Enlightenment - The 80/20 rule - Boiling soup on stone - Metro Roadmap - Roadmap in Jira Epoch 3 - Industrial Age - Documenting standards - We use Open Source - Leading Star Example - Automation through 3th party tools - Automation through self-made tools - Metro Certification - Certification benefits - Certification content Epoch 4 - Modern Age - Commercialization - Service Level Agreements - Code Quality - Continous Architecture Review - Application Monitoring - Automatic configuration, deployment and environment setup Key tools Key lessons Questions? Required experience: Knowledge of Java enterprise development and platforms, interest for project and platform management Expected audience: Project leads and developers involved in large development and distributed environments, looking for a sound development methodology Expected audience: Project leads and developers involved in large development and distributed environments, looking for a sound development methodology",
    "language": "en",
    "speakers": [
      {
        "name": "Paul René Jørgensen",
        "biography": "Work experience: 5 years of experience from Telenor Interests: Building stuff"
      },
      {
        "name": "Ramón Arellano",
        "biography": "( Accenture ANS ) Work experience: 5 years of experience as a technical consultant from Accenture Interests: RC Helicopters"
      }
    ],
    "year": 2006
  },
  {
    "title": "The Agile Architects: Stumbling from Cargo Cult Architecture Towards Agility",
    "level": "intermediate-advanced",
    "summary": "Agile principles state that architecture should evolve in an incremental manner, continually adjusting to the requirements at hand. There is no room for Big Design Up Front, the traditional way of designing architecture top-down. So, is there room for an agile architect? This session adresses the role of the architect in agile development projects. As architects in a large project that has introduced agile methods in a previously waterfall-oriented organization, the speakers have struggled with finding the role of architecture in an agile project. It has been a journey from a world where the architect is a godlike superbeing ruling developers with an iron fist to a world where the challenge is finding out how to humbly help the developers do their job. We will talk about the biggest challenges, success stories and experiences - what we did, and what we wish we had done.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Johannes Brodwall",
        "biography": "Lead Software Architect at BBS ( BBS ) Johannes Brodwall is a veteran speaker at JavaZone. He currently works at BBS where he aims to improve the way the company develops software. He is one of Norway's most prominent advocates of test-driven development and other agile methods."
      },
      {
        "name": "Trond Arve Wasskog",
        "biography": "CTO and Architect ( Bekk ) Trond Arve Wasskog is an architect working at Bekk Consulting. He has been involved in Java and J2EE application development for more than ten years, focusing on agile software development, testing and quality. Currently he is the competency lead at Bekk Consulting, responsible for competency development and managing the Technology competency groups."
      }
    ],
    "year": 2006
  },
  {
    "title": "Things I've learned that have made me a better developer than I was before I learned them",
    "level": "beginner-intermediate",
    "summary": "In my years as a developer and an architect, I have found that there are many tricks that can boost my productivity and value considerably. Some of these tricks are written down in various books, many are not. The talk aims to give beginners through intermediate developers ideas about how to improve the way they work. The talk covers aspects from writing better code, to writing better emails. The talk will be light and easy, with only an occasional dive into quantum mechanics (or maybe not)",
    "description": "Intro: Are you a coder or a developer? (5 minutes) Thinking better (10 minutes) Asking the right question Effective planning Talking better (10 minutes) Writing better emails and documents Agreement through conflict Coding better (15 minutes) Shortening the feedback loop Idiomatic programming Getting better (10 minutes) How much time to spend learning? When are you done learning?",
    "language": "en",
    "speakers": [
      {
        "name": "Johannes Brodwall",
        "biography": "Lead Software Architect at BBS ( BBS ) Johannes Brodwall is a veteran speaker at JavaZone. He currently works at BBS where he aims to improve the way the company develops software. He is one of Norway's most prominent advocates of test-driven development and other agile methods."
      }
    ],
    "year": 2006
  },
  {
    "title": "Domain-logical Value Objects - a Bottom-Up Technique in Domain Driven Programming",
    "level": "intermediate",
    "summary": "The main goal of Domain Driven Design (DDD) is to make the system design to reflect and model the reality. However, faced with an already existing system that does not honor this, it might be hard to know where to start. A transition to DDD might then be percevied as a change to make, even considered the values it might add. The technique of domainlogical value-objects is a method for domain-driven programming that stays close to the code. The major advantage is that takes no immediate changes of the structural level of the code, but can be applied with a very small initial effort. In that way, it is possible to very fast start reaping some of the fruits of the domain driven approach, e g more structured in-data validation, more expressive service-APIs and clearer code in the buisiness logic (often EJBs or similar). I this session we present domain-logical value objects, and how you write and use them in practice. The concrete code examples are in Java, but the idéas and techiques can just as well be applied to code written in C++/C, VB or Ruby. The session is based on the speaker´s expericence of improving already-developed code and systems.",
    "description": "(5 min) Introduction/ Mindset / Domain Driven Design Fundamental ideas When a good idea or not (5 min) Green-field projects vs. existing code-base The challenges of a poor-quality code-base (10 min) Introducing DLVO through some examples Established Value objects (Integer, String etc) Standard general purpose domain value objects (e.g. Date (hmm...) and Currency) User-defined DLVOs (5 min) DLVO effect on in-data validation/error handling (5 min) DLVO effect on service API clarity (extensibility of client tiers) (5 min) DLVO effect on business-logic tier code (extensibility of application tier) (5 min) DLVO effect on testability (5 min) How to identify candidates for DLVO (5 min) Next step - taking the methodology further Composed domain logical value objects Habitat of more advanced computations",
    "language": "en",
    "speakers": [
      {
        "name": "Dan Bergh Johnsson",
        "biography": "Programmer, System Architect and Consultant ( Omegapoint AB ) Dan Bergh Johnsson, programmer, system architect and consultant at Omegapoint AB, Sweden. Since the time as \"assisting teacher\" at the computing science department at Uppsala University, Dan has propagated for \"Code that Mean Something\" (as opposed to just doing it). Nowadays, this is reflected as an interest for high-quality system development, with unit-testing, DDD and agile methods as some specialities. Dan is also a recurring speaker at conferences at national and international level, such as Colorado Software Summit and JavaZone (2002 and 2003)."
      }
    ],
    "year": 2006
  },
  {
    "title": "Gode (og ikke fullt så gode) grep når prosjektet blir stort",
    "level": "beginner",
    "summary": "Presentasjonen er en erfaringsutblåsning fra STAY, BBS sitt store omleggingsprosjekt, der stormaskin/COBOL fases ut til fordel for UNIX/Java. Som mange andre av dagens programvareprosjekter har STAY hentet inspirasjon fra metodikker som Extreme Programming (XP), Test-Driven Development (TDD) og Domain-Driven Design (DDD). Målet ved prosjektstart var å følge prinsipper som korte iterasjoner med påfølgende release, delt kodeeierskap, automatiserte tester med mer.",
    "description": "Presentasjonen er en erfaringsutblåsning fra STAY, BBS sitt store omleggingsprosjekt, der stormaskin/COBOL fases ut til fordel for UNIX/Java. Som mange andre av dagens programvareprosjekter har STAY hentet inspirasjon fra metodikker som Extreme Programming (XP), Test-Driven Development (TDD) og Domain-Driven Design (DDD). Målet ved prosjektstart var å følge prinsipper som korte iterasjoner med påfølgende release, delt kodeeierskap, automatiserte tester med mer. Men det er ikke bestandig like enkelt med teori og praksis når man skalerer opp et prosjekt fra noen få, til flere titalls utviklere? Hvilke prinsipper kan man lempe litt på og hvilke er det viktig å holde på? For eksempel: Hvor viktig er det egentlig med delt kodeeierskap? Hvor langt skal man gå når det gjelder automatiserte tester? Skaper ”Continuous Integration” (CI) mer trøbbel enn nytte? Presentasjonen drøfter forskjellige ”grep” som er tatt for å holde på en del prinsipper? Hvilke prinsipper er nedprioritert? Og hvilke konsekvenser har det fått?",
    "language": "no",
    "speakers": [
      {
        "name": "Eirik Torske",
        "biography": "Softwareutvikler ( BBS ) Eirik Torske har jobbet som utvikler hos Bankenes Betalingssentral (BBS) siden 2004. Han har hovedfag i informatikk fra UiO, og har jobbet i større og mindre Java-prosjekter siden 2000."
      }
    ],
    "year": 2006
  },
  {
    "title": "Testing & Test Driven Development – How to get what the preacher promised.",
    "level": "intermediate",
    "summary": "Over the last few years, anyone involved in software development probably (or at least should) have been reminded on numerous occasions of the importance of testing, TDD, test-first, coverage, automated integration testing, etc. It is widely accepted that focus on testing and test driven development increases software quality on many different levels. One could even say that if you don't have a firm grasp of testing, you're probably in the wrong business. However testing often proves more difficult than the standard \"bowling pin score card\" example would make you believe. Some real life scenarios prove hard and time-consuming to test, and over time tests can prove fragile and cause problems when refactoring or doing even minor changes, especially when the code base grows large. The problems we see are often related to: - External dependencies/extended use of mocking - Tests that rely heavily on resources, environment variables, properties etc. - Unit-testing integrations - Bad, ugly and undocumented test code - Poor test code structure Through real-life examples we aim to demonstrate how and why some of these problems occur, and outline techniques and patterns to help avoid them. This talk will stop hair loss due to pulling your hair out in frustration by showing you how to reap all the test benefits the evangelists have told you about.",
    "description": "Introduction(5 minutes) Intention of talk -What do we want to achieve through testing? Problem/Solution(35 minutes) Show by examples: - Common problems - Why they occur - What they will lead to - How to avoid them Conclusion(10 minutes) Conclude with some basic rules / patterns to follow. –How to achieve through testing. Q&A(10 minutes) Try to get some discussion going. Information Required experience: Some experience with software development and (unit-)testing Expected audience: Everyone. Main benefit will be a better understanding of the importance of test quality, and how to achieve it.",
    "language": "en",
    "speakers": [
      {
        "name": "Eivind Waaler",
        "biography": "Manager ( Bekk Consulting AS ) Eivind Waaler is a Manager and Technology Group leader in Bekk Consulting AS. His main focus areas are Java and J2EE technology, and he is currently in charge of the BEKK Open Source Software (BOSS) initiative. Eivind has held presentations on the three last JavaZone conferences."
      },
      {
        "name": "Christian Hauknes",
        "biography": "Consultant ( Bekk Consulting AS ) Christian Hauknes is a Senior Consultant for Bekk Consulting AS. He mainly works with Java and J2EE, with a special focus on testing and agile methods. He is currently the leader of Bekk Agile Movement."
      }
    ],
    "year": 2006
  },
  {
    "title": "Når skal vi bruke hodet og når skal vi bruke estimeringsmodeller?",
    "level": "intermediate",
    "summary": "Studier fra andre fagfelt viser gang på gang at enkle matematiske modeller som oftest har langt mer nøyaktige estimater enn eksperter. Selv modeller av ekspertvurderinger fungerer stort sett bedre enn ekspertene de modellerer.Resultater fra studier innen estimering av software utvikling er ikke like entydige.",
    "description": "Professor Magne Jørgensen og Stein Grimstad oppsummerer studier som sammenligner estimeringsmodeller (COCOMO, Use Case Points, etc) og ekspert-estimering, og viser i hvilke situasjoner det lønner seg å stole på ekspertene, når vi bør basere estimatene på modeller, og når det kan lønne seg å kombinere estimater fra eksperter og modeller. De vil også oppsummere arbeid på hvordan man finner fram til de beste estimeringseskpertene.",
    "language": "no",
    "speakers": [
      {
        "name": "Magne Jørgensen",
        "biography": "( Simula Research Laboratory ) Magne Jørgensen received the Diplom Ingeneur degree in Wirtschaftswissenschaften from the University of Karlsruhe, Germany, in 1988 and the Dr. Scient. degree in Informatics from the University of Oslo, Norway in 1994. He has 10 years’ industry experience as a software developer, project leader and manager. He is now Professor in Software Engineering at the University of Oslo and a member of the software engineering research group of Simula Research Laboratory in Oslo, Norway. He has published many articles in international journals on software cost estimation. He has supported work on the improvement of software project estimation and has been responsible for estimation training in several software companies."
      },
      {
        "name": "Stein Grimstad",
        "biography": "( Simula Research Laboratory ) Stein Grimstad received the MSc degree in Informatics from the University of Oslo, Norway in 1998. He has 7 years’ industry experience as software developer and solution architect. He is now a PhD-student in Software Engineering at the University of Oslo, and is a member of the software engineering research group of Simula Research Laboratory in Oslo, Norway. He also works part-time as an advisor at Objectnet. His research interests are software engineering and, in particular, software cost estimation."
      }
    ],
    "year": 2006
  },
  {
    "title": "The Agility Cube: Six Faces of Agile Development",
    "level": "beginner",
    "summary": "Agile development is a phrase that it appears no buzzword-compliant software development project can be without. However, it is a proper understanding of the motivation and practices, rather than the buzzword conformance, that makes the actual difference in development.",
    "description": "The notion of agility has differing (mis)interpretations and (ab)use. Sometimes it is used as a synonym for Extreme Programming. By contrast, other people use it to mean a generic notion of something that is not quite Extreme Programming, but may borrow ideas from it. Some developers may label a project agile just based on the occasional use of JUnit. Others may use the label to justify not writing any documentation or to avoid agreeing on scope or delivery dates. To be fair, not all uses of the term are cynical or misguided, but the term has lost some of its potency through dilution. This session revisits the motivation for agile development, and goes on to explore the wide-range of perspectives that are encompassed by approaches that can claim to be agile, including both technical and non-technical aspects, in the large and in the small. The six faces of agility presented are the practices, organisation, architecture, tools, skill and attitude. And, like a cube, it is all too easy to focus on a couple of the faces without seeing the rest. Audience: Developers and managers, all levels",
    "language": "en",
    "speakers": [
      {
        "name": "Kevlin Henney",
        "biography": "Kevlin Henney is an independent consultant based in the UK. He specialises in programming languages, OO design, patterns, development process and software architecture, helping teams adopt techniques and improve their software development through mentoring, reviewing and training. He has been a columnist for various magazines and is currently a columnist for the Reg Developer channel of The Register."
      }
    ],
    "year": 2006
  },
  {
    "title": "Design dead systems",
    "level": "intermediate",
    "summary": "Prominent enterprises have lost their competitive advantage due to poor quality development practices. Most enterprises have core, infrastructure, and legacy systems. These core systems are an integral part of most new functionality. These core systems all have similar characteristics: they are fragile, have inadequate testing frameworks, and there are only a few developers left that know how to maintain and enhance them.",
    "description": "How did these core systems get into this condition? The enterprises built this problem into them, release by release. The engineering reasons have been exposed by Agile processes. As releases are built iteratively, each increment makes transparent the underlying quality problems that lead to these design and quality dead core systems. As we have tried to fix these quality problems, the underlying roots in dysfunctional customer-developer relationships that cause the poor quality have been exposed. We will discuss what enterprises can do to fix this quality problem and restore competitive advantage, and how hard it is to do so.",
    "language": "en",
    "speakers": [
      {
        "name": "Ken Schwaber",
        "biography": "Ken Schwaber co-developed the Agile process, Scrum. He is a founder of the Agile Alliance and Scrum Alliance, and signatory to the Agile Manifesto. Ken has been a software developer for over thirty years. He is an active advocate and evangelist for Agile processes."
      }
    ],
    "year": 2006
  },
  {
    "title": "Planning Poker – Playing for better estimates",
    "level": "intermediate",
    "summary": "Planning Poker is an agile technique for combining user-story and task estimates of different experts, Empirical research has found that combining the opinions of different experts is a cost-effective way of increasing estimation accuracy. In addition, Planning Poker can ease planning, increase team commitment and reduce the risk of miscommunication. This talk will teach you how Planning Poker works, why it works, and when it does not work. The talk not only explores a technique, but also tries to explain underlying psychological aspects related to the behaviour of groups. Finally, variations you may consider when introducing Planning Poker at your project are discussed, as well as alternatives to Planning Poker.",
    "description": "(5 min) The crowd: mad or wise? (10 min) How does planning poker work? (10 min) Why does planning poker work? (5 min) When does planning poker not work? (5 min) Variations of Planning Poker : (10 min) o Estimating story points vs. ideal days o Fixed vs. flexible estimates o Consensus vs. average Alternatives to planning poker (5 min) Q&A (10 min) Full abstract Empirical research has found that combining the opinions of different experts is a cost-effective way of increasing estimation accuracy. However, the main challenge for software professionals is often when, and how, to combine expert opinion. At what stage in the process? Which experts should be involved? How many experts? How much formalism is sensible to use? Group processes is one of the most studied aspects of psychology, and “The crowd” as groups frequently is called, has both been labelled as mad and hailed as wise in various bestselling books. Group processes have a high relevance for software projects, especially concerning estimating and planning. Regrettably, due to misinterpretation of psychological research, a common misconception in software engineering textbooks has been that groups are “mad”, and that formal procedures are required in group estimation. However, recent research papers and textbooks in software engineering challenge this view, and indicate that a straight-forward combination of expert estimates through group discussion may increase estimation accuracy. Planning Poker is an agile technique for combining user-story and task estimates of different experts. It is an easy to use method that employs a semi-structured group discussion process with minimal formalism and overhead. In our experience, Planning Poker is an effective method for increasing estimation accuracy. It also eases the planning of projects, increases team commitment and reduces the risk for miscommunication. This talk will teach you how Planning Poker works, why it works, and when it does not work. The talk not only explores a technique, but also tries to explain underlying psychological aspects related to the behaviour of groups. Finally, variations you may consider when introducing Planning Poker at your project are discussed, as well as alternatives to Planning Poker. Required experience: Participants should have experience with estimating software tasks, but as the talk has a mainly psychological perspective, it is equally suited for all levels of software expertise. Expected audience: Developers, Project Managers, Project owners, Business strategists and Process Improvement Specialist",
    "language": "en",
    "speakers": [
      {
        "name": "Nils Christian Haugen",
        "biography": "Chief Scientist ( Objectnet ) Nils Christian Haugen is chief scientist at Objectnet and an agile developer and coach. He has been working with large distributed object-oriented applications for companies in various industries since 1998. Nils Christian has enjoyed working with XP/Agile teams at ThoughtWorks, and is an experienced speaker on topics in Java and Agile software development at national and international conferences. He holds an MEng degree in computer science from the Norwegian University of Science and Technology."
      },
      {
        "name": "Kjetil Moløkken-Østvold",
        "biography": "Assistant director ( Simula Research Laboratory ) Kjetil Moløkken-Østvold is an assistant director at Simula Research Laboratory in Norway. He received his MSc and PhD degrees in informatics from the University of Oslo, Norway, in 2002 and 2004, respectively. He has a bachelor degree in psychology from the University of Oslo. His main research interests are software estimation, group processes, management of public projects and software process improvement."
      }
    ],
    "year": 2006
  },
  {
    "title": "Beyond Agile Software Development: Becoming Lean",
    "level": "beginner-intermediate",
    "summary": "Lean thinking has had a dramatic effect on industries from manufacturing to banking to hospitals. In software development, lean principles lead us inevitably to agile software development – and beyond. Lean is not just about iterative development, it is about transforming customer needs into deployed software rapidly, reliably, and repeatedly. Lean is not about slowing down and being careful, it’s about catching errors the moment they occur so that you can reliably go fast. And finally, lean is about taking a look at the amount of work you have piled up in lists and queues – with an eye to getting rid of the queues entirely. This presentation deals with aspects of lean that you might not have thought about while implementing agile software development practices. It will challenge development teams to think differently about the way they approach their work.",
    "description": "Principles of Lean Just-in-Time – What does this mean in software development? Stop-the-Line – How does this actually work? Whole Team, Complete Product What is a value stream? What is a team? Go Fast Why Quality, Speed, and Low Cost go together How Queuing Theory works in software development",
    "language": "en",
    "speakers": [
      {
        "name": "Mary Poppendieck",
        "biography": "Writer and speaker ( Poppendieck.com ) Mary Poppendieck has been in the Information Technology industry for thirty years. She has managed solutions in software development, supply chain management, manufacturing operations, and new product development. She spearheaded the implementation of a Just-in-Time system in a video tape manufacturing plant, resulting in dramatic improvements in the plant's performance. Mary’s team leadership skills were honed in 3M, where new product development is a core competency. Her teams commercialized products with embedded software three times faster than normal, often partnering with small suppliers in the process. A popular writer and speaker, Mary’s classes apply lean principles to Software Development problems and offer a fresh perspective on software development processes. Her book Lean Software Development: An Agile Toolkit was awarded the Software Development Productivity Award in 2004. Abstract Beyond Agile Software Development: Becoming Lean Lean thinking has had a dramatic effect on industries from manufacturing to banking to hospitals. In software development, lean principles lead us inevitably to agile software development – and beyond. Lean is not just about iterative development, it is about transforming customer needs into deployed software rapidly, reliably, and repeatedly. Lean is not about slowing down and being careful, it’s about catching errors the moment they occur so that you can reliably go fast. And finally, lean is about taking a look at the amount of work you have piled up in lists and queues – with an eye to getting rid of the queues entirely. This presentation deals with aspects of lean that you might not have thought about while implementing agile software development practices. It will challenge development teams to think differently about the way they approach their work. Level The talk will be appropriate for any level. Outline Principles of Lean Just-in-Time – What does this mean in software development? Stop-the-Line – How does this actually work? Whole Team, Complete Product What is a value stream? What is a team? Go Fast Why Quality, Speed, and Low Cost go together How Queuing Theory works in software development."
      }
    ],
    "year": 2006
  },
  {
    "title": "Introduction to Abstraction Architectures for Business Intelligence",
    "level": "beginner",
    "summary": "Business owners across the world are investing more and more in Business Intelligence (BI) solutions. It is the #1 or #2 IT spending priority in many companies. Business Intelligence realizes the promise of IT: that information systems will help businesses run better. This presentation is designed for technologists and technology managers who wish to learn more about the role of BI within an IT department, what the different components of an abstraction architecture consist of, and what open source technologies can be used to implement these components. The architecture is explained using a case study based on the need for regional hospital systems to: Realize emerging trends and patterns dynamically within and cross hospital systems Establish and evaluate trending thresholds Proactively notify appropriate resources when thresholds are crossed Provide data and information for advanced ad-hoc analysis Integrate multiple, disparate source systems with minimal coding or overhead Provide for \"Enterprise transactions\" that exist beyond a single transactional system This case study is based on a system designed by the author for the Vanderbilt University Medical Center to track SARS and Avian Flu pandemics.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Dean Reynolds",
        "biography": "Information Architect ( Corrections Corporation of America ) Dean Reynolds has built Enterprise-class systems for several large universities and companies in the U.S. He is currently working as Information Architect for the Corrections Corporation of America, an interesting industry with many unique challenges. A database specialist by trade, Dean has also spent many years as a developer. He is the successful author of Confessions of an IT Hitman at ITtoolbox.com where he discusses topics on BI, databases, and other IT related topics. To learn more about how Dean thinks, you can read his manifesto."
      }
    ],
    "year": 2006
  },
  {
    "title": "You can't go wrong with beige",
    "level": "beginner",
    "summary": "Følelser. Brukere. Opplevelser. 50 millisekunder! Noen mener at dette er tiden en portal har til å fange en brukers oppmerksomhet. Vise seg fra sin beste side. Ihvertfall hvis det er snakk om eksterne brukere. Verdens vakreste tekniske løsning forblir den \"stygge andungen\" om ikke presentasjonslaget og brukeropplevelsen tas minst like seriøst som programmeringsteknikker og integrasjonsrammeverk. Kampen om oppmerksomhet gjelder ikke bare overfor brukerne, men også overfor portalens sponsorer og eiere - de som skal realisere sin konkurransekraft gjennom f.eks. en virksomhetsportal. Å forankre et slikt strategisk viktig IT-prosjekt hos ledelsen og andre sentrale ressurspersoner er en stor utfordring, men også en betydelig suksessfaktor. Foredraget tar for seg temaene brukeropplevelse, forretningsmessig nytteverdi og forankring. - med trender og eksempler. Det legger vekt på de ikke-tekniske sidene ved en virksomhetsportal, og betydningen av disse.",
    "description": "Portalens fallgruver/suksessfaktorer: Brukeropplevelse, nytteverdi og forankring - intro (5 minutter) 50 millisekunder (5 minutter) Hva er det som gir et godt førsteinntrykk? (15 minutter) Hvordan det virkelig er og hvordan det oppfattes at det er (5 minutter) Hvordan få dette til? (5 minutter) Forretningsmessig nytteverdi (5 minutter) Strategisk rammeverk, viktige veivalg (10 minutter) Forankring - opp, ned og til siden (5 minutter) Trender (5 minutter) Oppsummering",
    "language": "no",
    "speakers": [
      {
        "name": "Kristin Halvorsen",
        "biography": "Rådgiver og CKO i Objectware ( Objectware ) Kristin Halvorsen. Rådgiver og CKO i Objectware. Jobber i grenseland mellom forretning og IT, spesielt innen virksomhetsportaler og knowledge management. Jobbet som konsulent/rådgiver i 11 år. Utdannet siv.ing data - informasjonssystemer."
      },
      {
        "name": "Helge Tennø",
        "biography": "Kreativ rådgiver ebusiness i Virtual Garden Screenplay ( Virtual Garden Screenplay ) Kreativ rådgiver ebusiness i Virtual Garden Screenplay. Utdannet fotograf fra University of Glocestershire. Har også studert Data- og multimedieteknikk Han har jobbet med design i interaktive medier siden 2000."
      }
    ],
    "year": 2006
  },
  {
    "title": "Unleash the power of Java!",
    "level": "beginner",
    "summary": "So you thought you'd seen it all? Come to this session to see some truly remarkable demonstrations of Java in action in ways you'd probably never thought of. We'll have some cool Java powered hardware being used to control a range of devices and applications in the most unusual ways. Want to know more? Come to the session and find out!",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Angela Caicedo",
        "biography": "Technology Evangelist ( Sun Microsystems ) Angela Caicedo is a Technology Evangelist at Sun Microsystems. Angela's expertise includes: Java ME, Java SE, Java EE, and the entire Sun Java Enterprise System. She loves spending time in new and cool technologies like: Game developments, 3D, bluetooth, smartdust (Sun' SPOTs), and others. She has also presented these topics at developer conferences around the world. Angela graduated from the University EAFIT of Medellin Colombia in 1998 with a B.S. in Computer Science. During 1996-1997 Angela was a visitor student at Center for Educational Computing Initiatives at MIT. Prior to joining Sun, Angela worked for three years as a software developer and researcher at the Swiss Federal Institute of Technology (EPFL), in Lausanne Switzerland, and participated in several European Projects. Angela has also done research on Intelligent Agents which is one of her specialties."
      },
      {
        "name": "Simon Ritter",
        "biography": "( Sun ) Simon Ritter is a Java Technology Evangelist at Sun Microsystems. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K. Originally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon moved to Sun in 1996. At this time he started working with Java technology and has spent time working both in Java technology development and consultancy. He now specialises in looking at emerging technologies including grid computing, RFID, robotics and wireless sensor networks. Simon and his performing LEGO robots have appeared before audiences worldwide."
      },
      {
        "name": "Matt Thompson",
        "biography": "Director of Technology Outreach and Open Source Programs Office ( Sun Microsystems ) As Director of Technology Outreach and Sun's Open Source Programs Office, Matt Thompson leads Sun's technology evangelism efforts worldwide. His team focuses on educating and enabling the worldwide developer community to easily adopt Sun's emerging technologies like the core Java platform, the Sun Java Enterprise System, and Sun's secure mobility platform, as well as driving Sun's open source strategy for developers. Matt's 16 years of experience includes the software engineering of development environments, productivity tools, and object-oriented frameworks. Today, Matt spends most of his time focusing on delivering Sun's technology strategy to Sun's developers, partners and customers worldwide. Matt first started at Sun in 1988 and after several years \"outside\" at Taligent and General Magic he returned to Sun in 1997."
      }
    ],
    "year": 2006
  },
  {
    "title": "Executable specifications: Keeping Fit at work",
    "level": "beginner-intermediate",
    "summary": "Traditional requirements written as text documents - such as use cases or requirement specifications - is an inefficient way to communicate functionality. Each developer has to interpret the text, details are omitted and the descriptions are frequently not maintained and kept up to date. These documents are essentially redundant; they mirror the executable application and the tests, and you have to keep tests, requirements and the application in sync manually. Example-Driven, executable specifications offers a more flexible and effective alternative by using User Stories and Fit tables to bring requirements and tests together in a document that both specify the desired behaviour of the application, and can be executed at any time to assess whether a feature is implemented and working. This BOF session provides a walkthrough of the process of writing and maintaining executable specifications, using tools such as FIT and FitNesse. We will also look briefly at WebUI specifications with tools such as Watir and Selenium. The session will be open to a large degree of questions and interaction from the audience. The speakers have been using these techniques on projects for the past 2-3 years, and will give concrete advice using real-life scenarios.",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Nils Christian Haugen",
        "biography": "Chief Scientist ( Objectnet ) Nils Christian Haugen is chief scientist at Objectnet and an agile developer and coach. He has been working with large distributed object-oriented applications for companies in various industries since 1998. Nils Christian has enjoyed working with XP/Agile teams at ThoughtWorks, and is an experienced speaker on topics in Java and Agile software development at national and international conferences. He holds an MEng degree in computer science from the Norwegian University of Science and Technology."
      },
      {
        "name": "Trond Arve Wasskog",
        "biography": "CTO and Architect ( Bekk ) Trond Arve Wasskog is an architect working at Bekk Consulting. He has been involved in Java and J2EE application development for more than ten years, focusing on agile software development, testing and quality. Currently he is the competency lead at Bekk Consulting, responsible for competency development and managing the Technology competency groups."
      }
    ],
    "year": 2006
  },
  {
    "title": "NM i estimering",
    "level": "intermediate",
    "summary": "Forskerne fra Simula vil i denne sesjonen demonstrere hvordan du i praksis kan forbedre dine estimater og redusere sannsynligheten for overoptimisme og uønsket påvirkning. Store deler av sesjonen er interaktiv og avsluttes med et uformelt Norgesmesterskap i estimering hvor de som kommer på seierspallen kan glede seg over gavekort fra en av byens bedre restauranter.",
    "description": "",
    "language": "no",
    "speakers": [
      {
        "name": "Stein Grimstad",
        "biography": "( Simula Research Laboratory ) Stein Grimstad received the MSc degree in Informatics from the University of Oslo, Norway in 1998. He has 7 years’ industry experience as software developer and solution architect. He is now a PhD-student in Software Engineering at the University of Oslo, and is a member of the software engineering research group of Simula Research Laboratory in Oslo, Norway. He also works part-time as an advisor at Objectnet. His research interests are software engineering and, in particular, software cost estimation."
      },
      {
        "name": "Magne Jørgensen",
        "biography": "( Simula Research Laboratory ) Magne Jørgensen received the Diplom Ingeneur degree in Wirtschaftswissenschaften from the University of Karlsruhe, Germany, in 1988 and the Dr. Scient. degree in Informatics from the University of Oslo, Norway in 1994. He has 10 years’ industry experience as a software developer, project leader and manager. He is now Professor in Software Engineering at the University of Oslo and a member of the software engineering research group of Simula Research Laboratory in Oslo, Norway. He has published many articles in international journals on software cost estimation. He has supported work on the improvement of software project estimation and has been responsible for estimation training in several software companies."
      }
    ],
    "year": 2006
  },
  {
    "title": "FishBowl discussion: Service Orientation as an Integration Strategy",
    "level": "intermediate-advanced",
    "summary": "Join this FishBowl to examine the 4-level categorization model for services and how these guide a Service Oriented Integration Strategy. We'll discuss the concept of a service, it's responsibilities and contracts and dive into the real world challenges for such a strategy. Keep your sugar and caffeine levels high for this one folks!",
    "description": "",
    "language": "en",
    "speakers": [
      {
        "name": "Mads Nissen",
        "biography": "Developer and Solutions Architect ( Objectware AS ) Mads Nissen currently works as a Solutions Architect for Objecware AS in Oslo. Starting out with java, he converted to C# and the .NET platform in 2001 and has been there since. Mads was a Micosoft Most Valuable Professional in 05/06, and has conducted several talks on major Microsoft focused events in Norway and abroad."
      }
    ],
    "year": 2006
  },
  {
    "title": "Is MDA ready for real business? - A user perspective !",
    "level": "intermediate",
    "summary": "There has been a lot of \"hype\" around MDA the last two years, but is it really ready for serious business? Does MDA deliver when it comes to portability, interoperability and productivity? This talk will report on the current status of MDA and MDA tools from a real case in the company WesternGeco. The UML-tool will be TogetherArchitect-2006 and the examples will demonstrate the use of UML-models, UML-profiles and Model transformations to generated code. The model transformation tool is an open source tool called MOFScript developed by SINTEF as part of the ModelWare EU-project. It is available as an Eclipse plugin. The presentation will show how you can use UML-models and transformation-scripts to customize code-generation for your application architecture.",
    "description": "Required experience: Some knowledge of UML and MDA Expected audience: Anyone interested in improving quality and productivity through automation and code-generation.",
    "language": "en",
    "speakers": [
      {
        "name": "Bjørn Nordmoen",
        "biography": "Chief System Architect ( WesternGeco )"
      },
      {
        "name": "Tor Neple",
        "biography": "Tor Neple is a Research Scientist at SINTEF ICT at the department of Collaborative and Trusted Systems. His research focus is currently on Model Driven Engineering including transformations and domain specific languages. During the last two years he has worked closely with WesternGeco in the IST project MODELWARE in applying and experimenting with MDD technology. He currently is taking part in the ongoing standardisation work on Model to Text Transformations at the Object Management Group."
      }
    ],
    "year": 2006
  },
  {
    "title": "SOA in practice; using ESB, BPEL, UDDI & Security.",
    "level": "beginner",
    "summary": "The Norwegian Ministry of Justice and the Police have worked with a SOA strategy on an Enterprise Architecture level for 3 years. We are now in the middle of the first project (Schengen Information System II) implementing SOA and its principles. This presentation will show lessons learned when applying Enterprise Architecture and SOA principles in the project. Best practices from the developers point of view (J2EE developer and Service developers) will be discussed.",
    "description": "- About The Norwegian Ministry of Justice and the Police and the project Schengen Information System - Requirements from Ministry of Justice Enterprise Architecture - Experience implementing a SOA Methodology - Reference architecture - Purpose - Best practices - Service categorizations - Architecture - How things fit together (J2EE, ESB, BPEL, UDDI, Web Service Manager) - From J2EE developer point of view - High availability - Security - How to achieve a good governance process?",
    "language": "en",
    "speakers": [
      {
        "name": "Rune Nygård",
        "biography": "SOA architect ( Oracle Consulting Norway ) Rune Nygård is a SOA architect at Oracle Consulting Norway. He has worked as an architect within J2EE development and distributed systems using enterprise application integration techniques for the last 8 years, and before that on client/server based systems. Special interests are technical architecture and effective software development. Rune has been a speaker at JavaZone earlier, and has presented on several national and international conferences."
      }
    ],
    "year": 2006
  },
  {
    "title": "Using agile tools to improve the softwaredevelopment process",
    "level": "intermediate",
    "summary": "This experience report aims to demonstrate how Gjensidige Forsikring, a major Norwegian insurance company, introduced agile methodologies and tools to improve the software development process. The talk will provide experiences from using an environment for automated testing and continuous integration. The tools used were junit, jmock, fitnesse, maven2 and anthill pro. In addition, we will describe the challenges we faced when moving to this new infrastructure.",
    "description": "Introduction (5 minutes): - Identifying improvement opportunities in existing development process Standardised builds using maven 2 (15 minutes): - Demonstration Automated testing (10 minutes) - Demonstration Continuous integration (10 minutes): Migration process (10 minutes): - How to move to a new development infrastructure - Issues Q & A (10 minutes) Required experience: Basic knowledge of the java language and java build environments is required Expected audience: Experienced software developers and architects wanting to improve their software development process using agile methodologies and tools.",
    "language": "en",
    "speakers": [
      {
        "name": "Stefan Magnus Landrø",
        "biography": "Senior Consultant ( Bekk Consulting AS ) Stefan Magnus Landrø works as a senior consultant for Bekk Consulting, and has been working with Java and J2EE since 2001. He has a strong interest in open source software and in automating the java development process."
      }
    ],
    "year": 2006
  },
  {
    "title": "Agile development in anger",
    "level": "beginner",
    "summary": "How do you really set-up and run an agile project? At Amazon.com you can by hundreds of books focusing on agile software development in one way or another. You can attend seminars and conferences home or abroad. This is a great way to get a theoretical foundation, but once you get started, practical challenges and questions start popping up. This session provides insight in how agile software development principles were applied to a 6 month project involving a 10 person development team. The objective is to leave you with practical solutions you can apply to your own project tomorrow, with regards to planning and tracking releases and iterations as well as continuously improving the process. Simplicity and visibility is the key. Plain tools like index-cards, whiteboards and a huge LCD screen can give the team and other stakeholders total control at any time.",
    "description": "Introduction – to give you some backgrond (5 min) Scope management in a changing environment – a good story makes the difference (10 min) Release planning and tracking – how velocity can tell you when you are done (10 min) Iteration planning and tracking – a practical approach using index-cards and white-boards (10 min) Continuous integration and automated testing using Selenium – instant feedback on quality, coverage and doneness using a huge LCD (10 min) Iteration retrospectives and corrective actions – if it's broken, fix it - now! (10 min) Wrap-up and Q&A (5 min) Required experience: Experience from software development in general and a good understanding of the underlying principles of agile software development Expected audience: Anyone who are in the process of adapting agile software development",
    "language": "en",
    "speakers": [
      {
        "name": "Reidar Sande",
        "biography": "COO ( Bekk Consulting AS ) Reidar Sande is COO at Bekk Consulting and is a PMP-certified project manager. Reidar can document more than 10.000 hours project management experience from complex systems development and integration engagements, the last five years focusing on J2EE and agile software development. Through his participation in and management of a series of IT-engagements, Reidar has established a broad knowledge base within project management, specification and development/integration, in the role as developer, solution architect, test responsible and project manager."
      }
    ],
    "year": 2006
  },
  {
    "title": "CubicTest - Hassle free web requirements testing",
    "level": "beginner",
    "summary": "There are many aspects of testing web applications that makes it far from enjoyable to say the least. In this session we will present and demonstrate CubicTest, an open source Eclipse plugin that tries to make web tests easier to write, maintain and run for technical as well as non-technical users. CubicTest uses a graphical user interface to let users model tests instead of writing test scripts. The tool focuses on enabling test driven development of web applications, but also supports testing of existing web applications. The goal is to make it possible to replace a detailed requirements specification and manual test scripts with tests written in CubicTest. There are features in CubicTest that makes it quite unique. It has support for testing with a set of changing parameters and to use internationalization to run the same test against the same web site with different input parameters and languages. CubicTest can create a mock-up (HTML skeleton) of the modeled web application based on the tests, with e.g. forms and site navigation present. CubicTest also has an intuitive way to model tests for sites using Ajax technology. Hierarchical test composition is also supported to make it possible to hide test details behind abstractions, which makes it easier to read and write larger test sets. Tests can be exported to other test frameworks (e.g. Watir and the CubicUnit test framework). CubicTest is an open source project at http://cubictest.sourceforge.net and distributed under the GNU General Public License v.2. The tool is still under development, but a 1.0 release is planned for Q3 2006.",
    "description": "1.Background (5 min) 1.Agile software development 2.Existing web test frameworks - too low level 3.Involving the customer in creating and maintaining web requirements tests 2.CubicTest (5 min) 1.A tool for customers and developers 2.Eclipse plugin, model tests (GUI) 3.Test-driven focus 3.Demo (30 min) 1.Make tests for a demo web site 2.Test orchestration, parameterization, export and web mock-up 4.Future (5-10 min) 1.Our newest ideas",
    "language": "en",
    "speakers": [
      {
        "name": "Christian Schwarz",
        "biography": "Consultant ( Bekk Consulting AS ) Christian Schwarz is a consultant at Bekk Consulting AS, where he has worked with enterprise web applications and agile software development since 2004. Based on experience gained here, he co-founded the AutAT (now CubicTest) project, seeking to make web testing more accessible to all kinds of users. He is a member of BEKK's open source competency group, and has held demonstrations and talks about CubicTest at e.g. OOPSLA 2005 and Software 2006. He has a Master of Technology degree in Computer Science from NTNU, and has strong interest in testing and agile architectures."
      },
      {
        "name": "Stein Kåre Skytteren",
        "biography": "Stein Kåre Skytteren is one of the key contributors and co-founder of AutAT which CubicTest builds upon and has held demonstration and talks about the project at e.g. OOPSLA 2005 and Software 2006. He has a keen interest in testing, agile development and open source with an emphasis on Java technology and enterprise solutions. Stein Kåre is working as a consultant at Steria in Oslo with a Master of Technology in Computer Science from NTNU and Bachelor of Business and Administration from TØH/HiST."
      }
    ],
    "year": 2006
  },
  {
    "title": "Finansieringsmodeller for utvikling av fri programvare.",
    "level": "beginner",
    "summary": "Fri programvare får stadig økt aksept og utbredelse. Dette gir nye muligheter for utradisjonelle forretningsmodeller i konsulentbransjen. Disse mulighetene er både økonomiske, organisatoriske og ikke minst markedsutvidende. Eller med ordene til politisk rådgiver Jørund Leknes i Fornyingsdepartementet, til Linux1.no, 2006-03-30: «Fri programvare baserer seg på nye samarbeidsformer og forretningsmodeller som kan gi viktig stimulans for utviklingen av norsk kompetanse og næringsvirksomhet på IT-området.» I BOF-sesjonen presenteres ulike forretningsmodeller for utvikling av fri programvare. Alternative modeller diskuteres og eksemplifiseres med prosjekter og pågående initiativer. Stafettbasert modell innebærer at ulike interessenter bidrar med sine krav og tilhørende finansiering til hver sine utviklingsfaser av en løsning. I dugnadsbasert modell samarbeider flere interessenter om krav og finansiering innenfor samme fase. Med donasjonsbasert modell er gjerne utviklerne initiativtakere og søker bidrag fra allmenheten eller større pengesekker. Eksempler som presenteres: Unified Consulting AS har utviklet en kompetanseportal for kommunenorge, med utgangspunkt i Kongsberg-regionens kommuner. Den GPL-lisensierte portalen er basert på stafettfinansiert utvikling med dugnad underveis. Prosjektets to første faser er finansiert av kommuner i Buskerud og Telemark, samt leverandør Unified Consulting. For tredje fase pågår en dialog med flere interessenter om finansiering. Ekstra-funksjonalitet til CMS-løsningen eZ publish for sammenligning av innhold (Content diff), ble utviklet i vår. Finansieringen var en dugnad mellom tre kunder og to partnere av eZ systems. Content diff ble sluppet i vår (eZ publish 3.8). Norske eZ systems er i ferd med å etablere initiativet eZ Open Funding for å koordinere og hjelpe konstellasjoner av interessenter for finansiering av programvareutvikling. Eksemplene drøftes i lys av utfordringene og forutsetningene de ulike modellene gir. Foredraget vil i utgangspunktet ta for seg bestemte eksempelprosjekter, men dersom publikum har relevant prosjekterfaring, er det åpning for å presentere / diskutere disse på bekostning av planlagte prosjekteksempler.",
    "description": "Introduksjon til foredraget og foredragsholder/firma. (2 min) Presentasjon av ulike forretningsmodeller for programvareutvikling. (15 min) Modeller / varianter (Stafettbasert, dugnadsbasert, terskelfinansiering, open funding, ++) Muligheter (Nye markeder, oppdragsgiver-økonomi, leverandør-lås, samfunnsøkonomi, ++) Utfordringer (Styring, tillit, vedlikehold) Koblingen til fri programvare Prosjekteksempel med stafettbasert utvikling (6 min) Erfaringer fra prosjekt i Kongsbergregionen Styrker / utfordringer Prosjekteksempel med dugnadsbasert utvikling (6 min) Erfaring fra utvikling av Content diff til eZ publish Styrker / utfordringer Hvordan etablere spleiselag. (6 min) Fødselshjelperen \"eZ Open Funding\" Styrker / utfordringer Sammendrag / diskusjon (4 min) Spørsmål / svar / kommentarer fra salen (10 min) Lengde / Duration: ca 40 minutter + spørsmål og innspill fra publikum. Forkunnskapskrav / Required experience: Ingen forkunnskaper kreves. Det er allikevel en fordel å kjenne sentrale begreper innen fri programvare (GPL, fri programvare, åpen kildekode, navn på kjente åpen kildekode-prosjekter) Målgruppe / Expected audience Målgruppen er alle med interesse for fri programvare, enten interessen gjelder utvikling eller rent forretningsmessige aspekter. Foredraget vil gi deg en gjennomgang av muligheter og utfordringer med ulike typer finansering av fri programvare. Temaet belyses med eksempler.",
    "language": "no",
    "speakers": [
      {
        "name": "Klaus Stafto",
        "biography": "Konsulent ( Unified Consulting AS ) Klaus Stafto jobber som konsulent i Unified Consulting. Han har seks års prosjekterfaring med hovedsaklig java-teknologier. Klaus er Cand. Scient. fra NTNU med fagretning kunstig intelligens."
      }
    ],
    "year": 2006
  },
  {
    "title": "Enterprise java applikasjoner laget uten koding",
    "level": "beginner",
    "summary": "Modeller gir et høyt abstraksjonsnivå for utvikling og man kan se knytning til forretningsprossser. Modeller gir god oversikt og bidrar til problemorientert løsning og gjør det mulig å skjule implementasjonsdetaljer. Komplekse systemer vil ha stor hjelp av kodegeneratorer for å ivareta ønsket arkitektur og korrekthet. Samtidig kan man oppnå høyere produktivitet, bedre kvalitet og uavhengighet til målmiljø. I foredraget lages et kjørende system med arkitektur fra et virkelig eksempel der man vedlikeholder modell, ikke kode og er uavhengig av kjøremiljø.",
    "description": "Kort om Esito (3 min) Visjon Modelldrevet utvikling (7 min) Motivasjon Modelldrevet eller MDA Erfaringer Modelldrevet utvikling med Genova (15 min) Historikk Verktøyarkitektur Forklaring av modellene Fra modell til modell Hendelser og tjenester Templates og kodegenerator (10 min) Ulike målmiljø, fokus på java Fra modell til implementasjon Applikasjonsarkitektur Lag din egen template Referanseprosjekt (5 min) Erfaringer fra et stort pågående prosjekt Kort demo (10 min) Eksempel forklart med modellene Generering av javakode Kjøre generert applikasjon",
    "language": "no",
    "speakers": [
      {
        "name": "Dag Bøyesen",
        "biography": "Daglig leder ( Esito ) Daglig leder i Esito AS med fokus på utvikling av verktøy som støtter modellbasert utvikling. Cand real fra Informatikk på UiO, 30 års erfaring innen programutvikling av basis programvare og verktøy. I de seinere år har han drevet mye med utvikling av java enterprise applikasjoner."
      }
    ],
    "year": 2006
  }
]
