[
  {
    "title": "En meldingsorientert arkitektur for brukerinteraksjon",
    "level": "intermediate",
    "intendedAudience": "Utviklere og arkitekter som har interesse for brukerinteraksjon og som ønsker å se en ny og annerledes måte å implementere brukerinteraksjon på. Noe kjennskap til UML og tilstandsmaskiner er en fordel. Kjennskap til Scala og Actor modell er ikke nødvendig.",
    "summary": "I brukerinteraksjon må tilstand håndteres for å styre funksjonaliteten til applikasjonen. Tilstand i deler av applikasjoner visualiseres og uttrykkes enkelt med tilstandsmaskiner. Det vises en meldingsbasert arkitektur der tilstandsmaskiner håndterer tilstanden til en applikasjon og der kommunikasjonen består av asynkrone meldinger. Scala og Java benyttes i eksempelapplikasjoner.",
    "description": "Interaksjon mellom en bruker og en datamaskin utføres i applikasjoner som kjører på ulike mange ulike platformer, som for eksempel en PC eller en mobiltelefon. Men brukerinteraksjon finner også sted i tjenester som svarer på SMS-meldinger, der meldingene kan sees på som kommandoer. Applikasjoner med brukerinteraksjon endrer oppførsel når brukeren utfører handlinger i applikasjonen. Hvis en bruker for eksempel navigerer eller utfører en annen handling endres tilstanden applikasjonen er i, og den nye tilstanden kan tilby annen funksjonalitet enn den opprinnelige. Tilstand er ofte vanskelig å håndtere på en god og helhetlig måte i applikasjoner. Det er dessuten vanskelig å at sikre at kun den lovlige funksjonaliteten er tilgjengelig i hver tilstand. Det er også en utfordring å håndtere handlinger som er tidkrevende og kan låse applikasjonen. Handlinger som utføres i Event Dispatch Thread, som brukes til å tegne GUI, gjør at applikasjonen ikke kan håndtere brukerforespørsler før handlingen er avsluttet. Tilstand i deler av en applikasjon kan enkelt uttrykkes ved hjelp av tilstandsmaskiner. De er lar seg lett illustrere visuelt, og kan enkelt realiseres i kode. I presentasjonen beskrives det hvordan brukerinteraksjon kan ses på som hierarkiske strukturer av tilstandsmaskiner som utveksler meldinger. I en Proof of Concept demonstreres hvordan en slik arkitektur kan implementeres der tilstandsmaskiner styrer oppførselen, og asynkrone meldinger brukes til kommunikasjon. Actor-modellen brukes både til å håndtere den asynkrone meldingsutvekslingen, og for kommunikasjonen mellom tilstandsmaskinene som styrer oppførselen i applikasjonen. Dette løser problemet med låsing av applikasjonen som kan oppstå når for mye skal utføres av Event Dispatch Thread. Modellen gir også en klar separasjon mellom brukergrensesnittet og implementasjon av hendelsene som trigges fra brukergrensesnittet. Eksempel på implementasjon og bruk vises i Java og Scala. Det vises hvordan Scalas Actor-modell forenkler trådhåndtering, og hvordan den gir en god abstraksjon over trådhåndtering i Java, som ofte er kompleks å jobbe med.",
    "keyWords": [
      "Alternative Languages",
      "Architecture and Design",
      "Frontend Technologies"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jonas Lindholm",
        "biography": "Jonas Lindholm har jobbet i Accenture siden 1998 og har jobbet med forskjellige teknologier på både backend og frontend. De siste 6 årene har han i stort sett jobbet med utvikling og arkitektur på Java plattformen. Jonas har hovedfag i informatikk fra Universitetet i Oslo."
      }
    ],
    "year": 2009
  },
  {
    "title": "Hibernate Envers - entitet versjonering i Hibernate",
    "level": "beginner",
    "intendedAudience": "Javautviklere med forkunnskaper om JPA/Hibernate.",
    "summary": "En introduksjon til entitets versjonering med Hibernate Envers",
    "description": "Hvis endringer på entiteter er en problemstilling i din domenemodell kan Hibernate Envers biblioteket være en mulig løsning. Envers er et bibliotek som forenkler lagring og gjenfinning av historiske data. Med kun én enkelt annotering - \"@Audited\" - er det mulig å logge endringer i entiteter (egenskaper og/eller relasjonIer). Presentasjonen forklarer hvordan Envers virker, viser hvordan Envers introduseres i en eksisterende domenemodell, og hvordan spørringer mot historiske versjoner av entiteter kan gjøres.",
    "room": "Lyntale",
    "keyWords": [
      "Java Frameworks",
      "Tools and Techniques"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Sten Aksel Heien",
        "biography": "Sten Aksel er blant Know IT Objectnets mest erfarne konsulenter. Han stiller gjerne opp som scrum master, arkitekt, teknisk ansvarlig, funksjonelt ansvarlig og utvikler. Sten Aksel trives best i smidige team og er tilhenger av smidig og testdrevet utvikling."
      }
    ],
    "year": 2009
  },
  {
    "title": "Tips & triks for intern prosessforbedring og kunnskapsdeling",
    "level": "beginner",
    "intendedAudience": "Alle som er interesserte i smidig utvikling, og interesserte i hvordan drive kompetansebygging og erfaringsutveksling i sin organisasjon.",
    "summary": "I Know IT Objectnet har vi jobbet lenge med intern prosessforbedring og kunnskapsdeling. I dette foredraget ønsker vi å dele våre erfaringer fra dette arbeidet.",
    "description": "Know IT Objectnet legger til rette for faglig utvikling for de ansatte via deltagelse i fagprosjekter på tvers av de daglige kundeprosjektene. Fagprosjektene kommer i stand på de ansattes initiativ og tar for seg ulike teknologier eller områder man interesserer seg spesielt for. De har varighet fra noen uker opp til et halvt år, og skal resultere i leveranser i form av foredrag, kurs eller workshops for kolleger. De siste årene har man hatt flere ulike prosjekter innenfor smidige utviklingsprosesser. I tillegg til interne fagprosjekter, engasjerer Know IT Objectnet seg også i forskningsprosjekter innenfor området. Foredraget tar for seg disse interne og eksterne prosjektene, og vil redegjøre for hvordan vi holder oversikt over prosjektene våre ved hjelp av løpende prosjekt-\"barometre\", erfaringsutveksling og kontinuerlig vedlikehold av retningslinjer / best practices.",
    "keyWords": [
      "Experience Reports",
      "Agile and Software Engineering"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Lars Ivar  Næss",
        "biography": "Konsulentsjef i Know IT Objectnet"
      },
      {
        "name": "Haakon Spilde",
        "biography": "Seniorkonsulent i Know IT Objectnet"
      }
    ],
    "year": 2009
  },
  {
    "title": "En praktisk guide til høytsvevende arkitekturer",
    "level": "intermediate",
    "intendedAudience": "Systemeiere, utviklere, og driftere som har lyst til å lære mer om konsekvensene av å kjøre applikasjoner på en sky.",
    "summary": "Vi vil snakke om og vise eksempler på løsninger av konkrete problemstillinger knyttet til å kjøre applikasjoner på en sky.",
    "description": "\"Cloud computing\" er en av de varmeste potetene i IT-verdenen i dag. Man har flere typer skyer, flere leverandører og mange forskjellige måter å sette sammen sine systemer. For å kunne kjøre systemer i en sky så vil man ofte trenge en del endringer i applikasjonene som skal kjøres. Sammensettingen av applikasjonene som utgjør et system endrer seg også ofte. I dette foredraget vil vi gi en oppsummering av de relevante utfordingene og vise hvordan disse typisk kan løses. Foredraget vil dekke et system som kjøres på en sky, og med eksempler vil vi vise hvordan vi har håndtert utfordringer som skalerbarhet, deployment, oppgradering og tilgjengelighet. Emner som dekkes: * Oppsummering av dagens virtualiseringsteknologier * REST * Monitorering og overvåkning av applikasjoner * Hva er en sky i forhold til et klassisk cluster? Foredraget vil være praktisk orientert og inneholde mange spennende demoer!",
    "keyWords": [
      "Enterprise Architecture and Integration",
      "Architecture and Design",
      "Web as a Platform"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Trygve Laugstøl",
        "biography": "Trygve Laugstøl jobber i Arktekk som utvikler, arkitekt og har mange års erfaring med Java-utvikling. Han har lang erfaring med utvikling og bruk av åpen kildekode som kjerneutvikler av Maven 2 og Continuum. Trygve har jobbet lenge med utvikling av plugins som støtter opp om smidig utvikling og som rådgiver innenfor disse områdene."
      },
      {
        "name": "Kristian Nordal",
        "biography": "Kristian Nordal jobber til daglig hos Arktekk, som Java-utvikler med hovedfokus på open source og smidig utvikling. Han er commiter på Codehaus sitt prosjekt for Maven-plugins og har i flere år deltatt i utviklingen av Maven 2-plugins, som for eksempel den første pluginen for Jetty5 og appassembler-pluginen."
      }
    ],
    "year": 2009
  },
  {
    "title": "Unleash Your Domain",
    "level": "advanced",
    "intendedAudience": "This presentation is intended for those with at the least a cursory knowledge of Domain Driven Design.",
    "summary": "Our application runs over 10,000 sustained transactions per second with a rich model. The key? Modeling state transitions explicitly.",
    "description": "Our application runs over 10,000 sustained transactions per second with a rich model. The key? Modeling state transitions explicitly. In today's world many systems have non-functional requirements that prevent them from being single database centric. This presentation looks at how Domain Driven Design can fit into such environments including extremely large scale web sites, batch processing, and even using highly scalable backing stores such as CouchDb or HyperTable. Event streams, a different way of storing the current state of an object, open many doors in this session not only in how we scale and store our domain but also in how we rationalize about it.",
    "keyWords": [
      "Domain-driven design",
      "Tools and Techniques",
      "Architecture and Design",
      "Experience Reports"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Greg Young",
        "biography": "Greg Young is co-founder and CTO of IMIS, a stock market analytics firm in Vancouver BC. With over 10 years of varied experience in computer science from embedded operating systems to business systems and everything in between, he brings a pragmatic and often times unusual viewpoint to discussions. In his spare time you can often find Greg on experts-exchange.com where he runs the .NET section of the site, writing articles for InfoQ.com, speaking at local .NET groups throughout the south eastern US and now the pacific northwest, or floating upside down through rapids in his kayak."
      }
    ],
    "year": 2009
  },
  {
    "title": "Pomodoro-teknikken for softwareutvikling",
    "level": "beginner",
    "summary": "Er det vanskelig å få ting gjort? Har kompeksiteten i programutvikling blitt for stor? Gjør det vondt? Prøv Pomodoro-teknikken og øk produktiviteten din!",
    "description": "Vi utviklere har mye kompleksitet vi må håndtere, og alle verktøy som gjør oss mer fokuserte og effektive er et verktøy som bør prøves. Pomodoro-teknikken hjelper oss med å håndtere samtidige oppgaver og sørger for å holde hjernen vår fokusert gjennom hele dagen og bruke tiden vår effektivt!",
    "room": "Lyntale",
    "keyWords": [
      "Agile and Software Engineering",
      "Tools and Techniques"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Trond Marius Øvstetun",
        "biography": "Trond Marius er seniorkonsultent hos Mesan. Han har jobbet som ScrumMaster i flere prosjekter og har slåss mot kompleksitet i prosess, produkt, mennesker, kunder og oppgaver. Han jobber for å hjelpe teamet til å holde sin fokus på det viktigste og dermed levere verdi så hurtig og med så høy kvalitet som mulig."
      }
    ],
    "year": 2009
  },
  {
    "title": "Trading on the stock exchange with an iPhone",
    "level": "beginner",
    "intendedAudience": "Anyone interested in leading edge technologies, someone looking to work in financial services, enterprise and mobile device programmers, Enterprise architects.",
    "summary": "A unique view of the world of high finance, with a technical slant. Connecting to stock exchanges with Java FIX engines, automated and algorithmic trading, back testing with over peta-byte of price ticks stored in a cloud and running it all from your mobile phone.",
    "description": "A year ago it was difficult to believe that there would be anything left in the financial services industry, banks were disappearing faster than glaciers and everything looked uncertain. A year on and banks are making profits again, Europe is slowly emerging form the recession and it's almost business as usual. One thing that hasn't changed over the last few years though is the onslaught of technology and our reliance on it to create and drive business. John will talk about the foreign-exchange, derivatives, equity and commodity exchanges, from the New York Stock exchange and InterContinental Exchange to the Deutsche Börse and Saudi Exchange. How FIX engines, written in C, Java and .NET work and how they relay the prices, thousands per second to the traders and algorithmic trading engines. Order Management Systems and Order Execution Engines then send the buy and sell order back to the exchange completing the loop. This talk will be on the technologies used, the problems faced and solutions to some of the problems, sticking mainly to the Java side of the stack but explaining why and where the other technologies fit in. John will also go into some of the leading edge technologies which include storing historic data in the cloud, around a peta-byte and then processing the data for algorithmic back-testing. Finally a look into how the mobile phone technologies are making a big hit in this area, applications being so valuable that the phone can be thrown in with the software. This will be a technical talk from an architects point of view, some code will be shown to demonstrate FIX connectivity and iPhone workings but talk with my more on the technologies and the architecture than the details of the code.",
    "keyWords": [
      "Innovative use of IT",
      "Architecture and Design",
      "Enterprise Architecture and Integration",
      "Mobile"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "John Davies",
        "biography": "John is a regular speaker at technology and banking conferences, his background in technology goes back some 30 years and investment banking over 20. John has held several senior positions in the worlds leading banks from head of technology to global chief architect at banks like Paribas and JP Morgan. In 2000 he co-founded a company (C24) producing Java integration solutions for investments banks (SWIFT, FpML ISO-20022 etc.) and sold that to IONA technologies in 2007. Since then John has invested in and co-founded 2 new companies, Onix & Incept5. Between them they have over 100 clients from people trading their own money in Monaco, a gold bullion exchange in the Middle East, large investment banks, credit-card transaction processing in Beverley Hills and stock exchanges, the work is never dull. John has three young boys, a French wife and enjoys photograph."
      }
    ],
    "year": 2009
  },
  {
    "title": "Strategic Design & Responsibility Traps",
    "level": "intermediate",
    "intendedAudience": "IT managers, architects and developers who are interested in how to use DDD principles to improve their strategic design decisions",
    "summary": "How to use DDD principles to make better strategic design decisions",
    "description": "As software development leaders, we need to think more strategically. Some design decisions affect the trajectory of the whole project or even the organization. These decisions arise in early chartering and throughout development, and they are about much more than architecture. This talk will examine these issues through the lens of the Strategic Design principles of domain-driven design, which systematize a few critical practices some successful teams do intuitively. It is common for skilled teams to deliver software they are not proud of, due to compromises with legacy designs. Others toil for years, producing a platform that is never used to good advantage. These are strategic failures. On the other hand, there are projects with a direct explanation of how the software contributes to business goals. There are projects where designers work with a realistic view of the context of their development within the larger system, allowing them to maintain design clarity and integrity. These are strategic successes. Winning strategy starts with the domain. Two domain-driven design principles, \"Context Mapping\" and \"Distilling the Core Domain\", help you see your strategic situation more clearly and approach strategic design decisions more systematically. These techniques require extensive interaction with domain experts as well as the leaders of the organization, in discussions broader than functional requirements. They sometimes lead to priorities quite different from our most comfortable notions.",
    "keyWords": [
      "Domain-driven design",
      "Agile and Software Engineering",
      "Architecture and Design"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Eric Evans",
        "biography": "Eric Evans, author of Domain-driven Design: Tackling Complexity in the Heart of Software, is a thought leader in software design, domain driven design and domain modeling and particularly focuses on strategic design."
      }
    ],
    "year": 2009
  },
  {
    "title": "A ”Second Life”-approach to BPM",
    "level": "intermediate",
    "intendedAudience": "Architects and technical savvy/interested people.",
    "summary": "A relevant example of a BPM-driven Web-shop application that makes use of ”Second Life” (Massive Online Virtual World) to demonstrate the handling of human tasks.",
    "description": "Almost everyone has heard mention of the term Business Process Management (BPM), but so few know what it's all about - and even less make use of BPM systems in their projects. As a paradox, a vast amount of Java-based projects actually implement BPM-functionality into their systems without even considering using ready-made BPM products, or simply because the architects are ignorant of the purpose of such systems. A part of the problem is that BPM vendors tend to over-simplify their white-paper examples, which lead to potential users finding it difficult to relate the provided examples to their specific problems. In this presentation a Web-shop application will be designed using a BPM-system (jBPM in this case) as a fundamental part of the overall architecture. Unreliable human-tasks will be demonstrated using ”Second Life”, which is a Massive Online Virtual World. Changing business rules, scheduling and user assignments will all be provided by the BPM-system and not implemented as part of the application (which, sadly, is the common way to do it). This presentation will provide the audience with a clean example of using BPM in their application that is more relevant than examples provided by vendors. In addition, the ”Second Life”-driven human-tasks will demonstrate how a BPM-based system will work in a (near) real-life situation.",
    "keyWords": [
      "Architecture and Design",
      "Enterprise Architecture and Integration"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Rune Peter Bjørnstad",
        "biography": "Currently works as a consultant for Bouvet ASA with Java experience since 1999. Primary fields of interests are systems integration and Web development. A board member for the Norwegian Java User Group (javaBin), author of integration related articles and a presenter."
      }
    ],
    "year": 2009
  },
  {
    "title": "GlassFish v3 - The future of app servers and Java EE is here",
    "level": "beginner",
    "intendedAudience": "Developers, architects for anything server-side Java. No EJB required ;)",
    "summary": "GlassFish v3 modular and service architecture using OSGi and HK2. Developer features, both from Java EE 6 and product perspective. Demos.",
    "description": "This is certainly interesting times for application servers in general and for GlassFish in particular. This session will discuss GlassFish v3 and Java EE 6 which will both be weeks if not days away from being declared final at the time of the JavaZone conference. It will cover what's new with the technology and product but also with the community work. GlassFish is not only a modular application server platform with its core built on top of OSGi (it ships with Felix but also runs on multiple OSGi implementations), it also has a unique non-intrusive and extensible architecture. In essence, GlassFish is all about choice: Felix or Equinox, NetBeans or Eclipse (there are now GlassFish bundles with both Eclipse and NetBeans), and your choice of modules, all dynamically loaded. The resulting product ranges from extremely lightweight to extremely powerful. Choice doesn't stop at the Java EE frontier. The update center feature in the product also offers a powerful way to manage existing modules and access new ones from multiple repositories. It enables developers and companies to deal effectively with multiple frameworks, libraries and applications available from a simple graphical and command-line interface. Java EE 6 has many things going for it: new features (JAX-RS and JSR 299), important enhancements to existing well accepted technologies such as Servlet 3.0, JPA 2.0, EJB 3.1, and JSF 2.0, but also a web profile. With changing landscapes in a company or more broadly in the industry, the value of betting on a standard is higher than ever. Java EE 6 is improving the platform while taking into account what enterprise developers ask for: low barrier to access, maintainable applications, and yet infinite architectural solutions.",
    "keyWords": [
      "Enterprise Architecture and Integration",
      "Tools and Techniques",
      "Java Frameworks"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Alexis Moussine-Pouchkine",
        "biography": "Alexis Moussine-Pouchkine is a member of the GlassFish team and has been acting as the ambassador for the project for the past two years. Alexis is a former speaker at JavaZone 2007/2008 and CommunityOne North 2009 is Oslo and has some NOK's left over from previous traveling he'd like to spend."
      }
    ],
    "year": 2009
  },
  {
    "title": "Rebuilding guardian.co.uk with DDD",
    "level": "intermediate",
    "summary": "guardian.co.uk is the three times winner of the Webby for best newspaper on the web (http://www.guardian.co.uk/media/2009/may/05/guardian-wins-three-webby-awards) and the UK's most popular newspaper website, with over 220 million page impressions a month. Over the past three years the platform driving the site has been almost completely rebuilt, by a team that at its peak numbered 104, with the principles of DDD at the heart of the design.",
    "description": "This presentation reviews how key evolutions of our model were driven by domain experts and how DDD encouraged them to have greater investment in the development process. It also discusses some low-tech practices and tools which helped the design and implementation of the model and some of the remaining challenges we face in maintaining a deep, malleable domain model, whilst still meeting deadlines and addressing the operational needs of the business.",
    "keyWords": [
      "Domain-driven design",
      "Tools and Techniques",
      "Experience Reports"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Phil Wills",
        "biography": "Phil Wills has experience with a broad range of languages and technologies, but has spent the past three years focussing on redeveloping guardian.co.uk with a focus on building a strong domain model and achieving high performance."
      }
    ],
    "year": 2009
  },
  {
    "title": "The Uncertainty Principle",
    "level": "intermediate",
    "intendedAudience": "Developers, architects and technical managers.",
    "summary": "Attendees will see how to use of uncertainty as a driver in development, both in terms of schedule and in terms of how to partition their code.",
    "description": "In software development a lack of certainty about something can be part of the solution rather than part of the problem. This point of view can, however, seem a little counterintuitive and more than a little disturbing. There is a strong tendency for humans to feel unsure about uncertainty, in two minds over ambiguity and a little wobbly with instability. Whether over technology choice, implementation options, requirements or schedule, uncertainty is normally seen as something you must either suppress or avoid. Of this many people appear, well, certain. That you should embrace it and use it to help determine schedule and design is not immediately obvious. This session looks at how uncertainty can be employed in planning and used constructively to help determine object encapsulation, class hierarchy design and package partitioning.",
    "keyWords": [
      "Agile and Software Engineering",
      "Experience Reports"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Kevlin Henney",
        "biography": "Kevlin Henney is an independent consultant and trainer based in the UK. He specialises in programming languages, OO design, patterns, development process and software architecture, helping teams adopt techniques and improve their software development through training, mentoring and reviewing. He is and has been a columnist for various magazines and web sites, including Better Software, The Register, SearchSoftwareQuality.com and Java Report. He is also coauthor of A Pattern Language for Distributed Computing and On Patterns and Pattern Languages, two volumes in Wiley's Pattern-Oriented Software Architecture series."
      }
    ],
    "year": 2009
  },
  {
    "title": "Restaurering i forvaltning",
    "level": "beginner",
    "intendedAudience": "Utviklere og andre tekniske personer med en interesse for kvalitet og systemutvikling.",
    "summary": "Å ta over forvaltningen av gamle applikasjoner kan være et mareritt. Hvordan skal man innføre kvalitet og være i stand til å feilrette og videreutvikle disse gamle lappeteppene?",
    "description": "Ingen applikasjoner er \"bruk og kast\". De fleste lever over flere år, og i løpet av levetiden blir de lappet på av ulike mennesker. Det som var \"hot og trendy\" da applikasjonene ble laget er sannsynligvis heller ikke det som ansees som \"good practice\" i dag. Så hva i all verden gjør man når man skal ta over forvaltningen av slike applikasjoner? Hvordan skal man restaurere og innføre kvalitet i gamle applikasjoner?",
    "room": "Lyntale",
    "keyWords": [
      "Experience Reports",
      "Agile and Software Engineering"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Vegard Hartmann",
        "biography": "Vegard Hartmann er fagleder for Kvalitet og testing i Bekk Consulting. Han har siden 2005 jobbet både med nyutvikling og forvaltning av en rekke applikasjoner."
      }
    ],
    "year": 2009
  },
  {
    "title": "Hvorfor skalerer ikke relasjonsdatabasen din og hvilke alternativer har du.",
    "level": "beginner",
    "intendedAudience": "De som ser på relasjonsdatabasen som hellig, de som ikke helt ser poenget med relasjonsdatabasen og de som er interresert i skalering",
    "summary": "Lurer du på hvorfor det er så mye hype rundt alternativer til relasjonsdatabaser. Hva er egentlig problemet med dem sier du? Her er en introduksjon til noen av utfordringene med relasjonsdatabase.",
    "description": "Lurer du på hvorfor det er så mye hype rundt alternativer til relasjonsdatabaser. Hva er egentlig problemet med dem sier du? Her er en introduksjon til noen av utfordringene med relasjonsdatabase, kjenner du deg ikke igjen i dem er kanskje din bruk av relasjonsdatabasen grei likevel. Det er mange meninger om relasjonsdatabasen, jeg vil gi en ryddig oversikt over ting som CAP, ACID, 2PC etc slik at man enklere kan argumentere for og i mot forskjellige løsninger til forskjellige problemer. Dette er ikke et korstog mot relasjonsdatabaser, men enkelte ganger er det greit å vite om begrensningene, hvorfor de er der, og hvilke alternativer man har.",
    "room": "Lyntale",
    "keyWords": [
      "Architecture and Design"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Bjørn Nordlund",
        "biography": "My main goal with programming and system development is to make things simpler and more managable. I try to make systems with less dependencies that are more self contained."
      }
    ],
    "year": 2009
  },
  {
    "title": "Maven Reloaded",
    "level": "intermediate",
    "summary": "Maven 3.0 will be the version Maven for the people. The Maven team has gone to the ends of the earth to ensure backward compatibility, improve usability, increase performance, allow safe embedding, and pave the way for implement many highly demanded features. This talk will briefly cover the process and tooling changes that have occured in the Maven project in order to accomplish what we have done with Maven 3.0, as well as discuss the architectural and feature changes.",
    "description": "Maven 3.0 will be the version Maven for the people. The Maven team has gone to the ends of the earth to ensure backward compatibility, improve usability, increase performance, allow safe embedding, and pave the way for implement many highly demanded features. This talk will briefly cover the process and tooling changes that have occured in the Maven project in order to accomplish what we have done with Maven 3.0, as well as discuss the architectural and feature changes. Some of the process changes include setting up a multi-platform Hudson grid, building out a framework of over 440 integration tests, creating integration tests for all core Maven plugins, and systematically seeking out Maven 2.x OSS projects to validate Maven 3.x's compatibility. We also built out a framework that measures disk I/O, network I/O, memory consumption, and CPU utilization to ensure that performance doesn't degrade. The architectural changes that will be discussed will center around how POMs are constructed, how the lifecycle is executed, how the plugin manager executes, and how artifacts are resolved. Some features derived from these architectural changes include any-source POMs, versionless parent elements, a compositional form of Maven POM configuration we call mixins, lifecycle extension points, plugin extension points, and our new Jetty Client-based, single point of entry artifact resolution mechanism we call the repository system",
    "keyWords": [
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jason van Zyl",
        "biography": "Jason van Zyl is the Founder and CTO of Sonatype, the leader in Java development infrastructure whose customers include Intuit, eBay, Qualcomm and eTrade, and he has over 10 years of experience in open source and proprietary enterprise software development. Prior to Sonatype, Jason was the founder Periapt, Inc., a company that provided software infrastructure development services to Fortune 500 companies such as Toyota Corp., Bank of America, and Coca-Cola Co. Before Periapt, he worked as a Technology Architect at Compusense, a world leader in sensory analysis and data research. An open source enthusiast, Jason is one of the founders of the Apache Maven project, and founder the Plexus IoC framework, and the Apache Velocity project. Jason currently serves as Chair of the Apache Maven Project Management Committee. He has been involved with the Apache Software Foundation (ASF) for seven years, helped to found Codehaus, a well respected incubation facility for open source community projects, and is a frequent speaker at many major software conferences, including JavaOne, EclipseCon, EmergingTech, and ApacheCon."
      }
    ],
    "year": 2009
  },
  {
    "title": "Apache Sling gjør webutvikling moro igjen",
    "level": "intermediate",
    "intendedAudience": "Skal du utvikle et dynamisk nettsted, et bloggsystem, en wiki, eller en type innholdsarkiv etter moderne prinsipper, er Sling et rammeverk du bør vurdere. Presentasjonen vil fokusere på å vise hva man kan gjøre med Sling, for å inspirere til eksperimentering på egenhånd. Publikum bør ha god kjennskap til Java-baserte webapplikasjoner.",
    "summary": "[Til komiteen: Takk for tilbakemelding! Har tatt med mer om JCR, og utvidet eksempelet. Siden OSGi fort vil bli relevant når man utvikler for Sling, vil jeg nødig fjerne den delen helt, men har i stedet fokusert på hvordan man bruker OSGi og Sling sammen.] Apache Sling er et innovativt, REST-basert webrammeverk, og utgjør et HTTP-grensesnitt til et Java Content Repository. Sling-applikasjoner støtter scripts for enkle funksjoner, samtidig støttes avanserte komponenter med OSGi. For mange webutviklingsprosjekter vil Sling være plattformen som gir deg kortest utviklingstid. Sling er også et godt Java-basert alternativ til f.eks. Ruby on Rails.",
    "description": "Tags: Web as a Platform, Java Frameworks JSR-170/283 er standarden for «Java Content Repositories» (JCR). Et JCR er et hierarkisk datalager. I motsetning til relasjonsdatabaser tillater JCR svært fleksible datastrukturer, slik at applikasjonen din lett kan endres etterhvert som du ser behovene. JCR kan også lagre filer og strukturerte data side om side, og er dermed et slags filsystem på steroider. I tillegg får man verdifulle funksjoner som observasjon (eventlisteners), tilgangskontroll, kryssreferanser, fulltekst-søk, versjonering, XPath- og SQL-spørringer, rike attributter og mye annet. Presentasjonen vil vi gi en innføring i JCR-implementasjonen Apache Jackrabbit. Det finnes mange kommersielle content management-systemer som bruker et JCR som datalager, men så langt har det vært få muligheter for rask JCR-applikasjonsutvikling med fritt tilgjengelige rammeverk. Formålet med Sling er å gjøre det enklere å utvikle webapplikasjoner som drar nytte av JCR. Sling-applikasjoner bruker script og servlet'er, som velges ut fra en enkel navnekonvensjon, til å behandle HTTP-requester etter REST-prinsippene. Av scriptspråk støttes bl.a. Ruby, EcmaScript, Groovy, Velocity, eller Cocoon pipelines. Man kan også plugge inn sin egen skriptmotor. Samtidig støttes enterprise-behov via OSGi, noe som gjør plattformen svært utvidbar. Med OSGi-komponenter («bundles») kan man utvikle pakker for egen funksjonalitet. Bundler kan også inneholde servlets, servlet-filtre, og JCR-innhold. Presentasjonen viser hvordan man bruker OSGi-komponenter med Sling. Sling og JCR er et bra valg om man utvikler et system hvor *innhold* er i fokus. Siden REST-prinsippet er sentralt i Sling, får man automatisk pene URLer til innholdet, og det er lett å lage CRUD-applikasjoner (create/read/update/delete) bare ved hjelp av vanlige HTML-skjemaer. Som en del av presentasjonen skal vi utvikle en blogg-applikasjon med bare noen få linjer kode, og dra nytte av Slings innebygde JSON-støtte.",
    "keyWords": [
      "Web as a Platform",
      "Java Frameworks"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Vidar Skauge Ramdal",
        "biography": "Utvikler i Idium AS, som bruker Sling som plattform i et webpubliseringsprodukt. Committer til Apache Sling, og medlem av Sling PPMC."
      }
    ],
    "year": 2009
  },
  {
    "title": "Getting Started with Spring Integration",
    "level": "intermediate",
    "intendedAudience": "Developers and Architects looking for pragmatic solutions for enterprise integration. Those with experience in Spring and/or familiarity with the book \"Enterprise Integration Patterns\" should particularly enjoy this session.",
    "summary": "Learn how to implement Enterprise Integration patterns with Spring.",
    "description": "The Spring Integration project provides a natural extension to the Spring programming model to support many of the Enterprise Integration Patterns described in the book of the same name. The components are configured with either annotations or XML and are managed within any Spring Application Context. Therefore, Spring Integration is very easy to adopt incrementally within an existing Spring-based application, and there are no additional deployment requirements. In this demo-driven session, we will begin with a sample application that includes a preexisting service layer. We will proceed to enhance the application while maintaining a clean separation of concerns between the integration responsibilities and the business logic within that service layer. The integration components will include Polling Consumers, Content-Based Routers, Splitters, Transformers, Service Activators, and more. We will also explore Channel Adapters and Messaging Gateways to connect to different systems using Spring Integration's support for JMS, Mail, and File-based transports.",
    "keyWords": [
      "Java Frameworks",
      "Enterprise Architecture and Integration",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Mark Fisher",
        "biography": "Mark Fisher is a Senior Engineer at SpringSource and lead of the Spring Integration project. He is also a committer on the core Spring Framework and the Spring BlazeDS Integration project. Mark has provided consulting services for clients across numerous industries throughout North America, and he has trained hundreds of developers how to effectively use the Spring Framework and related projects. Mark speaks frequently at conferences and user groups in America and Europe."
      }
    ],
    "year": 2009
  },
  {
    "title": "Open Source Debugging Tools - A 60 Minute Boot Camp",
    "level": "intermediate",
    "intendedAudience": "Swing, JEE, and Java web application developers looking to increase their proficiency in debugging production issues in the most rapid, efficient, and silent manner possible.",
    "summary": "Budgets are tight, quality expectations are rising, your software is in production, and clients are demanding that debugging turnaround time must improve. What tools are you going to use to troubleshoot: a file writing issue? port use collisions? production issues in absence of a debugger? memory leaks? long GC cycles? or even thread contention? Open Source offers excellent solutions to all these scenarios. Learn which tool to whip out for each debugging task.",
    "description": "Expensive commercial utilities ruled the debugging market for years, but learn how a loose confederation of 10 powerful Open Source debugging tools has adeptly fulfilled many of those same needs, and in many cases, taken debugging to the next level. In this 60 minute bootcamp, get exposed to tcpdump, netstat, jps, jstatd, VisualVM, jhat and it's OQL, Omniscient Debugger, TOD, Eclipse Memory Analyzer Tool, jtracert, btrace, lsof and fs_usage. Hear real-world scenarios of when to pull each out of your toolbelt, see each tool in action on a unified Java Web Application exhibiting a plethora of issues, and leverage each tool to discover and solve the problem.",
    "keyWords": [
      "Tools and Techniques",
      "Agile and Software Engineering"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Matthew J. McCullough",
        "biography": "Open Source Application Architect at Ambient Ideas Matthew McCullough is an energetic 12 year veteran of enterprise software development, open source education, and co-founder of Ambient Ideas, LLC, a Denver consultancy. He is an outspoken advocate for the use of open source libraries in enterprise applications. Matthew currently is a member of the JCP, reviewer for technology publishers including O'Reilly, President of the Denver Open Source Users Group, and speaker on the No Fluff Just Stuff 2009 tour. His experience includes successful J2EE, SOA, and Web Service implementations for real estate, financial management, and telecommunications firms, and development of several open source libraries. Matthew jumps at opportunities to evangelize, present, and educate teams on the benefits of open source. His current focuses are Maven, iPhone and Android applications, and OSS debugging tools. Matthew currently resides in beautiful Denver, Colorado, USA with his wife and baby daughter, who all are active in nearly every outdoor activity Colorado offers."
      }
    ],
    "year": 2009
  },
  {
    "title": "Hvordan ta gode beslutninger i systemuviklingsprosjekter?",
    "level": "intermediate",
    "intendedAudience": "Arkitekter, utviklere, prosjektledere, og andre beslutningstakere i systemutviklingsprosjekter.",
    "summary": "Mange av de beslutningene som tas i løpet av et systemutviklingsprosjekt kan få store konsekvenser. I denne presentasjonen går vi gjennom noen gode og noen mindre gode fremgangsmåter for å fremskaffe et beslutningsgrunnlag.",
    "description": "Hvordan ta bedre beslutninger i systemuviklingsprosjekter? - en praktisk tilnærming. Valg av utviklingsmetode, arkitektur og teknologi er eksempel på viktige beslutninger som tas i de fleste systemutviklingsprosjekter. Gode valg medfører at utviklingstiden reduseres, kvaliteten forbedres og at både utviklere, kunder og brukere blir fornøyde. På den annen side, så kan et enkelt dårlig valg føre til at hele prosjektet blir en fiasko. Det er derfor bekymringsfullt at slike viktige beslutninger ofte tas på sviktende grunnlag. Viktige beslutninger baseres ofte på hype, salgspresentasjoner, evangelisering fra \"guruer\", eller egne erfaringer som ikke er representative for problemet man står ovenfor. Det er følgelig et stort behov for teknikker som hjelper oss til å ta bedre beslutninger. Forskere har foreslått flere teknikker som adresserer problemet, feks basert på systematiske litteraturgjennomganger og oppbygging av erfaringsdatabaser. Desverre opplever mange at det kan være svært vanskelig å bruke disse teknikkene i praksis. I denne presentasjonen skal vi se på gode og dårlige fremgangsmåter for å fremskaffe og evaluere informasjon slik at man kan fremskaffe et så godt beslutningsgrunnlag som mulig.",
    "room": "Lyntale",
    "keyWords": [
      "Agile and Software Engineering"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Stein Grimstad",
        "biography": "Stein Grimstad er avdelingsleder for Software Engineering-avdelingen ved Simula Research Laboratory i Oslo, og rådgiver i Wasteless AS. Han er også sentral i Cantara. Hovedinteressen er software engineering med et spesielt fokus på kravhåndtering og kostnadsestimering."
      }
    ],
    "year": 2009
  },
  {
    "title": "DSLs in Groovy: Say What You Mean, Mean What You Say",
    "level": "intermediate",
    "intendedAudience": "Java developers and Groovy developers. Or, anyone with an interest in domain specific languages.",
    "summary": "The history of computer programming has been bridging the gap between what the user says and what the programming language requires you to say. Building Domain Specific Languages (DSLs) allow you to express the solution in the language of the domain user instead of the language of the programmer.",
    "description": "\"Simplicity is the ultimate sophistication.\" (Leonardo da Vinci) The history of computer programming has been bridging the gap between what the user says (\"We need to add sales tax to each item in the order\") and what the programming language requires you to say (\"for Iterator i = orderList.iterator();\"). Building Domain Specific Languages (DSLs) allow you to express the solution in the language of the domain user instead of the language of the programmer. DSLs can be written in any programming language, but the more flexible the programming language used, the closer to plain English the DSL can be. Groovy is a dynamic language for the Java platform that is ideally suited for creating DSLs. Come see how Groovy can leverage the power of Java in a way that your users might actually be able to read and understand.",
    "keyWords": [
      "Domain-driven design",
      "Alternative Languages",
      "Architecture and Design"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Scott Davis",
        "biography": "Scott Davis is the founder of ThirstyHead.com, a training company that specializes in Groovy and Grails training. Scott published one of the first public websites implemented in Grails in 2006 and has been actively working with the technology ever since. Author of the book \"Groovy Recipes: Greasing the Wheels of Java\" and two ongoing IBM developerWorks article series (\"Mastering Grails\" and in 2009, \"Practically Groovy\"), Scott writes extensively about how Groovy and Grails are the future of Java development. Scott teaches public and private classes on Groovy and Grails for start-ups and Fortune 100 companies. He is the co-founder of the Groovy/Grails Experience conference and is a regular presenter on the international technical conference circuit. In 2008, Scott was voted the top Rock Star at JavaOne for his talk \"Groovy, the Red Pill: How to blow the mind of a buttoned-down Java developer\"."
      }
    ],
    "year": 2009
  },
  {
    "title": "Hudson: a continuous integration system",
    "level": "beginner",
    "intendedAudience": "This talk intends to cover both those who are new to Hudson as well as people who are already using Hudson. Anyone interested in improving their engineering practices should find this talk useful.",
    "summary": "How do you get more done with less? By Automating with Hudson! This talk discusses this popular open-source CI system.",
    "description": "This talk will introduce Hudson, an open-source continuous integration (CI) system, which improves the productivity of a development team by automating various things. CI is getting adopted more and more, as computers get cheaper and more capable. For people new to Hudson, we'll walk through the main features, discuss why CI matters, and how Hudson can use a large number of computers effectively. For those who already know Hudson, we'll talk about the current state of the project and the community, as well as what the future directions are.",
    "keyWords": [
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Kohsuke Kawaguchi",
        "biography": "Kohsuke Kawaguchi is a senior staff engineer at Sun Microsystems. He is a creator of Hudson, and has involved in a number of projects such as JAXB, Metro, and GlassFish v3. He also hosts many projects on java.net, such as args4j, and com4j. More information on him can be found at http://www.kohsuke.org/."
      }
    ],
    "year": 2009
  },
  {
    "title": "Utvikling for lykkelig forvaltning",
    "level": "intermediate",
    "intendedAudience": "Presentasjonen egner seg godt for utviklere som driver med nyutvikling eller forvaltning. Erfaring fra enten forvaltningsprosjekter som går sakte eller utviklingsprosjekter som er levert til forvaltning, og deretter har kjørt seg fast, kan være ønskelig.",
    "summary": "Applikasjonsforvaltning er ofte vanskelig og tidkrevende, Aslak ser i denne lyntalen på noen av grunnene til hvorfor og forklarer forklarer samtidig hvordan man kan utvikle for lykkelig forvaltning. Slik kan forvaltningsprosjekter opprettholder momentum og verdiskapning som i utviklingsfasen.",
    "description": "I denne lyntalen vil Aslak forklare hvorfor det koster 8000kr (8 timer) å implementere en avkrysningsboks (\"check box\"), som normalt burde koste 1000kr (1 time). Dette er en helt unødvendig ekstrakostnad dersom vi hadde vært mer bevisst på årsaken til hvorfor denne oppstår. Om man aldri har jobbet med applikasjonsforvaltning er det ikke så lett å se dette. Han vil forklare hvilke krav som BEKK forvaltning stiller til utviklingsprosjekter som gjør systemene forvaltbare - altså reduserer kostnaden i forvaltningsfasen. Dette gjør han gjennom se på hva som gjør at ting tar tid i forvaltning og hvorfor man ikke ser disse problemene i rene utviklingsprosjekter.",
    "room": "Lyntale",
    "keyWords": [
      "Experience Reports",
      "Agile and Software Engineering"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Aslak Johannessen",
        "biography": "Aslak er medlem av BEKK forvaltning og jobber der med å assistere nyutvikling og videreutvikle forvaltningsapplikasjoner. Gjennom dette arbeidet har han erfart hva som avgjør momentum i forvaltningsfasen og hvordan dette kan endres."
      }
    ],
    "year": 2009
  },
  {
    "title": "Trafikanten i Google Android uten T-Mobile G1",
    "level": "beginner",
    "intendedAudience": "Alle som ønsker en innføring i Android-plattformen, eller bare synes det er kult med Linux på mobilen.",
    "summary": "Google Android er neste generasjons mobilplattform, og flere nye Android-telefoner ventes i år. Se hvordan vi utvikler en applikasjon for Android som bruker sanntidsdata fra Trafikanten. Plukk også opp tips om hvordan din gamle telefon kan oppgraderes med Android!",
    "description": "Google Android er neste generasjons mobilplattform, og flere nye telefoner ventes i år. Android kan bli en viktig plattform for utviklere av mobile applikasjoner. Vi tar for oss Android sin arkitektur med fokus på applikasjonslaget. Applikasjoner for Android skrives i en variant av Java, og kjøres i en virtuell maskin som heter Dalvik. Android har et rikt API som tilgjengeliggjør alt av telefonens funksjonalitet og har ingen \"skjulte\" API-er. Vi skal se hvordan vi lager en applikasjon som benytter Trafikantens sanntidsdata, og vil gi en liten innføring i hvordan applikasjoner i Android er bygget opp. Kjernen til Android er basert på Linux 2.6 og hele Android er lisensiert under frie lisenser. Android har også blitt \"portet\" til flere telefoner, og vi skal se hvordan man kan oppgradere en HTC TyTN II med Android.",
    "keyWords": [
      "Alternative Languages",
      "Mobile",
      "Frontend Technologies"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Baard H. Rehn Johansen",
        "biography": "Baard er ansatt som konsulent i Java-avdelingen hos Bouvet. Han har jobbet med Java de siste 5 årene med fokus på smidige metoder og testdrevet utvikling. Baard er en ivrig tilhenger av fri programvare."
      }
    ],
    "year": 2009
  },
  {
    "title": "IT-prosjektet-en skihopper med startnummer på brystet?",
    "level": "intermediate",
    "intendedAudience": "Utviklere, systemerere, prosjektledere. Lyntalen gir en morsom og ny vri på gjennomføring av et IT-prosjekt.",
    "summary": "Skihopp omtales ofte som verdens vanskeligste idrett, fordi suksess i denne idretten avhenger av svært mange faktorer. Et vellykket IT-prosjekt avhenger av faktorer som økonomi, psykologi, informasjonsflyt, intern politikk, menneskelig motstand, tekniske løsninger, prosjektledelse og prosjektdeltagernes evne til samarbeid. IT-prosjekter kan neppe omtales som idrett, men vi hevder at suksess i et IT-prosjekt avhenger av minst like mange faktorer som et godt skihopp. Således kan kanskje IT-prosjekter betegnes som verdens vanskeligste arbeidsplass?",
    "description": "Vinnerne, både i næringslivet og i hoppsporten, vet at bak et godt svev ligger langvarig trening og nitidige forberedelser. Tør du å satse som en skihopper i ditt neste prosjekt? Våger du å bruke tid på å konsentrere deg skikkelig før start, trykke til på hoppkanten og legge deg i flytestilling? Hvis du gjør det kan DU bli en Wirkola som det blir veldig vanskelig å hoppe etter!",
    "room": "Lyntale",
    "keyWords": [
      "Agile and Software Engineering"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Rune Åsprang",
        "biography": "Rune F. Åsprang er utdannet sivilingeniør i kommunikasjonsteknologi ved Norges Teknisk-Naturvitenskapelige Universitet (NTNU). Som IT-rådgiver i BEKK Management Consulting fyller Rune rådgivningsroller som ligger i skjæringspunktet mellom forretning og teknologi, og har et særlig fokus på strategiutvikling og –realisering, prosesskartlegging og analyse."
      }
    ],
    "year": 2009
  },
  {
    "title": "iPhone utvikling for javahuer - Historien om en kul dings og om hvordan Apple gjør livet ditt \"Interessant\"",
    "level": "beginner",
    "intendedAudience": "Alle som har lyst til å vite litt mer om iPhone utvikling.",
    "summary": "Få en rask innføring i iPhoneutvikling.",
    "description": "Dette foredraget vil gi en rask innføring i programmering på iPhone. Foredraget bruker en enkel applikasjon som eksempel og viser hvordan man kan bruke iPhone-ens innebygde GPS sammen med alment tilgjengelige tjenester til å lage kul liten iPhone app. Foredraget går gjennom Xcode, utviklingsmiljøet som Apple tilbyr for utvikling på iPhone, og gir en rask introduksjon til Objective C, vanlige API-er og programeringsmodeller man kommer i kontakt med som fersk iPhoneutvikler.",
    "keyWords": [
      "Alternative Languages",
      "Tools and Techniques",
      "Mobile"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Tobias K Torrissen",
        "biography": "Tobias er fagsjef i Know IT Objectnet. Han har 11 års erfaring fra konsulentbransjen hvor han stort sett har jobbet med utvikling av store mellomvareløsninger implementert i Java. Tobias er tidligere styremedlem i javaBin og satt i JavaZones programkomite fra 2004-2009. Tre av disse årene fungerte han som leder."
      }
    ],
    "year": 2009
  },
  {
    "title": "Hvor mye verdi har du levert i det siste?",
    "level": "intermediate",
    "intendedAudience": "Presentasjonen sikter seg inn mot utviklere, prosjektledere, produkteiere og prosjekteiere. Det viktigste utbyttet vil være en forståelse av hvorfor fokus på verdi er viktig og en inspirerende historie til å gjøre endringer. Deltakerne vil imidlertid også få konkrete verktøy for å måle verdien av leveranser, prioritere krav og bestemme hva som skal eller ikke skal utvikles. Det er en fordel med kjennskap til Scrum og smidig prosjektstyring generelt. Det kreves ingen spesiell økonomikunnskap.",
    "summary": "Smidig handler om å levere forretningsverdi – i teorien. I praksis leverer vi funksjonalitet, og har ikke filla peiling på hvor mye verdi vi har levert og skal levere. Vil du høre om et team og en kunde som går fra mainstream smidig til å levere målbar forretningsverdi? Kom.",
    "description": "- Vi har levert 28 poeng denne sprinten! - Flott, det kaller jeg valuta for pengene! Vi sier at smidig handler om å levere høy forretningsverdi tidlig og hyppig. Og vi sier gjerne at vi leverer det som gir mest verdi først. Men det er teorien. I praksis - for eksempel i Scrum - gjør vi ikke annet enn å levere funksjonalitet, og vi aner ikke hvor mye verdi funksjonaliteten innebærer – bare hvor mange abstrakte poeng den er estimert til. Vi overlater til kunden / produkteieren å prioritere rekkefølgen på funksjonaliteten og håper at det da gir høyest mulig verdi først. Det stemmer kanskje, eller kanskje ikke. Hvem vet? Det er mulig å bryte ut av mainstream smidig til å levere målbar forretningsverdi. Kom og hør historien om en kunde og et team som tar ”verdi” alvorlig og sammen lærer å definere, planlegge, levere og måle verdi. Det er en annerledes presentasjon - en levende, underholdende og inspirerende historie. Underveis får du også ulike innfallsvinkler og verktøy som kan hjelpe deg til å foreta det samme spranget.",
    "keyWords": [
      "Agile and Software Engineering",
      "Tools and Techniques"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Trond Wingård",
        "biography": "Trond er siviløkonom av utdannelse, utvikler av hjerte og prosjektleder av yrke. Han har alltid vært opptatt av å få til gode ting i teams, og fra de første smidig-bøkene dukket opp i 1999, har han konsentrert seg om smidige metoder som prosjektstyringsmetodikk. Han er opptatt av prosjektøkonomi og ønsker å gi prosjekter et tydeligere økonomisk fundament. Trond var medarrangør av Smidig 2007 og Smidig 2008 og er en av grunnleggerne av Steria Smidig Forum. Han arbeider som senior prosjektleder i Steria AS"
      }
    ],
    "year": 2009
  },
  {
    "title": "The Productive Programmer: Mechanics",
    "level": "beginner",
    "intendedAudience": "Anyone who writes code for a living",
    "summary": "This session shows the 4 principles of developer productivity: acceleration, automation, focus, and canonicality, with examples of each.",
    "description": "In The Productive Programmer, I identify 4 principles of productivity: acceleration, focus, automation, and canonicality. This session defines the principles and describes their use, but the primary focus of this talk is on real-world examples of how you can use these principles to make yourself a more productive programmer. Acceleration covers ways to speed up development by taking command of your computer. This includes keyboard shortcuts (including ways to learn them and make better use of them) in both IntelliJ and Eclipse. Focus describes how you can utilize your environment (both physical and computer) to greatly enhance your productivity. Canonicality (the DRY principle from The Pragmatic Programmer) discourages repeating artifacts in projects. This talk shows effective ways to avoid this repetition. I show examples of creating DRY documentation, O/R mapping, database schemas, and development environments.Automation refers to making the computer do more work for you. This talk includes tons of examples, all culled from real-world projects",
    "keyWords": [
      "Tools and Techniques",
      "Experience Reports"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Neal Ford",
        "biography": "Neal Ford is Software Architect and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, instructional materials, magazine articles, courseware, video/DVD presentations, and author and/or editor of 6 books spanning a variety of technologies, including the most recent The Productive Programmer. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 100 developer conferences worldwide, delivering more than 600 talks. Check out his web site at http://www.nealford.com. He welcomes feedback and can be reached at nford@thoughtworks.com."
      }
    ],
    "year": 2009
  },
  {
    "title": "Meta-programming JRuby for Fun & Profit",
    "level": "intermediate",
    "intendedAudience": "Experienced developers interested in what makes JRuby cool.",
    "summary": "Come see why people rave about Ruby (including JRuby). This talk highlights the incredible power of meta-programming in JRuby.",
    "description": "This session shows one of the reasons that JRuby is the most powerful mainstream language today: meta-programming. It shows tons of meta-programming techniques in Ruby, including open classes, the shadow meta-class, defining methods on the fly, why Spring doesn't exist in Ruby, building annotations in JRuby, replicating Java features in JRuby, and tons more. And each of these comes with an example that actually makes sense!",
    "keyWords": [
      "Alternative Languages",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Neal Ford",
        "biography": "Neal Ford is Software Architect and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, instructional materials, magazine articles, courseware, video/DVD presentations, and author and/or editor of 6 books spanning a variety of technologies, including the most recent The Productive Programmer. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 100 developer conferences worldwide, delivering more than 600 talks. Check out his web site at http://www.nealford.com. He welcomes feedback and can be reached at nford@thoughtworks.com."
      }
    ],
    "year": 2009
  },
  {
    "title": "Agile Application Management",
    "level": "intermediate",
    "intendedAudience": "Primarily product owners and project managers. Anyone interested in how to utilize the application management phase for better business value realization, and how to organize efficient application management teams.",
    "summary": "Why stop when the fun is just getting started? A presentation on how healthy agile principles and techniques should prevail through the entire life cycle of an application; development, production and application management. By keeping your eye on the ball - the business overall strategy and visions, the application management phase can become an arena for realizing values and driving the business.",
    "description": "Why stop when the fun is just getting started? A typical phenomenon in IT-projects is how all projects seem to lose focus and momentum as soon as the system reaches production. The team is dispersed. New and often inexperienced personnel take over. Why does this happen? Would you stop nurturing and developing your newborn child? Application Management is often synonym to bug fixing and maintenance - and boring. It’s like in a hospital where it's all about keeping the patient alive, not helping them. While it of course is important to keep the patient alive, the point is that we should be focusing on improving the system. The system has finally reached a phase where you can get real feedback and adjust to reach your business goals. We will look into how healthy agile principles and techniques should prevail through development, into production and thus Application Management. Keep up the good iterative momentum! The goals of the application are still valid and shouldn't disappear. Instead one should embrace the fact that the application now is in a phase where it can collect real feedback. Understand the business' overall strategy and visions, and make sure to measure how you're doing according to these. Make the application management phase an arena for realizing values and driving the business forward. Dare to aim for the stars! It's time to create real value in the real world...",
    "keyWords": [
      "Agile and Software Engineering",
      "Experience Reports",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jahn Arne Johnsen",
        "biography": "Jahn Arne Johnsen is a Senior Consultant at BEKK Consulting. He is head of the company's Application Management Unit and works in projects as a System Developer / Architect and Project Manager. Jahn Arne has a strong interest in agile team organization and value realization. He is especially interested in how the agile process could be adapted for application management in order to still maintain value focus and accommodate proper SLA-handling."
      }
    ],
    "year": 2009
  },
  {
    "title": "Learning an old dog named Log4j new tricks using Spring and JMX",
    "level": "beginner",
    "intendedAudience": "The expected audience is developers that are interested a pragmatic solution to solve the needs of customizing Log4j to fulfill the everyday requirements when it comes to application logging and tracing. The audience will benefit of having basic knowledge of Log4j, Spring and JMX, but it’s not required.",
    "summary": "A very common problem when the shit hit’s the application fan and the debugging starts is that the logs are not in the correct format, the logging is too coarse-grained, and that the logs are hard to get runtime access to. This presentation will address this by first give you an overview of Log4j, show you how can control Log4j remotely using JMX, customizing the log output, and do remote logging.",
    "description": "When developing real-world applications, debugging can be quite cumbersome; the logging is at a level that doesn’t give you a clue of what’s going on, the log file is hard to retrieve and monitor, and you are not able filter out what is important for you. Typically an application restart is needed to change the logging level. And guess what, the buggy state of your application has disappeared as free beer at PartyZone, and your logs are flooded with unrelated information We have met these challenges several times when we at TANDBERG develop Java based products, and especially when we are designing clustered applications. Then it can be rally hard to determine which instance of the cluster that serves the incoming request. Collecting the logs from the instances in a centralized Syslog server, and apply filtering to get relevant information dynamically is very helpful for us when debugging these kind of applications. This presentation will provide the tools that make you able to dynamically change the log level remotely, redirect you logs to a centralized Syslog server, and filter log messages. In addition you will be shown working code examples of how to customize Log4j and instrument your application using JMX. All this will be achieved by using a killer combo of Log4j, Spring, and JMX presented to you as live and kicking code. The presentation will also give you an overview of the relevant mechanics in Log4j, Spring and JMX that makes the foundation of the example code in the session. The presented material is based on personal experiences from real-world Java products development.",
    "room": "Lyntale",
    "keyWords": [
      "Experience Reports",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Rune Schumann",
        "biography": "Rune Schumann works as Senior Software Architect at the R&D department in TANDBERG, and is cutting code at a daily basis in a Java based video conferencing product. Main interests are distributed systems designed for high performance under a large amount of requests, clean code and software architecture. Rune has 10 years of experience from Java projects working as software developer, architect, and project manager. In addition Rune has written the articles “Evolutionary integration with ESBs” and “SEDA to Ensure Service Availability” posted at InfoQ."
      }
    ],
    "year": 2009
  },
  {
    "title": "Debugging your Production JVM",
    "level": "intermediate",
    "intendedAudience": "This is an intermediate to advanced subject. Attendees should have Java development experience on any of a number of languages, Java, Groovy, Scala, etc. It is helpful to understand JMX as concepts are mentioned and not explained. The details of memory management will be explained in detail.",
    "summary": "So your server is having issues? memory? connections? limited response? Is the first solution to bounce the server? Today's Java™ 6 provides superior runtime monitoring and management capabilities. Learn the skills and tools necessary to debugging production JVM issues.",
    "description": "So your server is having issues? Memory? Connections? Limited response? Is the first solution to bounce the server? Perhaps change some VM flags or add some logging? In today's Java™ 6 technology world, with its superior run-time monitoring and management capabilities, the reasons to bounce the server have been greatly reduced. With proper Java Management Extensions instrumentation, the need to bounce the server may be eliminated for all but the rarest of cases. This session, for all Java technology developers and administrators, looks at the Java 6 platform's monitoring and management capabilities, which include the ability to make VM argument changes on the fly. In addition to what is provided in the JDK™ software, it demonstrates several management tools that are available at no cost. The session dives deeply into * jconsole - for memory monitoring, heap dumping, and thread analysis * JVM tools - jmap, jhat, jinfo, jstack * BTrace - the open-source option for on-the-fly monitoring of the JVM machine",
    "keyWords": [
      "Core Java",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Ken Sipe",
        "biography": "Ken Sipe is a Technology Director with Perficient, Inc. (PRFT), an application architect, frequent technical speaker, author of several articles and courses, and software and methodology mentor. He is founder of CodeMentor, Inc., focusing on training and mentor in distributed computing technologies. Ken has delivered hundreds of private and public presentations including JavaOne, BorCon and NFJS."
      }
    ],
    "year": 2009
  },
  {
    "title": "Smidig utrulling",
    "level": "intermediate",
    "intendedAudience": "Utviklere, arkitekter, testere og databaseadministratorer som er interessert i å redusere tiden fra utvikling til produksjon og minske tiden det tar å få tilbakemelding på utviklingsarbeidet. Erfaring med Maven og noe databaseutvikling er en klar fordel.",
    "summary": "Er du ferdig? Tør du sette systemet i produksjon, eller er det bare et sammensurium av kode du er usikker på om er klar til å brukes? Det er på tide å heve standarden og lage programvare som gir verdi for bedriften på både kort og lang sikt.",
    "description": "Den beste måten å måle fremgang på er programvare som er i bruk og skaper verdier. Kode som er klar for produksjon, men som bare ligger og venter på å bli produksjonssatt, er noe som ikke genererer verdi. Eller som man i Lean ville kalt det: Waste. Hvorfor kan vi ikke få programvaren i produksjon idet en funksjonalitet er implementert? Dette foredraget hjelper deg på veien mot å kunne endre dette. \"Push button deployment\" er noe Jeff Sutherland snakker om som en forutsetning for smidige prosesser hos Patient Keeper. Patient Keeper er selskapet han jobber for, og hvor han drar ut mange av sine erfaringer rundt Scrum. Andre bedrifter som har gjort det bra med hyppig produksjonssetting og sin evne til å tilpasse seg marked og kunder er eBay, Flicker og Amazon. For å kunne gjøre disse hyppige endringene og tilpasningene kan ikke produksjonssetting være en stor og farlig operasjon som skal gjøres så sjelden som mulig. Det må rett og slett være en enkel, sikker og rask operasjon. Det må være smidig utrulling. Dette foredraget tar for seg hvilke verktøy og metoder man kan ta i bruk i Java for å komme nærmere smidig utrulling og oppsett av nye miljø. Verktøyene og metodene er basert på konkrete erfaringer, og håndterer ting som pakking, oppgradering av database og testing. Gjennom kodeeksempler viser jeg hvordan man kan bruke verktøy som Maven, Hudson, DBDeploy, Jetty og litt scripting for å få til effektiv, fleksibel og enkel deploy av en standard Java EE webapplikasjon. Det vil ikke være mulig for alle bedrifter eller systemer å ha hyppig produksjonssetting, men i det minste bør man kunne rulle ut ofte og kjapt til test-, beta- og preprodukjons-miljøer. Bare å få dette til i testmiljøene vil gjøre deg bedre i stand til å få hyppige tilbakemeldinger fra brukere, og dermed kunne korrigere kursen oftere. Dette foredraget er holdt for javaBin i komprimert form. Denne utvidede utgaven vil bygge på tilbakemeldingene fra tidligere, og spesielt gi mer detaljer og eksempler i forhold til hva som skal til av kode og oppsett for å få det til i Java. Topic: Agile and Software Engineering, Tools and Techniques, Experience Reports",
    "keyWords": [
      "Tools and Techniques",
      "Agile and Software Engineering",
      "Architecture and Design"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Anders Sveen",
        "biography": "Anders er Managing Consultant og teknologileder for Java hos Capgemini Norge. Han har over 5 års erfaring med utvikling i Java som utvikler og arkitekt. Han er engasjert i smidig utvikling og open source, og har jobbet med smidige metoder i flere år. Han mener at prosess og teknologi må møtes og spille på lag hvis vi skal nå målet om effektiv, god og bærekraftig systemutvikling."
      }
    ],
    "year": 2009
  },
  {
    "title": "På tide å kaste ut relasjonsdatabasen?",
    "level": "beginner",
    "intendedAudience": "Utviklere, arkitekter og testere som er interessert i cloud computing og lagringsmekanismer.",
    "summary": "Cloud computing og Web 2.0 driver en ny tilnærming til lagring med fokus på fortløpende endringer, lave kostnader samt ekstrem skalerbarhet. Samtidig betyr dette begrensede muligheter sammenliknet med en tradisjonell RDBMS. Er det på tide å kaste ut relasjonsdatabasen?",
    "description": "I mange år har relasjonsdatabasen vært et udiskutabelt valg for de fleste applikasjoner. Imidlertid ser vi nå flere alternative databasetilnærminger, drevet av høye krav til skalerbarhet i nettskyen og Web 2.0. Denne sesjonen tar for seg bakgrunnen for denne endringen og ser på de mest interessante lagringsmekanismene som Google BigTable, Amazon SimpleDB og Yahoo PNUTS samt dokumentdatabasen CouchDB. Fokus for disse tilnærmingene er primært mulighet for fortløpende endringer, lave kostnader samt ekstrem skalerbarhet. Samtidig betyr dette begrensede muligheter sammenliknet med en RDBMS. Er det på tide å kaste ut relasjonsdatabasen?",
    "keyWords": [
      "Web as a Platform",
      "Enterprise Architecture and Integration"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Trond Arve Wasskog",
        "biography": "Trond Arve Wasskog er utvikler og CTO i Bekk Consulting. Han har jobbet med Java og Java EE applikasjonsutvikling i mer enn ti år, med fokus på smidig utvikling, kvalitet og vedlikeholdbarhet."
      }
    ],
    "year": 2009
  },
  {
    "title": "EJB 3.1 - What's new?",
    "level": "intermediate",
    "intendedAudience": "Denne sesjonen er retta mot Java EE-utviklarar og tekniske arkitektar som er kjent med EJB-arkitekturen. Deltakarane vil få oversikt over den nye funksjonaliteten i EJB 3.1-spesifikasjonen, endringar som har blitt gjort på den eksisterande arkitekturen og korleis EJBar passar inn i Java EE 6 sin komponentmodell.",
    "summary": "Med Java EE 6 er JSR 318 -- Enterprise JavaBeans 3.1 ferdigstilt. I denne sesjonen ser vi på dei viktigaste nyheitene i den siste EJB-spesifikasjonen og diskuterer korleis desse endringane kan vidare forenkle og forbedre EJB-arkitekturen.",
    "description": "Med lanseringa av Java Enterprise Edition 6 er Enterprise JavaBeans 3.1-arkitekturen klar for massene. I EJB 3.1-spesifikasjonen har forenklingane som vart introdusert i EJB 3.0 blitt vidareutvikla, og i tillegg har ny funksjonalitet blitt lagt til. Denne sesjonen gir eit oversyn over både endringane og den nye funksjonaliteten i EJB 3.1-spesifikasjonen. Emner: * Valgfrie local business interfaces * Portable globale JNDI-navn for session beans * Embedded Enterprise JavaBeans i webapplikasjonar * Singleton-beans og singleton concurrency management * Asynkron metodeinvokasjon på session beans * Applikasjonsvide livssyklusnotifikasjonar * Forenkla orkestrering med EJB TimerService EJB 3.0 tok eit stort steg i retning av ein forenkla EJB-arkitektur og reduserte drastisk på utviklingsinnsatsen som krevdes for å implementere Enterprise JavaBeans. EJB 3.1-spesifikasjonen vidarefører denne forenklingsprosessen ved å gjere local business interfaces valgfrie, globale JNDI-navn blir endelig standardiserte og EJBar kan no instansierast direkte i webapplikasjonar utan behov for ein separat ejb-jar. Fokuset i overgangen fr† EJB 2.1 til 3.0 var å forenkle spesifikasjonen, heller enn å skulle introdusere ny funksjonalitet. Med EJB 3.1 er denne funksjonalitetsfrysen over og mykje ny funksjonalitet har blitt introdusert. Singleton beans og applikasjonsvide livssyklusnotifikasjonar for session beans er heilt nye konsept, men også eksisterande API har fått ei ansiktsløfting med ny funksjonalitet som cron-aktig spesifisering av tidsuttrykk til EJB TimerService og asynkron metodeinvokasjon på session beans.",
    "keyWords": [
      "Enterprise Architecture and Integration",
      "Core Java",
      "Java Frameworks"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Oddbjørn Kvalsund",
        "biography": "Oddbjørn Kvalsund er Accenture Technology Solutions i Oslo sin Subject Matter Expert (SME) på Core Java Programming. Han er utdanna master i informatikk frå Høgskolen i Østfold og Newcastle University og er aktiv i javaBin-miljøet i Oslo."
      }
    ],
    "year": 2009
  },
  {
    "title": "Pragmatic Real-World Scala",
    "level": "beginner",
    "intendedAudience": "Developers interested Scala and getting insight into how to use Scala in a real-world enterprise environment.",
    "summary": "A pragmatic and practical session on how to use Scala in the real world.",
    "description": "Scala is a one of the most interesting new languages for the JVM. A unique and elegant blend of the Object-Oriented (OO) and Functional Programming (FP) paradigms yet pragmatic and practical with seamless interoperability with Java. Scala stands for 'SCAlable LAnguage' and is designed to scale with the needs and requirements of its users. It is statically typed but with good type erasure and style which gives it a dynamic feel similar to Ruby or Python, but with the performance and safety only a statically typed language can provide. This makes it great for a wide range of use-cases, from internal DSLs to large-scale enterprise applications or container code. In this talk we will give you an introduction to Scala from a Java/JEE and real-world perspective. We will discuss a wide range of areas such as: * How to make effective use of Scala's richer OO abstractions and type system, such as mixin composition, to create more flexible and reusable components and systems. * How to take advantage of Scala's FP nature, such as closures, high-order functions, immutability, for more clean, safe, conceptually coherent and deterministic code. * How to make concurrent programming and event-driven systems a walk in the park using Scala's Actors library. * How to bring it all together and make Scala work in the real world; with problems like Web development, O/R Mapping, Dependency Injection (DI), AOP, Testing, High-Availability, Scale-Out etc.",
    "keyWords": [
      "Alternative Languages",
      "Architecture and Design"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jonas Bonér",
        "biography": "Jonas Bonér is a programmer, mentor, speaker and author who spends most of his time consulting as well as lecturing and speaking at developer conferences world-wide. He has worked at Terracotta, the JRockit JVM at BEA and is an active contributor to the Open Source community; most notably created the AspectWerkz (AOP) framework, committer to the Terracotta JVM clustering technology and been part of the Eclipse AspectJ team. Read more on his blog: http://jonasboner.com"
      }
    ],
    "year": 2009
  },
  {
    "title": "Effektiv testing",
    "level": "intermediate",
    "intendedAudience": "Foredraget er primært rettet mot Java utviklere som skriver tester og opplever at alt ikke er løst, selv om man kanskje har skrevet en test for alt. Publikum vil få høre om praktiske problemstillinger knyttet til automatisert test, noe som vil gi lytterne muligheten til å evaluere og forbedre bruken av egne testverktøy.",
    "summary": "Med smidig metodikk har automatisert test fått vind i seilene som aldri før. Fra å være noe som aldri ble gjort skal plutselig alt testes automatisert. Uheldigvis kan dette være å gå fra en grøftekant til en annen. Dette foredraget er for deg som ønsker å lære om effektiv testing, og hvilken effekt ulike verktøy og teknikker gir.",
    "description": "TDD blir trukket fram som noe av det viktigste innen smidig utviklingsmetodikk, men noe har gått galt i den smidige verden. Plutselig skal enhver if-then-else-setning testes med FitNesse og ethvert scenario i brukergrensesnittet skal verifiseres med Watir, Selenium, FunFx, etc. BDoc er en motvekt til denne trenden, et verktøy for å dokumentere spesifikasjoner og funksjonelle tester skrevet i JUnit. Foredragsholderen er hovedutvikler av BDoc og vil gjennom dette foredraget presentere eksempler på effektiv og mindre effektiv testing innenfor ulike områder av automatisert test. BDoc vil bli demonstrert som et lettvektsverktøy for automatisk akseptansetest og dokumentasjon, hvor applikasjonen som testes skal beregne alderspensjon fra folketrygden.",
    "keyWords": [
      "Domain-driven design",
      "Experience Reports",
      "Agile and Software Engineering",
      "Tools and Techniques"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Per Otto Bergum Christensen",
        "biography": "Per Otto er selvstendig konsulent og har jobbet med utviklingsprosjekter på JEE siden 2000, som utvikler, teamleder og arkitekt. Per Otto praktiserer testdrevet utvikling i sin hverdag og jobber for at alle rundt han også skal gjøre det, blant annet gjennom prosjektet BDoc (bdoc.googlecode.com), som lager dokumentasjon fra tester. De siste 6 årene har Per Otto hatt sentrale utviklingsroller på store smidige prosjekter, og gjennom dette også fått mye erfaring med hva som fungerer og ikke fungerer når prosjekter skal benytte automatisert test i stor skala."
      }
    ],
    "year": 2009
  },
  {
    "title": "Unconscious Taylorism  - Why Old Thinking Hinders Agile Adoption",
    "level": "beginner",
    "intendedAudience": "Anyone introducing agile or lean methodologies in a traditional organization should attend. Attendees will learn the history behind traditional management, see common and normal organizations in a new light and why they hinder agile adoption. Attendees should have basic knowledge of agile methodologies. Experience from traditional organizations is helpful.",
    "summary": "The theories of Frederick Taylor and those that followed today still sets the norm for how organizations are managed. What we see as normal and common ways to organize work is in fact making agile adoption difficult, hindering empirical processes and self organizing teams.",
    "description": "* Why do we separate Java and .Net developers? * Why do system architects choose frameworks and write UML diagrams but do not write any code? * Why do we measure how many lines of code a developer writes? * Why is agile adoption in traditional organizations hard? The theories of Frederick Taylor and those that followed today still sets the norm for how organizations are managed. What we see as normal and common ways to organize work is in fact making agile adoption difficult, hindering empirical processes and self organizing teams. The talk points these patterns and their effects and shows how to avoid the to not miss the benefits of an agile development process.",
    "keyWords": [
      "Agile and Software Engineering"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Marcus Ahnve",
        "biography": "Marcus Ahnve heads the Stockholm office of ThoughtWorks, a global IT consultancy aiming to revolutionize the IT industry and the way software is delivered. He specializes in agile methodologies and web development. Marcus experience with agile development dates back to 1996 and his first professional project which was done is Smalltalk. In 2001 he got hooked on XP and has since then explored new ways to make development more effective, valuable and fun. Marcus is one of the founders of the conference Agila Sverige which is held yearly in Stockholm."
      }
    ],
    "year": 2009
  },
  {
    "title": "Developing for the clouds, a practical guide for cloud-enabling your application",
    "level": "intermediate",
    "intendedAudience": "This presentation is for software architects and developers with a good understanding of software design and architecture. After this session they'll have a better understanding of what the cloud has to offer and what it takes to use it.",
    "summary": "Cloud computing have received a lot of attention the last couple years for being the next generation IT infrastructure. We'll look at what are the characteristics for a cloud-enabled application, how data grids work and then dig into why these two technologies are such a great match.",
    "description": "Cloud computing have become the new buzz word and must have for all CTO's, but there's rarely consensus about what it really is and how it can be made accessible by most organizations out there. Usually this term is used in conjunction with names like Salesforce.com, Google or Amazon EC2 and each of these companies deliver this kind of services, but in very different ways. This presentation will start off looking at typical characteristics of a cloud environment and what business value organizations try to get by moving in that direction, either through cloud-providers or by building their own private clouds. We'll then dive into typical characteristics of a cloud environment to see what's different and the see what characteristics a cloud enabled application get in a that kind of environment. It's not always straight forward to take a Java EE application and get it running in a cloud-enabled environment. We'll therefore be going through some challenges that you may face when deploying in a cloud environment and look at different ways to get around that. Finally we'll go back to some of the business requirements mentioned earlier and see to what degree a cloud environment is needed for that?",
    "keyWords": [
      "Architecture and Design",
      "Innovative use of IT",
      "Enterprise Architecture and Integration"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Bjørn Vidar Bøe",
        "biography": "Bjørn works as a regional specialist at Oralce, specializing in Oracle's middleware solutions. For the last couple of years he’s spent the majority of his time helping customers build scalable and highly performing applications using datagrids. Before joining Oracle, he worked over five years with Java EE, spending a lot of time with various application servers, ORM-tools and other lightweight frameworks."
      }
    ],
    "year": 2009
  },
  {
    "title": "Kan vi skape mye mer verdi i softwareprosjekter?",
    "level": "intermediate",
    "intendedAudience": "Seniorutviklere, sjefsutviklere, arkitekter, scrummastere, product owners, prosjektledere og systemeiere som ønsker å få mere verdi ut fra softwareprosjekter.",
    "summary": "Dette foredraget vil sette fingeren på to hovedelementer som kan være med på å skape mye mer verdi i softwareprosjekter.",
    "description": "Softwarebransjen har i den senere tid vært fokusert på å øke produktiviteten. Vi tar stadig ibruk ny teknologi og moderne systemutviklingsmetoder for å optimalisere produktiviteten i gjennomføringen av softwareutvikling. Likevel så stanger vi hodet i veggen dersom vi betrakter mange softwareprosjekter fra et \"verdiskapning over livsløpet\" perspektiv. Dette foredraget vil sette fingeren på to hovedelementer som kan være med på å endre dette bildet. Del 1. Valg. Tar vi de riktige valgene? Vi begynner med å se på prosessene og resultatene rundt nøkkelbeslutninger for implementasjon, hvor vi eksemplifiserer hvor tilfeldig viktige valg faktisk blir tatt. Vi vil også se på hvordan et fokus på teknologi-egenskaper kan gi oss et rammeverk for å ta valg som kan gi betydelig større verdi i softwareprosjekter. Del 2. Arkitektur. Arkitektur er en brannfakkel om dagen, og det ikke uten grunn. Det skrives opp og i mente om arkitektur og anti-arkitektur. Vi vil i denne delen av presentasjonen undersøke og sette spørsmålstegnet på om vi kanskje i 2009 begynner å se konturene av gode mulige arkitekturelle byggesteiner som faktisk er forutsetningen for å investere i arkitekturen i et system og hvordan disse kombinert med å ta bedre valg kan være en måte å skape mye mere verdi enn dagens norm i softwareprosjekter.",
    "keyWords": [
      "Tools and Techniques",
      "Innovative use of IT",
      "Agile and Software Engineering",
      "Architecture and Design",
      "Experience Reports"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Thor Henning Hetland",
        "biography": "Principal Consultant at Webstep, Sun Java Champion, president of IASA Norway, founder of Cantara AS and stiftelsen for fremme av programvareutvikling i Norge. Former president of the very successful Norwegian JUG javaBin and JavaZone. Member of the Advisory Board of java.net. Speaker on several conferences including JavaZone, JavaONE, CommunityONE, Microsoft Application Platform, Smidig, Go Open, OMG Information Days, the Software conference and various others. With over 30 years of professional programming experience spanning quite a few programming languages he has contributed in both international and domestic projects in various roles, including project leader, technology mentor, software architect, lead developer, technology strategist and trainer."
      }
    ],
    "year": 2009
  },
  {
    "title": "Meldingsformidleren",
    "level": "beginner",
    "intendedAudience": "Utviklere som ønsker en lynrask runde med erfaringer fra konstruksjon av et produksjonskritisk system.",
    "summary": "Erfaringer fra utvikling av en solid og konfigurerbar plattform for meldingsbehandling og integrasjon. Systemet knytter sammen tusenvis av kunder, behandler ti-tusenvis av utvekslinger hver dag og støtter viktige formater og protokoller.",
    "description": "Etter en runde med produktevalueringinger valgte vi å utvikle vår egen plattform for integrasjon og meldingsbehandling basert på Java og J2EE. Lyntalen tar for seg valgene vi gjorde, hvilke teknologier som benyttes, hva som fungerte i praksis, litt rundt ytelse og hva vi ville gjort annerledes. Stikkord er JEE, MDB, XML, EDI, WS, SMS, SMTP/POP, FTP/SFTP.",
    "room": "Lyntale",
    "keyWords": [
      "Experience Reports",
      "Enterprise Architecture and Integration"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Thore Johnsen",
        "biography": "Thore Johnsen jobber i dag som system- og løsningsarkitekt i MeldingsTjenester hos ErgoGroup AS. Han har bred erfaring innen design og utvikling av software og har jobbet med mange ulike teknologier og systemer siden midten av 90-tallet. Fra tidlige løsninger basert på Microsoft teknologi, C++ og CORBA jobber han i dag stort sett med løsninger basert på Java og JEE teknologi."
      }
    ],
    "year": 2009
  },
  {
    "title": "Code Smells and Refactoring Revisited:  Advances from the software engineering research community",
    "level": "intermediate",
    "intendedAudience": "Developers who are interested on agile development practices, software architects and quality managers who want to improve maintainability on their products.",
    "summary": "In this presentation, we provide a glimpse on the advances that have been booked by the software engineering research community for analyzing code smells and discuss some empirical results from studies on refactoring strategies. Our aim is to give developers and architects useful insights for prioritizing refactoring tasks and suggest different ways of combining source code analysis and human evaluation for supporting software evolution in their daily work.",
    "description": "Who hasn’t been confronted with the famous “spaghetti code” characteristic that occurs so often in projects that have undergone years of development? Such types of code are typically hard to understand and maintain, and could scale-up to the system level, leading to a phenomenon we call “software entropy” or “code decay”. Most of the work done by software developers is concerned with extending and enhancing existing systems rather than producing new systems (see [1,2,3]). Software entropy seriously hinders these activities, which can substantially increase the total project costs, thus it has become an important area of concern for many software architects and managers. To address this issue, companies have increased their focus on evaluating and improving maintainability of the code base. For example, Microsoft’s Office division assigned 20% of its development effort to re-develop/modify the code basis of their products [4]. A typical way to evaluate maintainability is to use code metrics to measure characteristics of the system. However, the problem with metrics is that they are hard to interpret and they do not provide clear guidance for improving the quality (What does a Cyclomatic Complexity of 342 mean? What can I do to improve this number?). With the increasing adoption of agile development methods, practices like refactoring [5] and the use of code smells [6] for source code analysis have become popular in pursuit of the holy grail of producing “beautiful code”. In general, these practices support software evolution and improve maintainability. However, not all refactorings pay-off in all situations and not all code smells are as “smelly” as one may think. Architects and developers still face the challenge of making redesign and refactoring decisions based on questions like: Which are the worst code-smells we need to get rid of? Which are the less risky refactorings? How can we do more “smart” and cost-effective refactoring? Are these notions built over code smells just a myth in order to achieve the beautiful code or do they really have practical consequences? In this presentation, we provide a glimpse on the advances that have been booked by the software engineering research community for analyzing code smells and discuss some empirical results from studies on refactoring strategies. Our aim is to give developers and architects useful insights for prioritizing refactoring tasks and suggest different ways of combining source code analysis and human evaluation for supporting software evolution in their daily work. [1] C. Jones. Estimating Software Costs. McGraw-Hill, 1998. [2] K. H. Bennett. An introduction to software maintenance. Information and Software Technology, 12(4):257–264, 1990 [3] T. M. Pigoski. Practical Software Maintenance – Best Practices for Managing Your Software Investment. Wiley, 1997 [4] M.A. Cusumano and R.W. Selby, Microsoft Secrets USA: The Free Press, 1995 [5] Opdyke, W.F., Refactoring Object-oriented Frameworks. 1992, University of Illinois. [6] Fowler, M. and Beck, K., \"Bad Smells in Code,\" Refactoring: Improving the Design of Existing Code Addison-Wesley, 2000, pp. 75-88.",
    "keyWords": [
      "Experience Reports",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Aiko Fallas Yamashita",
        "biography": "PhD Student at Simula Research Laboratory / University of Oslo Topic of work: Software Maintainability and Program Comprehension Master in Applied Information Technology with a specialization in Software Engineering and Management. Two years of relevant industry experience in three countries (Costa Rica, USA, Sweden) within diverse organizations. More than one year experience as academic adviser for undergraduate students at a higher education institution in Sweden. More than one year experience as a private consultant, providing services as Software Systems development, Systems Integration, Systems Analysis and Web/Graphic Design and Development."
      }
    ],
    "year": 2009
  },
  {
    "title": "Lizard Brain Web Design",
    "level": "intermediate",
    "intendedAudience": "Developers in any language/framework who are interested in the usability aspects of web design.",
    "summary": "The \"lizard brain\" is the oldest part of the human brain -- the part responsible for autonomic functions like breathing, heart rate, and navigating websites. OK, maybe not that last part, but your website should be easy to use. Stupid easy. Lizard brain easy.",
    "description": "\"There’s an old story about the person who wished his computer were as easy to use as his telephone. That wish has come true, since I no longer know how to use my telephone.\" (Bjarne Stroustrup) The \"lizard brain\" is the oldest part of the human brain -- the part responsible for autonomic functions like breathing, heart rate, and navigating websites. OK, maybe not that last part, but your website should be easy to use. Stupid easy. Lizard brain easy. Any time your user spends figuring out how to do something -- even for a split second -- is wasted time due to poor design. Inspired by Steve Krug's book \"Don't Make Me Think\", this talk answers the question, \"Why is that website so hard to use?\" In this talk, we look at what make a \"good\" website \"good\". Simple changes in the layout or sort order can yield drastic improvements. We'll get inside the heads of typical users and see how their view of our website is drastically different than what we painstakingly planned out. You'll learn how to cater to \"Browsers\" and \"Searchers\" -- the human kind, not the software kind. \"Lizard Brain Web Design\" answers these questions and more in a funny and informative way.",
    "keyWords": [
      "Usability"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Scott Davis",
        "biography": "Scott Davis is the founder of ThirstyHead.com, a training company that specializes in Groovy and Grails training. Scott published one of the first public websites implemented in Grails in 2006 and has been actively working with the technology ever since. Author of the book \"Groovy Recipes: Greasing the Wheels of Java\" and two ongoing IBM developerWorks article series (\"Mastering Grails\" and in 2009, \"Practically Groovy\"), Scott writes extensively about how Groovy and Grails are the future of Java development. Scott teaches public and private classes on Groovy and Grails for start-ups and Fortune 100 companies. He is the co-founder of the Groovy/Grails Experience conference and is a regular presenter on the international technical conference circuit. In 2008, Scott was voted the top Rock Star at JavaOne for his talk \"Groovy, the Red Pill: How to blow the mind of a buttoned-down Java developer\"."
      }
    ],
    "year": 2009
  },
  {
    "title": "Building and managing a highly scalable Twitter-like clone",
    "level": "intermediate",
    "intendedAudience": "Anyone interested in building high scalability websites.",
    "summary": "How would you build and manage a Twitter-like clone if you were tasked with that job? Come join this session as the presenter discusses various strategies and software technologies.",
    "description": "What would you do if you were tasked with building a Twitter clone which was highly scalable? How would you test it? How would you manage the deployments? Join this intrepid presenter, who being all too ingrained with the concepts of RDMBSs, dips his feet in the world of non-relational databases, explores the ins and outs of key/value stores, BigTable, and other approaches, figures out how to manage deployments and investigates how to test the application so it won't ever go down.",
    "keyWords": [
      "Architecture and Design",
      "Enterprise Architecture and Integration",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Dan Diephouse",
        "biography": "Mr. Diephouse is a software architect at MuleSource, the company behind the open source Mule integration framework. Here he is focused on building open source web services solutions and MuleSource’s SOA governance platform, Galaxy. In addition to his work on Mule and Galaxy, he is a co-founder of the web services framework Apache CXF, a founder of several other projects including XFire, SXC, and Jettison, and participates in several others whenever possible."
      }
    ],
    "year": 2009
  },
  {
    "title": "Continuous Performance Testing in the Cloud",
    "level": "advanced",
    "intendedAudience": "Developers and Architects that want to know more about continuous performance testing and how to use the cloud to give the performance tests more power.",
    "summary": "Performance testing is important, so we want to do it as often as possible. Over the lifetime of an application the performance of it will change and it's important to be aware of these changes. In this talk, we will demonstrate what kind of benefits continuous performance testing will give your project using Grinder, Hudson and Amazon Web Services.",
    "description": "Performance is always an important aspect to consider when developing Java applications. In many cases the performance testing is done late in the project when the programming is finished, something that might be a problem if performance issues are discovered. It is a better approach to monitor performance from the beginning of the project and continuously compare performance numbers between each build of the application, thus ensuring that the application has the wanted throughput right from the beginning. Using Hudson (http://hudson.dev.java.net/) and The Grinder (http://grinder.sf.net/) we have written a small plugin to run performance tests regularly and compare the results in graphs and tables. This talk will demonstrate how it is possible to continuously monitor the performance of any Java application, not just web applications, with a few simple steps. We will also demonstrate how to use Cloud Computing (Amazon Elastic Compute Cloud - EC2) to distribute the performance tests. Using Cloud Computing is a relatively cheap and quick way to dynamically allocate a number of test-nodes in order to create as realistic test scenarios as possible.",
    "keyWords": [
      "Experience Reports",
      "Agile and Software Engineering",
      "Java Frameworks",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Eivind Barstad Waaler",
        "biography": "Eivind is a senior consultant and manager working for BEKK in Oslo. BEKK is a consulting company specializing in enterprise web integration. Eivind has 10 years experience developing enterprise Java/J2EE applications. He has worked on various Open Source projects and the Hudson Grinder Plugin is his latest initiative."
      },
      {
        "name": "Ole-Martin Mørk",
        "biography": "Ole-Martin has worked as a programmer and architect for 9 years. He is primarily a Java Developer, but he is also programming Ruby, PHP and Python. At Open AdExchange they are developing an Advertisement System that will scale to billions of requests pr month. In order to achieve this goal, they rely heavily on a scalable architecture and good and scalable performance tests. In order to scale as much as possible, they are using Amazon Web Services as their hosting platform both for their application and the performance tests."
      }
    ],
    "year": 2009
  },
  {
    "title": "Arkitekturtabber vi ikke gjør om igjen",
    "level": "intermediate",
    "intendedAudience": "Utviklere og arkitekter.",
    "summary": "Har du skrevet ditt eget ORM-rammeverk? Eller brukt integrasjonsplattformen din som dokumentdatabase? Har du kjørt alle metodekall over webservices? Det har vi! Dette erfaringsforedraget tar for seg et knippe arkitekturtabber og beskriver hvordan og hvorfor vi havnet i gjørma... og hvordan det føltes.",
    "description": "Etter mange år i bransjen har foredragsholderne samlet på grove arkitekturtabber fra sine prosjekter. Har du skrevet ditt eget ORM-rammeverk? Eller brukt integrasjonsplattformen din som dokumentdatabase? Har du kjørt alle metodekall over webservices? Det har vi! Dette erfaringsforedraget tar for seg et knippe arkitekturtabber og beskriver hvordan og hvorfor vi havnet i gjørma... og hvordan det føltes.",
    "keyWords": [
      "Experience Reports",
      "Architecture and Design",
      "Enterprise Architecture and Integration"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Knut Erik Borgen",
        "biography": "Knut Erik Borgen er utdannet Cand Scient i år 2000 har bred erfaring fra serverside, web 2.0 og Swing utvikling. Jobber i dag for Know IT Objectnet som arkitekt, teknisk ansvarlig, funksjonelt ansvarlig og utvikler. På hobbyfronten utvikler han open source software i PHP og Java og trives svært godt når det står utviklingsoppgaver i kø. Stor tilhenger av smidig og testdrevet utvikling."
      },
      {
        "name": "Jan Henrik Gundelsby",
        "biography": "Jan Henrik Gundelsby er utdannet Cand Scient og har over 10 års erfaring med serverside Java-teknologi, både J2EE og lettvektsrammeverk. Han jobber i dag for Know IT Objectnet som teknisk prosjektleder, arkitekt og utvikler for et større offentlig IT-prosjekt. Jan Henrik er en ivrig lettvekts-fantast som forsøker å jobbe mot smidige arkitekturer og løsninger som gir økt produktivitet for utvikleren."
      }
    ],
    "year": 2009
  },
  {
    "title": "Fritekstsøk i JEE applikasjoner, praktisk bruk av Compass og Lucene",
    "level": "beginner",
    "intendedAudience": "Utviklerer, tekniske prosjektleder, prosjektledere og systemarkitekter. Dette vil kunne gi folk som ønsker å løse tilsvarende problemstilling, innspill til mulig løsning. For andre som også benytter denne typen teknologi vil det kunne gi de et innblikk i andres erfaringer. - Ingen forkunnskaper, men en fordel om kjennskap til rammverkene.",
    "summary": "Foredraget vil ta for seg praktisk bruk av Compass mot JPA og eksempler på hvordan sammspillet mellom disse er løst.",
    "description": "I et av Mesans prosjekter - Arkivportalen.no, har kunden et stort behov for å kunne gjennomføre fritekstsøk mot Java objekter som er persistert i en database ved hjelp av JPA. Vi har dermed implementert en løsning der du kan utføre fritekstsøk mot disse Java objektene. Løsningen benytter Open Source rammeverket Compass som bygger på Apache Lucene. Compass har gjort oss i stand til å levere fritekstsøk sammen med og inkludert i en standard JPA applikasjon kjørende på Suns Glassfish applikasjonsserver. Foredraget vil ta for seg praktisk bruk av Compass over Lucene mot JPA og eksempler på hvordan samspillet mellom disse er løst, gjennom erfaringer fra prosjektet arkivportalen.no. Bakgrunnen for løsningen vil være introduksjon til presentasjonen. I hoveddelen vil det fokuseres på krav til løsningen og hvorfor man ønsket å bruke fritekst søk mot databasen og hvilke krav som ble stilt til løsningen i forhold til søkemuligheter. Videre tar vi for oss bruken av Compass og Lucene sammen med JPA og hvordan dette har blitt løst og konfigurert, for å oppnå best mulig resultat. Arkivportalen.no er delvis et nyutviklingsprosjekt samt en web utvidelse av en eksisterende løsning. Vi kommer derfor også til å vise hvordan man kan innføre bruk av Compass og Lucene mot eksisterende løsninger. Avslutningsvis vil vi ta for oss våre erfaringer så langt, og belyse både positive og utfordrende egenskaper med bruk av Compass og Lucene som fritekst søkeverktøy i en JEE applikasjon.",
    "keyWords": [
      "Experience Reports",
      "Architecture and Design",
      "Enterprise Architecture and Integration"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Arnfinn Sandnes",
        "biography": "Arnfinn Sandnes har jobbet som utvikler og arkitekt i over 20 år. Han har jobbet mye med spesifikasjoner, valg av arkitektur, design, integrasjon og implementasjon på JEE plattformen."
      }
    ],
    "year": 2009
  },
  {
    "title": "Domain driven design: Noe mer enn god objektorientering?",
    "level": "beginner",
    "intendedAudience": "Utviklere",
    "summary": "Har du sett: \"person.getAdresse().getGateAdresse().getHusnummer()\" før? Har du skrevet den? Hvorfor?",
    "description": "Java er et objektorientert språk. Hva vil dette egentlig si? \"Objekter, abstraksjon, innkapsling, SOLID prinsipper\". Når vi har all denne kunnskapen, hvorfor ender vi opp med domenemodeller uten logikk og enkapsulering - og person.getAdresse().getGateAdresse().getHusnummer(); Er domain driven design noe mer enn en måte å belyse disse prinsippene for oss enda en gang? Denne sesjonen vil gjennomgå hva domain driven design gir deg ut over de objektorienterte prinsippene, og vise hvordan konsepter som et felles domenespråk kan hjelpe oss med å håndtere kompleksitet i applikasjonene våre.",
    "keyWords": [
      "Domain-driven design",
      "Agile and Software Engineering",
      "Architecture and Design"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Janniche Haugen",
        "biography": "Janniche har 5 års erfaring med utvikling av mer eller mindre domenedrevne Java applikasjoner. Hun er for tiden fagleder for Java i Bekk og har høy fokus på utvikling av god Java kode. Favoritt sitat: \"Expert programmers are those who write code even idiot programmers can understand. Idiot programmers are those who write code not even expert programmers can understand.\""
      }
    ],
    "year": 2009
  },
  {
    "title": "What's new in Spring 3.0",
    "level": "intermediate",
    "intendedAudience": "Spring users",
    "summary": "We will cover the new features in Spring 3: expression language support, REST, fully generic API, and more!",
    "description": "With the Spring Framework 3.0 release, we are introducing further annotation-based configuration options, unified expression language support and comprehensive REST support. This talk discusses Spring as a modern Java 5 oriented application framework: covering the core component model, annotation-driven web MVC as well as platform integration. This would be more interesting to existing Spring users.",
    "keyWords": [
      "Enterprise Architecture and Integration",
      "Java Frameworks"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Arjen Poutsma",
        "biography": "Arjen Poutsma is a senior software engineer at SpringSource with fifteen years' experience in commercial software environments. During this time he has worked with both Java EE and Microsoft .NET. Four years ago, Arjen started to specialise in Web Services and Service Oriented Architectures. During this period, he has worked for some of the largest organizations in the world helping them better understand enterprise Java and how SOAs fit into their organizations. In part from his experiences with these organizations, Arjen founded the open source Spring Web Services project and continues to lead the technical direction and development as the project lead for Spring Web Services. This project aims at facilitating development of document-driven web services. He currently works on the REST features in Spring 3.0. Arjen has also contributed to various other open source projects, including XFire, Axis2, and others. He is a regular speaker at Java and SOA conferences, including JavaPolis, The Spring Experience, JavaZone, W-JAX, and many others."
      }
    ],
    "year": 2009
  },
  {
    "title": "Do you really get class loaders?",
    "level": "advanced",
    "intendedAudience": "Engineers who have had trouble with class loading and want to avoid it in the future.",
    "summary": "In this session we'll take a tour of the Java class loading mechanism, both from JVM and developer point of view. We'll see how different delegation systems are built, how synchronization works, what is the difference between finding classes and resources, what wrong assumptions has been made and are now supported.",
    "description": "Class loaders are at the core of the Java language. Java EE containers, OSGi, NetBeans modules, Tapestry 5, Grails and many others use class loaders heavily. Yet when something would go wrong, would you know how to solve it? In this session we'll take a tour of the Java class loading mechanism, both from JVM and developer point of view. We'll see how different delegation systems are built, how synchronization works, what is the difference between finding classes and resources, what wrong assumptions has been made and are now supported. Next we will look at typical problems that you get with class loading and how to solve them. ClassNotFoundException, ClassNoDefError, LinkageError and many others are symptoms of specific things going wrong that you can usually find and fix. We'll review ways to fight with JAR hell and JAR locking and caching. Finally we'll take a look at things in the class loader world that are broken beyond repair and how to recognize and work around them.",
    "keyWords": [
      "Core Java"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jevgeni Kabanov",
        "biography": "Jevgeni Kabanov is the founder and lead of ZeroTurnaround (www.zeroturnaround.com), a development tools company that focuses on productivity. Before that he worked as the R&D director of Webmedia, Ltd, the largest custom software development company in the Baltics. As part of the effort to reduce development time tunraround he wrote the prototype of the ZeroTurnaround flagship product, JavaRebel, a class reloading JVM plugin. Jevgeni has been speaking at international conferences for several years, including JavaPolis/Devoxx, JavaZone, JAOO and so on. He also has an active research interest, publishing several papers on topics ranging from category theoretical notions to typesafe Java DSLs. Besides the commercial products made for ZeroTurnaround, Jevgeni is a co-founder of two open-source projects -- Aranea and Squill. Aranea (www.araneaframework.org) is a web development and integration platform based on strong object-oriented principles. Squill (squill.dev.java.net) is a typesafe internal DSL for constructing and executing SQL queries. Jevgeni's personal blog can be found at dow.ngra.de."
      }
    ],
    "year": 2009
  },
  {
    "title": "To ESB or not to ESB: that is the question",
    "level": "beginner",
    "intendedAudience": "* Java Web Application developers who need very simple integration and routing options without the hassle. * Developers who don’t really care about SOA but need to build service oriented applications.",
    "summary": "Most web applications need integration capabilities but don't need the complexity of an ESB solution. Typically, web apps need a simple solution for performing common integration tasks such as receiving and sending messages over Email, JMS, FTP, calling a Web Service or REST services such as Facebook or Twitter. This talk will introduce Mule iBeans, a new integration framework specifically for Web Application integration. Mule iBeans focuses on task-based integration without introducing new complexities or architecture considerations.",
    "description": "The ESB is not well suited for simple Web Application integration. The Web application model has evolved to the point where the presentation/logic/data tier model is a bit limited since applications need to be connected to other applications and services. There are lots of ESB-type solutions out there for dealing with this shift but they often introduce new complexities or concepts that create a barrier to entry. This talk will provide working knowledge of how to hook in external services to your Web Application without the complexity. This session will introduce a new framework, Mule iBeans that focuses on task-based integration for web applications. The audience will learn how to integrate their web applications with other applications and services on the web and the enterprise in a way that doesn't add complexity to the code or architecture of the application. Using a couple of simple constructs developers will be able to integrate with services such as Flickr, JMS, Twitter, Google Maps and Email in minutes.",
    "keyWords": [
      "Web as a Platform",
      "Enterprise Architecture and Integration",
      "Java Frameworks"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Ross Mason",
        "biography": "Ross Mason is Founder and CTO of MuleSource, Inc., and the creator of the open source Mule integration platform. Mason founded the Mule project in 2003 with the ideal to simplify the process of building application integration and ESBs that had been made overly complex by the commercial vendors. Now Mule is the most widely used open source ESB and integration platform. Prior he was CEO of SymphonySoft Limited, an EU-based company providing services for large-scale integration projects."
      }
    ],
    "year": 2009
  },
  {
    "title": "ScrumButtens anatomi",
    "level": "intermediate",
    "intendedAudience": "Nybegynnere, praktiserende og erfarne brukere av Scrum og andre smidige metoder ønskes velkommen. Likeså de som er veldig, veldig skeptisk til hele smidigopplegget.",
    "summary": "Mange sier de har en ekte Scrum, men egentlig har de fått en ScrumBut i huset. Få ett grunnkurs i ScrumButtens anatomi; lær å gjenkjenne, håndtere og akseptere Scrum sin ofte misforståtte artsfrende.",
    "description": "En ScrumBut er en mindre kjent, men ganske utbredt art av familien Scrum. Arten ble først kjent på begynnelsen av det 21 århundre, og har nylig blitt lagt til i det smidige artsregisteret. Kjennetegn inkluderer burndowns som aldri når null, ufokuserte standupmøter og sprinter med liten betydning. Nyere forskning viser at mange tidligere rapporterte observasjoner av Scrums, egentlig har vært observasjoner av ScrumButs. Denne lyntalen vil illustrere de mest synlige kjennetegnene til en ScrumBut. Deretter forklares hvorfor ScrumButten kan være ett nyttig innslag i den lokale fauna, og hvordan man kan gå frem om man finner en i hagen. Det er vanskelig å kjøre Scrum etter boka; mange sliter med å gjøre det \"riktig\". Husk at boka og guruen bare er brostein på veien til lykke. Adopter en ScrumBut idag!",
    "room": "Lyntale",
    "keyWords": [
      "Agile and Software Engineering"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Øyvind Kvangardsnes",
        "biography": "Øyvind Kvangardsnes er konsulent i BEKK. Han tjener til sitt daglige brød ved å skrive Javakode, og har nylig fullført sin mastergrad som omhandlet om bruk av Scrum."
      }
    ],
    "year": 2009
  },
  {
    "title": "Rules engines vs domain logic",
    "level": "intermediate",
    "intendedAudience": "None. Experience implementing rules or domain logic is “nice to have”.",
    "summary": "Rules engines are getting a huge footprint in the market, and for certain areas they are a good match. Should you let a rules engine rule your application?",
    "description": "Rules engines are a hot topic in many large and small projects. When faced with the decision to choose either a rules engine, or to choose a rules engine at all there are many considerations to make. This talk will draw a line between what's real and what's perceived benefits of rules engines. When faced with the decision it will help you choose between rolling your own domain logic, or a rules engine. We will outline what impacts the choice of using a rules engine has on your project, and what implications it has to areas such as development, testing and architecture. Further on we will draw the line between domain logic and rules, and give criteria for when to choose one over the other. Topics that will be discussed: * Do we need a rules engine just because we have rules? * What are the drawbacks and benefits of using a rules engine? * Are the benefits real or perceived? This talk will bring together experiences from several large and small projects using rules engines. Some of them are amongst the largest projects in Norway that are currently implementing a rules engine based solution.",
    "keyWords": [
      "Enterprise Architecture and Integration",
      "Tools and Techniques",
      "Architecture and Design"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Anders Sveen",
        "biography": "Anders works as a Managing Consultant and Technology Leader, Java at Capgemini Norway. He has over 5 years of experience with Java development as a developer and architect. When not working he is active within the agile community and has worked on several agile projects during the last years. He is convinced that we need to make process and technology match each other if we are to reach the goal of effective, good and sustainable system development."
      },
      {
        "name": "Bent Are Melsom",
        "biography": "Bent Are Melsom holds a Master of Science from NTNU, and works as a Managing Consultant at Capgemini Norway where he leads the java department. He has many years of experience with the java-platform, recently as an architect on two of the largest projects in Norway. He is a frequent spreaker at conferences, and a passionate developer and \"hands-on\" architect."
      }
    ],
    "year": 2009
  },
  {
    "title": "Open Innovation",
    "level": "intermediate",
    "intendedAudience": "As long as you are curious about Open Innovation and want to learn more about it, that is sufficient.",
    "summary": "Companies that don´t innovate die, and most innovations fail. How can the theories behind Open Innovation help us make the most out of existing inventions and combine them with appropriate business models to create profitable businesses?",
    "description": "Many great companies fail to understand technological change and how it might affect them. Their current customers and existing business models that have served them so well in the past can turn into a curse in the light of disruptive innovation. Moving from closed to open innovation will help companies to get the most out of both their own inventions and the inventions of others as well. Can companies remain innovative over time?",
    "room": "Lyntale",
    "keyWords": [
      "Agile and Software Engineering"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Per Mengshoel",
        "biography": "I work as a manager in BEKK, and have been working with Java technology for 10+ years. On projects I tend to take on roles as a team leader and/or developer. In BEKK I also work with knowledge management and have had various roles managing our technology groups. I spend the Spring 2009 semester at the Haas School of Business at UC Berkeley, where I followed a course on Managing Innovation and Change with Henry Chesbrough - one of the key proponents of Open Innovation."
      }
    ],
    "year": 2009
  },
  {
    "title": "Google App Engine Java Applications HOWTO",
    "level": "intermediate",
    "intendedAudience": "Application architects, developers, senior developers who want to evaluate how to write, deploy, and maintain Google App Engine applications in Java.",
    "summary": "In this session you will learn how to develop applications for the Google App Engine ecosystem. It will include an overview of the App Engine environment for Java and Python, then shift focus to Java-specific development and the differences, advantages, and features.",
    "description": "Google App Engine for Java is the most recent contestant in the war for the low-cost, high-availability cloud computing environments. This presentation introduces the technology and its operational model, how it’s alike and how it differs from running Java apps in traditional app server environments, and what kinds of things developers and app designers will need to plan, build, deploy, and maintain Java applications that will run on Google’s App Engine infrastructure.",
    "keyWords": [
      "Innovative use of IT",
      "Web as a Platform",
      "Green IT",
      "Enterprise Architecture and Integration"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Eugene Ciurana",
        "biography": "Eugene is a systems high scalability and performance expert, and author of the first two commercial books about Google App Engine: Developing with Google App Engine (Python, Feb. 2009) and Beginning with Google App Engine (Java, Python, Aug. 2009) published internationally by Apress, USA. Eugene Ciurana CTO CIME Software Labs +1 415 387 3800"
      }
    ],
    "year": 2009
  },
  {
    "title": "Qi4j Persistence",
    "level": "advanced",
    "intendedAudience": "* People who has seen other Qi4j presentations, and want a more hands-on look at what it can do. OR, * People who has browsed around on the Qi4j website (http://www.qi4j.org) and need a more directed guide to how to put it into action. OR, * People who has a basic understanding of Qi4j, and want to see how Qi4j can improve quality, time-to-market and maintainability of domain-rich applications.",
    "summary": "Learn how Qi4j radically improves persistence for domain-rich applications.",
    "description": "Qi4j, the radical approach to domain-rich applications with Java, is turning most so called wisdom of our industry on its head. Instead of building on top of low level abstractions, Qi4j starts at the business value, business modeling and solves the technology stack from top to bottom. No rock is left unturned, and exciting new modeling discoveries have been made along the journey. In this presentation we will cover the Persistence approach, how Qi4j is capable of decoupling the domain model from the underlying persistence system, able to swap persistence without change of code, able to express queries in Java without depending on the underlying query language, and how long-running \"Unit Of Work\" is superior to database transactions when it comes to domain modeling.",
    "keyWords": [
      "Alternative Languages",
      "Core Java",
      "Domain-driven design",
      "Innovative use of IT",
      "Java Frameworks",
      "Architecture and Design"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Niclas Hedhman",
        "biography": "Niclas Hedhman has 25 years professional software experience, in anything from 192 byte embedded systems to complex enterprise systems. He is a Member of the Apache Software Foundation, where he has contributed to several projects. After getting increasingly frustrated with XML, RDBMSes, property files and \"frameworks\" that slow you down more than help you, Niclas and Rickard Öberg got together in 2007 to discuss ideas and as a result created the Qi4j project, set out to challenge the way we build business applications. He lives and enjoys life in tropical Malaysia."
      }
    ],
    "year": 2009
  },
  {
    "title": "Introduksjon til høytsvevende arkitekturer",
    "level": "intermediate",
    "intendedAudience": "Systemeiere, utviklere, og driftere som har lyst til å lære mer om konsekvensene av å kjøre applikasjoner på en sky.",
    "summary": "Vi vil oppsummere hva \"cloud computing\" er, fortelle om utfordringer med å bruke klassisk java-arkitektur på systemer som skal kjøres i en sky, og vise hvordan problemene kan løses.",
    "description": "\"Cloud computing\" er en av de varmeste potetene i IT-verdenen i dag. Man har flere typer skyer, flere leverandører og mange forskjellige måter å sette sammen sine systemer. En forutsetning for å vurdere utvikling av en cloud-basert løsning er at man har et problem som går utover en maskin. Dette kan være problemer knyttet til skalering, tilgjengelighet, replikering, backup, mm. Man har behov for å skalere horisontalt. Slike krav kan i stor grad påvirke systemets arkitektur og valg av teknologier. I dette foredraget vil vi systematisere problemstillinger til arkitekturer for systemer som kjører i en sky, og komme med konkrete forslag til arkitekturer og løsninger. Noen av emnene vi vil dekke er: * Feature-orienterte applikasjoner * Utviklingsprosessen * Tilstand * REST * Versjonering * Rullende oppgradering * Skalering * Tilgjengelighet * Dokumentdrevne databaser * Replikering * Økonomi Dette er en oppbygning til foredraget \"En Praktisk guide til Høytsvevende Arkitekturer\".",
    "keyWords": [
      "Architecture and Design",
      "Web as a Platform",
      "Innovative use of IT"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Trygve Laugstøl",
        "biography": "Trygve Laugstøl jobber i Arktekk som utvikler, arkitekt og har mange års erfaring med Java-utvikling. Han har lang erfaring med utvikling og bruk av åpen kildekode som kjerneutvikler av Maven 2 og Continuum. Trygve har jobbet lenge med utvikling av plugins som støtter opp om smidig utvikling og som rådgiver innenfor disse områdene."
      },
      {
        "name": "Kristian Nordal",
        "biography": "Kristian Nordal jobber til daglig hos Arktekk, som Java-utvikler med hovedfokus på open source og smidig utvikling. Han er commiter på Codehaus sitt prosjekt for Maven-plugins og har i flere år deltatt i utviklingen av Maven 2-plugins, som for eksempel den første pluginen for Jetty5 og appassembler-pluginen."
      }
    ],
    "year": 2009
  },
  {
    "title": "Smidig interaksjonsdesign - sånn gjør jeg det!",
    "level": "beginner",
    "intendedAudience": "Alle som har kjennskap til smidig utvikling, f.eks. utviklere, product owner, interaksjonsdesignere og prosjektledere.",
    "summary": "Smidig metodikk er som skapt for god interaksjonsdesign! Jeg forteller hvorfør og hvordan man får det til!",
    "description": "Hvordan kan og bør interaksjonsdesigner jobbe i smidige prosjekter for å oppnå best mulig resultat og samarbeid sammen med teamet og kunden. Jeg tar utgangspunkt i egen erfaring som interaksjonsdesigner i smidige prosjekter og forteller om hvilke metoder og prosjektkonstellasjoner som jeg syns har fungert best.",
    "room": "Lyntale",
    "keyWords": [
      "Agile and Software Engineering",
      "Usability"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Klara Vatn",
        "biography": "Klara Vatn jobber som senior interaksjonsdesigner og funksjonell rådgiver i BEKK. Hun er medlem av BEKKs faggruppe for samhandling og sosial programvare, Virksomhet 2.0 Klara har lang erfaring med smidig utvikling i prosjekter for større organisasjoners løsninger for selvbetjening og samhandling. Hennes bidrag er å finne hos bl.a. NAV, Posten Norge og Statens Vegvesen."
      }
    ],
    "year": 2009
  },
  {
    "title": "Java™ and JavaFX™ Technology and the Nintendo Wiimote: Just How Much Fun Can You Have?",
    "level": "intermediate",
    "intendedAudience": "People interested in innovative and cool uses of Java and JavaFX",
    "summary": "This session will explore how to use Java, JavaFX and the remote control from a Nintendo Wii to drive some strange and unusual user interfaces.",
    "description": "The Nintendo Wii has changed the way many people perceive computer games, shifting from the traditional console to a more natural, physically interactive experience. To achieve this, the Wii includes an innovative remote control (or Wiimote). To provide control of an on-screen cursor, the Wiimote has a special camera that can track up to four points of infrared light and report their positions in real time. This session explores how the Wiimote can be used in ways not originally intended by the Wii designers. Example applications keep the Wiimote stationary and use it to track moving infrared LEDs, which can be mounted on a pen, a screen, or even an umbrella. Data about the position of the infrared lights can be used to control the position of images so they are always projected on a screen or to provide a virtual whiteboard environment. The demonstrations use JSR 82 (Java™ APIs for Bluetooth), the WiiremoteJ open-source API, a Java platform library, and JavaFX™ code to drive the user interface. The session shows how JavaFX technology really is, \"for all the screens of your life\", including ones you've never thought of.",
    "keyWords": [
      "Frontend Technologies",
      "Innovative use of IT",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Simon Ritter",
        "biography": "Simon Ritter is a Technology Evangelist at Sun Microsystems. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K. Originally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon moved to Sun in 1996. At this time he started working with Java technology and has spent time working both in Java technology development and consultancy. He now specialises in looking at emerging technologies including cloud computing, wireless sensor networks and gestural interfaces."
      }
    ],
    "year": 2009
  },
  {
    "title": "The Essence of User Interface Programming",
    "level": "intermediate",
    "intendedAudience": "Junior and senior developers with an interest for user interface development. Project managers will also be given insight into how to approach user interface work in projects.",
    "summary": "Many developers approach the task of creating a user interface in much the same way five year olds play soccer. Everyone runs around chasing the ball without a plan or sense of the tactics involved in soccer. This talk is a helping hand for those of you who wants to learn the secrets of how to become a good user interface developer.",
    "description": "With the financial crisis is sweeping the globe and once again there will be a call for developers world wide to become more versatile. This means more programmers having to do user interface work along with their regular tasks. Most developers approach the task of creating a user interface in much the same way a team of five year olds play soccer, everyone runs around chasing the ball without a plan or sense of the tactics involved in soccer. This talk is a helping hand for those of you who wants to learn the secrets of how to become a good user interface developer. Working with user interface development is nothing different from regular programming. This talk will introduce you to the essence of programming UI. You will be given tools and methods which will help you enter a state where you and your user interface become one.",
    "keyWords": [
      "Web as a Platform",
      "Usability",
      "Frontend Technologies",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Espen Dalløkken",
        "biography": "Espen Dalløkken have been working in the software development industry since 1998 working for companies such as Razorfish, Bekk Consulting and Fast, Search & Transfer. In addition he has been CTO of music start-up Ezmo and manager at Open AdExchange. Experience with Java and .Net platforms combined with years of experience with traditional web technologies and the Flex Framework gives him the perspective to see the best solutions regardless of technology. Espen is a follower of an agile approach to software development and a dedicated student of the art of Lean Software Development. http://dallokken.com/espen/"
      }
    ],
    "year": 2009
  },
  {
    "title": "Solr:Search at the Speed of Light",
    "level": "intermediate",
    "intendedAudience": "Developers of all levels will benefit from this fast paced demonstration of the simplicity of Solr usage. Intermediate developers are best suited to build Solr-based solutions. Even beginner developers will be effective at leveraging Solr in a real-world application after this session.",
    "summary": "Solr is a star in the enterprise search world, powering very popular ecommerce systems, content management systems, and many other internal and externally facing search systems throughout the world. This presentation will show you the power and ease of use of Solr in a fast paced \"zero to search\" live demonstrations of the Lucene powered Apache Solr technology.",
    "description": "In this session Erik will launch Solr and index various types of content including database, file system rich documents (PDF, Word, HTML, etc), XML, CSV, Atom feeds, and perhaps others. Various ways to interact with and build upon Solr's capabilities will be demonstrated, including several user interface starting points and pragmatic real world operations such as scheduling indexing operations and scaling for load and corpus size. We'll see within the live demonstrations Solr's popular features: * full-text search * faceting * highlighting * more-like-this * spell checking / did-you-mean * API from Java, Ruby, command-line",
    "keyWords": [
      "Tools and Techniques",
      "Java Frameworks",
      "Enterprise Architecture and Integration",
      "Frontend Technologies"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Erik Hatcher",
        "biography": "Erik, co-author of Lucene in Action and Java Development with Ant, is an experienced developer and accomplished speaker on many technical topics. Erik has taught Solr and Lucene at many ApacheCon conferences, and he's a former speaker on the No Fluff, Just stuff symposium circuit. He is a technical team member and co-founder of Lucid Imagination, a company dedicated to supporting the Lucene/Solr ecosystem."
      }
    ],
    "year": 2009
  },
  {
    "title": "Reconsidering cherished design dogmas",
    "level": "intermediate",
    "intendedAudience": "The audience be hands-on developers with a couple of years under their belt. Architects may also come, but I won't say that they're actually welcome. (Just joking) This talk will inspire you to reduce the complexity of your system by recognizing when the dogmas of software design aren't helping. The effect will be less effort, less nervousness and more joy when you maintain you code base.",
    "summary": "Is your code perfectly decoupled, reusable and generic? Maybe it shouldn't be. In this example-driven talk, we strike a blow for simplicity. We take to task current notions of high-quality software architecture and show how even modern approaches are needlessly complex.",
    "description": "Reuse, genericity and decoupling have recently been treated as the very goals of software development. But they are not. You probably feel you should reuse as much code as possible, be it your own, that of you organization or third party open source or commercial software. But just because the code is already written doesn't mean you won't have to understand, debug and maybe even change it. You probably feel you should write your code in a generic fashion so it can be reused. But generic code can be harder to understand. And making a piece of code flexible to certain kinds of changes will make it less flexible to other changes. Moving decisions to configuration can make your code more generic, but often, it will increase the cost of change. You have probably learned that you must reduce the extent to which parts of your code is coupled to each other if you are to create maintainable code. So all your objects reference each other through interfaces and are wired together in huge XML files. But this makes the code harder to navigate and refactor. In the quest for better software reuse, genericity and decoupling has become ends in themselves. In this talk, we will show how examples of how contemporary notions of good design have led us and others to solutions that are overly complex. \"A good design\" is not a goal in itself. The goal is a system that requires as little effort as possible to develop and change. Proper use of reuse, decoupling and genericity can help with this goal. Improper use almost always hurts. So how do you measure something like simplicity? We would like to revive an often reviled metric: Lines of code. More specifically, how many executable statements do you have to deal with to maintain the code? Software developers have to be smart. But if you sometimes get the feeling we're too smart for our own good, this talk is for you.",
    "keyWords": [
      "Alternative Languages",
      "Domain-driven design",
      "Architecture and Design"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Johannes Brodwall",
        "biography": "Johannes is just a developer (but his business card reads \"chief scientist\" and his project plan gives him the august title \"architect\"). He's crafted code for ten years. When he started out, he wrote simplistic code. Then he learned to write elegant code. Now, he just tries to write simple code."
      },
      {
        "name": "Finn-Robert Kristensen",
        "biography": "Finn-Robert has been working as a java developer for eight years and his working title is architect. His passion for developing software started when he got his first commodore 64 and he has been striving for good design since. He has fallen into many pitfalls, but feels he has learned from his mistakes."
      }
    ],
    "year": 2009
  },
  {
    "title": "Patterns for persisting large and rich domain models",
    "level": "intermediate",
    "intendedAudience": "software architects, developers",
    "summary": "Learn how to persist large and rich domain models in a performant and scalable way",
    "description": "The tenets of Domain-Driven Design are well documented, and its mindshare has expanded massively in recent years, due to the brilliant work of Eric Evans and others. However, knowledge on persisting large and rich domain models, especially in a performant and scalable way, is basically non existing. Lessons learned by architects of high-scale DDD/OO-based systems in production settings are largely absent from the professional literature. And yet such knowledge should be of significant value to current practitioners responsible for the development or operation of such systems with performance and scalability concerns. Therefore this seminar talk will focus on the persistence of domain models, the typical problems that arise around performance, scalability, and transaction isolation in domain model persistence, some observed solutions to those problems, and the consequences of those solutions for application architecture. Drawing on the presenter's two decades of experience practicing DDD in multiple production systems, with different programming languages and various object persistence technologies, the talk will briefly survey the evolution of object persistence approaches, noting their performance, scalability, and isolation characteristics, culminating with exciting new possibilities offered by data grid technologies. However the bulk of the emphasis in the talk will be placed on patterns of domain model persistence with current Java ORM technologies.",
    "keyWords": [
      "Domain-driven design",
      "Architecture and Design"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Randy Stafford",
        "biography": "Randy Stafford is a practicing software professional with 20 years’ experience as a developer, analyst, architect, manager, consultant, and author/presenter. Currently for Oracle’s middleware development A-Team, he engages globally for proof-of-concept projects, architecture reviews, and production crises with diverse customer organizations, specializing in grid, SOA, performance, HA, and JEE/ORM work. In past lives, Mr. Stafford has been Technical Advisor to agile vendor Rally Software, Chief Architect of SaaS company IQNavigator, Director of Development of SynXis Agent (acquired by Sabre), consultant for GemStone and Smalltalk, and a simulation specialist in the aerospace and CASE industries. Long active in the professional community, he was a contributor to Martin Fowler’s Patterns of Enterprise Application Architecture and Floyd Marinescu’s EJB Design Patterns, and a reviewer of other enterprise patterns books. He has presented at conferences of the Society for Computer Simulation, the International Council on Systems Engineering, the Agile Development Conference, and Oracle Open World, and he has participated heavily in online communities devoted to architecture and agile development. His professional interests include domain model persistence, enterprise application architecture, application performance management, requirements analysis and specification, software development process, organizational culture, and leadership of people. Mr. Stafford is motivated to improve the practice of software development and solve problems facing society. He lives in his native Denver, Colorado with his wife and family."
      }
    ],
    "year": 2009
  },
  {
    "title": "Fra Oracle Forms til Rails på 80 dager",
    "level": "beginner",
    "intendedAudience": "Alle som er nysgjerrige på Ruby on Rails og vil høre erfaringer med teknologien gjort av Java utviklere.",
    "summary": "En erfaringspresentasjon fra et Ruby on Rails prosjekt.",
    "description": "Ruby on Rails applikasjoner går for å være mer effektive å utvikle enn tilsvarende applikasjoner i Java. Dette fikk vi også erfare da vi utviklet en funksjonsrik Ruby on Rails applikasjon klar for produksjon på 3 måneder. Applikasjonen erstattet en eksisterende Oracle Forms applikasjon med over 200 skjermbilder med CRUD funksjonalitet. JRuby ble valgt for å støtte integrasjon mot eksisterende Java kode, samt krav om deployment på JBoss.",
    "room": "Lyntale",
    "keyWords": [
      "Experience Reports",
      "Alternative Languages"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Nils Christian Haugen",
        "biography": "Nils Christian trives best når han kan hjelpe til med å skape applikasjoner som gleder både brukerne og sponsorene. Han har lang erfaring med smidig systemutvikling som programmerer, arkitekt, prosjektleder og coach, blant annet fra ThoughtWorks og som CTO i Know IT Objectnet. I dag jobber Nils Christian som selvstendig konsulent fra sitt eget firma, Wasteless AS. Han holder ofte foredrag og kurs for bedrifter og brukerforeninger og har presentert på mange konferanser både nasjonalt og internasjonalt. Nils Christian er også medforfatter av læreboken \"Innføring i informasjonsteknologi\"."
      },
      {
        "name": "Roy Paulsen",
        "biography": "Roy jobber som konsulent i Know IT Objectnet og har over 13 års erfaring innen systemutvikling. Java og J2EE har vært hans spesialområde de siste 10 årene, med spesielt fokus på web løsninger. I tillegg har han bred kompetanse innen databasemodellering og SQL programmering etter mange år i Sybase Norge as. I den senere tid har han bygd solid kompetanse på Ruby og Rails med deltagelse i fagarbeid og prosjekt for Know IT Objectnet."
      }
    ],
    "year": 2009
  },
  {
    "title": "Finanisering av fri programvare",
    "level": "beginner",
    "summary": "Prosjektet FriKomPort har vært gjennom flere faser med forskjellige finansieringsmodeller. Foredraget er en oppsummering av disse og en presentasjon av dagens modell og hvorfor vi har valgt nettopp denne.",
    "description": "FriKomPort er en løsning for å administrere kurs/arrangement og påmeldinger til disse. Finansieringmodellene vi har benyttet oss av er Stafettfinansiering og Dugnadfinansiering. Løsninga var i første omgang betalt av kunden Kongsbergregionen, som er et kommunalt samarbeidsorgan for 8 kommuner i Buskerud og Telermark. I etterkant har andre kunder betalt for egen funksjonalitet som har komt alle brukerene til gode. Etterhvert har brukergruppen blitt så stor at vi har innført et utviklingsabonnement som gir brukerene tilgang til å være med å påvirke i hvilken retning prosjektet skal bevege seg med hensyn til funksjonalitet og videreutvikling. Tanken er at jo flere som har interesse av at løsningen lever, desto flere vil være med på finansieringen og dermed dele på kostnaden ved utviklingen.",
    "room": "Lyntale",
    "keyWords": [
      "Experience Reports"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Gunnar Velle",
        "biography": "Gunnar Velle er seniorkonsulent hos Know IT Objectnet og har vore ansatt der sidan 2001. I løpet av denne tida har han jobba med fleire virksomhetskritiske systemer, blandt annet for Statens Vegvesen, Norsk Hydro og siste åra NSB. Siden 2007 har han hatt ansvar for FriKomPort og har også tidligere hold foredrag om prosjektet og finansieringsmodellen."
      }
    ],
    "year": 2009
  },
  {
    "title": "Green Patches in a Brown Field",
    "level": "intermediate",
    "intendedAudience": "Programmers and architects who want to make their real life projects more fun. After attending this talk you should have learned a few tricks that can make working with legacy code just as fun as starting with a clean slate,",
    "summary": "Learn how to have as much fun with legacy code as you have on \"greenfield\" projects.",
    "description": "Everybody loves to start with a clean slate and build software from scratch. Unfortunately, such \"greenfield\" projects are hard to come by and most of us work with less glamorous \"brownfield\" software. A \"brownfield\" application can be a monolith you've inherited from others, a new project that needs to use existing legacy components or third party solutions. In this talk Anders Norås shares his real-world experiences on how to approach \"brownfield\" applications with the state-of-the-art concepts, patterns, and tools you've learned to apply to new projects. You'll learn what patterns you can apply to shield yourself from legacy cruft, how to find good refactoring opportunities and when choosing suboptimal designs for parts of your solution can help the solution as a whole. Whether your maintaining an existing application, building new software atop of legacy components or simply cleaning up the mess others left behind, you're sure to pick up some tricks to combat the designs that otherwise would ruin your day.",
    "keyWords": [
      "Experience Reports",
      "Architecture and Design",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Anders Norås",
        "biography": "Anders is a seasoned software developer and speaker. EJBs drove him to Microsoft .NET back in 2002. He made a name for himself in the .NET community using his Java-experiences to get a head start. Today he is a polyglot combining the best of all worlds to build better software. He has given talks on many conferences and user group meetings and is known for talks with few slides and lots of code. Anders lives in Norway where he works as the Chief Technology Evangelist for Objectware."
      }
    ],
    "year": 2009
  },
  {
    "title": "Åpne data - en gullgruve",
    "level": "beginner",
    "intendedAudience": "Utviklere som kan tenke seg å bruke eller skape åpne datasett. IT-arkitekter og strategiske ledere som vil vite om mulighetene som ligger i åpne data. Kunnskapsforvaltere som vil vite om hvilke åpne muligheter som finnes. Foredraget krever ingen forkunnskaper utover generell IT-forståelse.",
    "summary": "Data er viktigere enn kildekode på grunn av normalt lengre levetid. Åpne data er fritt å bruke og utvide, og skaper merverdi for både opphavsmenn og brukere. Åpne data har gitt stor verdi til de som har våget å gripe muligheten, og du selv kan gjøre det i dag!",
    "description": "Data er viktige, og i stor grad mye viktigere enn kildekoden til programmene som skaper dataene. Dette er fordi data og ikke minst dataformater ofte har mye lengre levetid enn den koden de opprinnelig stammer fra. Bruk av åpne data kan derfor gi mange fordeler, både på mange områder innenfor egen virksomhet og for fellesskapet utenfor. Selskapet GoldCorp gjorde i 2001 sine familiejuveler, nemlig geologiske data for den gamle gullgruven Red Lake, tilgjengelig for alle på Internett. Deretter utlyste de pengepremier for å finne nye gullårer i datasettet, noe som tiltrakk seg hundrevis av forslag fra hele verden hvor også svært mange førte til nye gullfunn. Både slik crowdsourcing og annen bruk av åpne data viser hvordan man kan sikre god organisering, håndtering, tilgjengelighet og optimal utnyttelse av viktige data, langt inn i framtiden! Gjennom denne introduksjonen til åpne data vil dette foredraget gi tilhørerne et utgangspunkt for å lære mer og ta i bruk åpne data på egen hånd.",
    "keyWords": [
      "Innovative use of IT"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Svein-Magnus Sørensen",
        "biography": "Svein-Magnus er sivilingeniør i kommunikasjonsteknologi fra NTNU, og er ansatt som forretningsanalytiker i avdelingen for Digital Forretningsutvikling hos Objectware AS. Hans primære faginteresser omfatter webteknologi, innovasjon, sosiale medier, informasjonsarkitektur og brukeropplevelser, og han har arbeidet med disse fagområdene siden 2006. Svein-Magnus skriver jevnlig om faglige emner i sin weblog på http://blog.menneske.org og på Twitter som @SveinMagnus."
      }
    ],
    "year": 2009
  },
  {
    "title": "One web, CSS3, and HTML5",
    "level": "intermediate",
    "summary": "One web.",
    "description": "The web is the biggest information revolution since the advent of printing. Simple languages like HTML and CSS has made it easy to publish information that can reach a billion browsers. HTML5 and CSS3 are emerging specifications that will will make web pages richer, more compact, and more standards-complient. This presentation will demonstrate new features, and discuss how long they will last.",
    "keyWords": [
      "Alternative Languages",
      "Web as a Platform",
      "Frontend Technologies"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Håkon Wium Lie",
        "biography": "CTO, Opera Software"
      }
    ],
    "year": 2009
  },
  {
    "title": "Opphavsrett og datamaskinprogrammer",
    "level": "beginner",
    "intendedAudience": "All audiences",
    "summary": "Datamaskinprogrammer egnes som litterære verk og vernes etter åndsverkloven. Det betyr i utgangspunktet at de reguleres av de samme bestemmelsene som f eks norsk lyrikk. Hvordan har det seg egentlig at dette ble resultatet – og er det lurt? I et program er funksjoner viktig, mens formen kan være sentral i poesi – og opphavsretten verner bare uttrykket. Opphavsmannen får en enerett til å utnytte verket – både poesi og program. Men til gjengjeld skal hvem som helst kunne lese lyrikken, skjønne den, bli klokere og dikte videre selv. Et program i objektkode lar seg i praksis ikke lese – er dette en slags bristende forutsetning for å gi det vern?",
    "description": "Datamaskinprogrammer egnes som litterære verk og vernes etter åndsverkloven. Det betyr i utgangspunktet at de reguleres av de samme bestemmelsene som f eks norsk lyrikk. Hvordan har det seg egentlig at dette ble resultatet – og er det lurt? I et program er funksjoner viktig, mens formen kan være sentral i poesi – og opphavsretten verner bare uttrykket. Opphavsmannen får en enerett til å utnytte verket – både poesi og program. Men til gjengjeld skal hvem som helst kunne lese lyrikken, skjønne den, bli klokere og dikte videre selv. Et program i objektkode lar seg i praksis ikke lese – er dette en slags bristende forutsetning for å gi det vern? Noen av disse spørsmålene besvares, samtidig som det gis en kort innføring i det opphavsrettslige vernet av datamaskinprogrammer, overgang av rettigheter i arbeids- og oppdragsforhold, og forholdet til patentering av programmer. Det forutsettes ingen forkunnskaper, så foredraget innledes med en presentasjon av opphavsmann, åndsverk og enerettene til å råde over programmet.",
    "keyWords": [
      "Usability",
      "Experience Reports"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jon Bing",
        "biography": "Jon Bing er forfatter og jusprofessor ved Senter for rettsinformatikk ved Universitetet i Oslo. Han er også prisbelønt for sine bidrag som romanforfatter, dramatiker, forsker og regnes som en foregangsmann innenfor internasjonal rettsinformatikk og opphavsrett. Han har ledet og deltatt i utallige råd, tillitsverv og utvalg både nasjonalt og internasjonalt."
      }
    ],
    "year": 2009
  },
  {
    "title": "Redis, a new kind of key-value database",
    "level": "beginner",
    "summary": "Redis is a new kind of key-value database. It is a scalable high-performing distributed in-memory database that supports atomic and non-blocking operations. This presentation will give an introduction to this new open source project.",
    "description": "Redis is a key-value database that stands out from the crowd. It is not just another key-value database as it provides atomic and non-blocking operations on its keys and values. In Redis the values can be either primitives, sets or lists. Most other key-value databases allow only simple values like strings or bytes. There are commands to perform complex operations on these data structures, most in constant time. It is therefore not unreasonable to think of Redis as a data structures server. The dataset can be replicated using a master-slave setup and also be distributed across a set of servers using consistent hashing. The server provides blazing performance as most operations are non-blocking and the entire dataset is kept in-memory. Performance tests have shown results of 10000 SETs/second, 81000 GETs/second on an entry level Linux box. Redis is open source, and the database server and clients are being hosted on Google Code. The project is aiming for a final 1.0 release mid June 2009. In the presentation we'll take a look at the characteristics of the database server and the operations that it provides including demos of how it works in practice. The Java client will also be reviewed.",
    "room": "Lyntale",
    "keyWords": [
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Geir Ove Grønmo",
        "biography": "Works at Bouvet as a consultant. He is one of the founders and main architects behind the Ontopia Topic Maps software (now an open source project). He has been working with innovative and exciting technologies for many years and never stops looking for new ones to explore."
      }
    ],
    "year": 2009
  },
  {
    "title": "Ekstern DSL med Parser Combinators i Scala",
    "level": "advanced",
    "intendedAudience": "expected: Alle med interesse for * programmeringsspråk * scala * dsl * funksjonell programmering benefit: vil lære hvordan man kan utvikle et språk i Scala knowledge: kjennskap til Scala eller andre funksjonelle språk er en fordel, men ikke en nødvendighet.",
    "summary": "En innføring i utvikling av et eksternt domenespesifikt språk i Scala. Med fokus på det praktiske, vil veien fra tekst til et fungerende språk presenteres",
    "description": "I blant har man behov for et lite domenespesifikt språk, for eksempel for konfigurasjon. Der en intern dsl av forskjellige grunner ikke strekker til, velger man gjerne enten svake property filer, eller verbos og vanskelig xml. En bedre løsning kan være å skrive et eget språk, spesialisert for oppgaven. Combinatory parsing, kjent fra funksjonell programmering baserer seg på å kombinere små enkle parsere for å bygge en komplett og mer kompleks parser. Scala, et moderne og kraftig språk for java plattformen, kommer med parser combinator bibliotek som en del av standard distribusjonen. Foredraget vil presentere hvordan man kan implementere et lite programmeringsspråk i Scala. Fokuset vil være på det praktiske mer enn det teoretiske, der det blir gitt en innføring i alle stegene nødvendig for å skrive et eget lite programmeringsspråk som kan benyttes fra Java.",
    "keyWords": [
      "Alternative Languages",
      "Tools and Techniques"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jon-Anders Teigen",
        "biography": "Jon-Anders Teigen er en Scala entusiast med interesse for programmeringsspråk generelt. Han er en av grunnleggerne av scalaBin (Scala brukergruppen i Norge) i tillegg til å være en aktiv medlem av javaBin. Om dagen jobber han som Javakonsulent i JPro, og om natten hacker han Scala :-)"
      }
    ],
    "year": 2009
  },
  {
    "title": "The Forgotten Art of Batch Programming",
    "level": "intermediate",
    "intendedAudience": "Developers and architects that want to learn new (or old) techniques about handling high volumes of data and possibly get some insights on integrating and transforming mainframe applications.",
    "summary": "If all you need is a Bicycle, having a Space Shuttle instead isn't a good thing. Processing high volumes of data in batches using message oriented architecture and a relational database is something you should avoid (unless you are a real rocket scientist!). Instead you can try an easier approach using standard Java SE. This talk is about handling high volumes of data from legacy systems using Java.",
    "description": "You may think this is a stupid presentation. Who would ever get millions of transactions in files from a legacy system? Transactions will be placed from Web and properly load balanced as they get in. But the fact of the matter is, don't be so sure. There is a lot of legacy systems out there. In 1997 the Gartner Group estimated that there were 240 billion lines of Cobol code in active apps. Something like 90 percent of financial transactions are processed by Cobol code, and 75 percent of all business data processing is Cobol. Most of that code is still there after being fixed for 2000 bug. So why is all this Cobol stuff relevant to me? I develop using Java, not Cobol (Thank God!). It's relevant because Java is ready for the heavy lifting of replacing all this code. But since all systems can't be replaced in one go, you must interface with the existing solutions. Doing that using typical Java stack in the typical Java way, can give you an over-engineered and badly designed solution. The speaker spent the last 3,5 years as a software architect and developer replacing large mainframe applications using best practice Java architecture (Message oriented, Spring, Hibernate etc). Doing so he realized that new techniques have their place, but processing large batch files using Domain Driven Design and Hibernate probably wasn't the easiest way of dealing with legacy code and integration.",
    "keyWords": [
      "Architecture and Design",
      "Enterprise Architecture and Integration",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Morten Udnæs",
        "biography": "Morten currently works a senior consultant for Miles AS. His has been an active developer since the early 90s developing financial applications using Cobol/Mainframes, Client-Server technology, Microsoft .NET and Java. Learning the hard way that complexity is always bad, he spends his time getting better at using Agile methods, lightweight architectures and Cloud Computing."
      }
    ],
    "year": 2009
  },
  {
    "title": "Scala & Wicket, match made in heaven? A case study of JavaZone's web submission application",
    "level": "intermediate",
    "intendedAudience": "Some knowledge of web development is a plus, but not a requirement.",
    "summary": "Scala is a modern programming language on the Java VM, combining the best of OO and functional programming. Wicket is a popular stateful component-based web framework. In this talk we present these two technologies and some of the observed strengths and weaknesses of combining them.",
    "description": "Tired of XML in your web applications? Looking for a better language which lets you do more with less? Scala is a modern programming language on the Java VM, combining the best of OO and functional programming. Wicket is a popular stateful component-based web framework. We have developed SubmitIT, a web application to collect presentation proposals for the JavaZone programme committee. In this presentation we start by giving some background on JavaZone, the review process and the pains of a growing conference. Then we introduce SubmitIT and give an overview of the core technologies used, Scala and Wicket. We present some of the challenges we had to overcome when combining a Java-based web framework with Scala, as well as the available tool support. Finally we conclude with some remarks on productivity and code quality.",
    "keyWords": [
      "Alternative Languages",
      "Tools and Techniques",
      "Frontend Technologies",
      "Java Frameworks",
      "Experience Reports"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Fredrik Vraalsen",
        "biography": "Fredrik Vraalsen is a Java developer/consultant at Know IT Objectnet, doing design and development on a large sales back-end system and client application for NSB. He is also a Scala enthusiast and co-founder of scalaBin as well as member of the JavaZone programme committee for the past two years. Fredrik received an M.Sc. degree from the University of Illinois at Urbana-Champaign in 2001 and has over 10 years of experience as a software developer working with J2EE, Swing client applications and Java/C++ on mobile devices. After graduating he was as a researcher and developer at SINTEF for 5 years with a focus on software development methodology, mobile systems and model-based security analysis."
      },
      {
        "name": "Alf Kristian Støyle",
        "biography": "Alf Kristian is always eager to find better ways. He is very interested in lightweight development and has been a Scala enthusiast for more than a year. Alf Kristian is co-founder of scalaBin, the Norwegian Scala User Group, and he has been a member of the JavaZone programme committee for the past two years. Alf Kristian has more than 5 years of experience within software development and consulting, and he currently works for Know IT Objectnet AS."
      }
    ],
    "year": 2009
  },
  {
    "title": "A Cuke for Duke - Awesome Java BDD",
    "level": "intermediate",
    "intendedAudience": "* Customers * People who write requirements (product owners) * Java programmers * Testers",
    "summary": "Cucumber (http://cukes.info/) is a novel tool for Behaviour Driven Development. While most existing TDD/BDD tools are geared towards programmers, classes and objects, Cucumber nicely fills the communication gap between customers, programmers and testers.",
    "description": "Cucumber’s plain text language for describing an application’s behaviour has become a popular tool for many Ruby and Rails teams. With the recent Java support this great tool can be used on Java projects without a single line of Ruby. In this session you will see how Cucumber and BDD can be used on a real Java project. You will learn how to use Cucumber's simple and extensible domain-specific language that lets you marry functional requirements and automated functional tests into one. I will also show how to install and run Cucumber and give you some useful tips about how to get the most out of the tool and the process it is based on. The presentation will be in the form of a small, fast paced project, alternating between customer-team conversations and real-time programming with Cucumber and Java. This session will change how you approach requirements and testing of Java applications.ed project, alternating between customer-team conversations and real-time programming with Cucumber and Java.",
    "keyWords": [
      "Tools and Techniques",
      "Innovative use of IT",
      "Agile and Software Engineering",
      "Java Frameworks"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Aslak Hellesøy",
        "biography": "Aslak Hellesøy is the Chief Scientist of BEKK, a Norwegian business and technology consulting firm. He has been programming Java since 1996 and Ruby since 2003 (plus half a dozen other languages). Aslak was one of the main contributors to the popular XDoclet project which influenced Java annotations. He is also the co-founder of PicoContainer, one of the first simple dependency injection containers for Java. Aslak is a vocal proponent of the process and tool aspects of Behaviour-Driven Development. He is the co-founder of the popular RSpec project for Ruby and the founder of the Cucumber project."
      }
    ],
    "year": 2009
  },
  {
    "title": "Scaling Agile Software Development: Strategies for Applying Agile in Complex Situations",
    "level": "intermediate",
    "intendedAudience": "Everyone, this is a keynote",
    "summary": "Overviews the issues surrounding scaling agile techniques for distributed development teams, regulatory compliance, governance, large teams, complex environments, and leveraging legacy assets.",
    "description": "The majority of organizations have gotten their feet wet with Agile software development techniques and are now hoping to take it to the next stage. However, they’re discovering that the simple methodologies they initially adopted aren’t sophisticated enough to address the complex situations they find themselves in. This presentation overviews agile software development, shares data from recent industry surveys as to the adoption rate and success rate of agile techniques, and explores scaling issues such as distributed development teams, regulatory compliance, governance, large teams, complex environments, and leveraging legacy assets. Practices from the Rational Unified Process (RUP), Agile Modeling (AM), and Lean Development Governance which help to address scaling factors will be described in detail, as will tooling strategies. Once you go beyond the Agile rhetoric you will find that you can in fact scale it to meet the complexities of the real-world situations you find yourself in.",
    "keyWords": [
      "Agile and Software Engineering"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Scott W. Ambler",
        "biography": "Scott W. Ambler is Chief Methodologist/Agile with IBM Software Group and he works with IBM customers around the world to improve their software processes. He is the founder of the Agile Modeling (AM), Agile Data (AD), Agile Unified Process (AUP), and Enterprise Unified Process (EUP) methodologies. Scott is the (co-)author of 19 books, including Refactoring Databases, Agile Modeling, Agile Database Techniques, The Object Primer 3rd Edition, and The Enterprise Unified Process. Scott is a senior contributing editor with Information Week. His personal home page is http://www.ibm.com/software/rational/leadership/leaders/#scott and his Agile at Scale blog is www.ibm.com/developerworks/blogs/page/ambler."
      }
    ],
    "year": 2009
  },
  {
    "title": "Ioke - A folding language",
    "level": "intermediate",
    "intendedAudience": "The expected audience should have an interest in dynamic languages or DSLs. They will learn how Ioke can be used to create extremely expressive programs, using existing infrastructure.",
    "summary": "An introduction to the Ioke language.",
    "description": "Ioke is a new language, an experiment to see how expressive a language can be. It's a language for the JVM influenced by Io, Self, Smalltalk, Lisp and Ruby. It supports a prototype based object oriented system, is homoiconic, supports high level methods and macros and makes it easy to build DSLs and new abstractions from scratch. The presentation will first talk about the motivation for a new language, then talk about some of the more interesting features of Ioke, including the object system, the macro system and java integration features. It will also talk about how Ioke can be used in conjunction with other languages in a polyglot programming style.",
    "keyWords": [
      "Alternative Languages"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Ola Bini",
        "biography": "Ola Bini is a Swedish developer currently working for ThoughtWorks in Stockholm, Sweden. He is the creator of the language Ioke, and has been one of the core developers for JRuby since 2006. He is the author of the APress book Practical JRuby on Rails. He has much experience with Java, Ruby and LISP, and has been involved with several other open source projects. He has spoken at numerous conferences, including JavaOne, JavaZone, JavaPolis, QCon, JAOO, RailsConf, TheServerSide Java Symposium, JFokus, and many more"
      }
    ],
    "year": 2009
  },
  {
    "title": "Agile Enterprise Development with Groovy and Grails",
    "level": "intermediate",
    "intendedAudience": "JavaEE developers interested in the power of dynamic languages and convention-over-configuration frameworks.",
    "summary": "Let the Grails Web Application Framework turbo-charge your JavaEE development.",
    "description": "Many enterprises have made heavy investments in the JavaEE platform. While powerful for complex problems, the productivity of the JavaEE platform has recently been challenged by dynamic web application platforms like Ruby on Rails, Django and Lift. But how can you benefit from the extreme productivity of these dynamic platforms, while still protecting your current investment in the JavaEE platform? Enter Groovy and Grails! Groovy is a dynamic language for the Java Virtual Machine, which integrates seamlessly with any existing Java technology. The Grails Web Application Framework is an advanced and innovative Web-application framework based on Groovy, which delivers excellent productivity regardless of whether you build your application from scratch, provides a Web GUI on top of your JPA entity model, or a Rest based Web Service adapter to your existing Spring or EJB3 based service layer. In this talk, Björn Beskow shows how Groovy and Grails can be efficiently added to your existing JavaEE environment and dramatically boost your developer's productivity.",
    "keyWords": [
      "Alternative Languages",
      "Java Frameworks",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Björn Beskow",
        "biography": "Björn Beskow is a senior consultant at Callista Enterprise, where he works with System Architecture, Technical Project Management, Test Automation and Mentoring. Björn has +15 years of experience working with industrial, military, finance and eCommerce systems. His specialty is architecture, modeling, design, test and build automation on the Java EE platform. He is also a software methodology mentor, and has led many courses in Java/J2EE, Web Development, Object Orientation, Requirements Modeling, Use Case Modeling, Test Methodology, Extreme Programming, Scrum and the Unified Process."
      }
    ],
    "year": 2009
  },
  {
    "title": "The Ghost in the Virtual Machine: A Reference to References",
    "level": "intermediate",
    "intendedAudience": "hard-core developers",
    "summary": "Have you ever wondered whether you should use a weak reference or a phantom reference? If you answered \"yes\" or \"phantom who?\" this is the session for you",
    "description": "Have you ever wondered whether you should use a weak reference or a phantom reference? If you answered \"yes\" or \"phantom who?\" this is the session for you. It covers * The java.lang.ref API * Its gotchas and pitfalls * New APIs that address those gotchas and pitfalls * Reference handling patterns and best practices * ReferenceMap: a new concurrent map with support for strong, soft, or weak keys and values * How references relate to collections, caching, concurrency, and class loaders * And more Walk in with a working knowledge of the language, and walk out an expert in references, referents, reclamation, and other garbage collection necromancy.",
    "keyWords": [
      "Core Java"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Bob (crazy bob) Lee",
        "biography": "Bob Lee is a software engineer at Google. He created the Jolt award winning Guice framework. He currently leads the core library development on Android."
      }
    ],
    "year": 2009
  },
  {
    "title": "DDD panel",
    "level": "intermediate",
    "summary": "This DDD panel debate will be led by Kevlin Henney.",
    "description": "",
    "keyWords": [
      "Domain-driven design"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Kevlin Henney",
        "biography": "Kevlin Henney is an independent consultant based in the UK. He specialises in programming languages, OO design, patterns, development process and software architecture, helping teams adopt techniques and improve their software development through training, mentoring and reviewing. He is and has been a columnist for various magazines and web sites, including the Reg Developer channel of The Register, SearchSoftwareQuality.com and Better Software. He is also coauthor of two volumes in the Pattern-Oriented Software Architecture series, A Pattern Language for Distributed Computing and On Patterns and Pattern Languages."
      },
      {
        "name": "Eric Evans",
        "biography": "Eric Evans, author of Domain-driven Design: Tackling Complexity in the Heart of Software, is a thought leader in software design, domain driven design and domain modeling and particularly focuses on strategic design."
      },
      {
        "name": "Einar Landre",
        "biography": "Einar Landre is a practicing software professional with 25 years’ experience as a developer, architect, manager, consultant, and author/presenter. Currently for StatoilHydro's Business Application Services, he engages in business critical application development, architecture reviews and software process improvement activities, specializing in SOA, Domain Driven Design, use of Multi-Agents and design of large scale networked software intensive systems. Before joining StatoilHydro, Mr. Landre has been consultant and department manager with Norwegian Bouvet, Development manager of TeamWide, technical adviser with Skrivervik Data (SUN & CISCO distributor) and finally software developer with Norsk Data where he implemented communication protocols, operating systems and test software for the space station. Over the last years Mr. Landre has become an active member of the professional community, where he has been author and coauthor of several papers presented at OOPSLA and SPE. He has presented at several international conferences in Europe and the US. His professional interests include object oriented programming, enterprise application architecture, multi-agents, autonomous systems design, requirements analysis and specification, use of systems engineering practices, agile methodologies and leadership in high-tech organizations. He is a member of the ACM and the IEEE Computer Society, as well as the SPE (Society Petroleum Engineers). Mr. Landre holds a MSc in Information Technology from the University of Strathclyde, is an IEEE certified software development professional (CSDP) and lives with his family in Stavanger, Norway."
      },
      {
        "name": "Scott Davis",
        "biography": "Scott Davis is an internationally recognized author and speaker. He is passionate about open source solutions and agile development. He has worked on a variety of Java platforms, from J2EE to J2SE to J2ME (sometimes all on the same project). Scott's books include Groovy Recipes: Greasing the Wheels of Java, GIS for Web Developers: Adding Where to Your Web Applications, The Google Maps API, and JBoss At Work. Scott is the Editor in Chief of aboutGroovy.com, a news and information website that tracks the latest developments in Groovy and Grails. He also writes a regular column for IBM DeveloperWorks -- Mastering Grails. Scott is a frequent presenter at national conferences (such as No Fluff, Just Stuff) and local user groups. He was the president of the Denver Java Users Group in 2003 when it was voted one of the top-ten JUGs in North America. After a quick move north, he is currently active in the leadership of the Boulder Java Users Group. Keep up with him at http://www.davisworld.org."
      },
      {
        "name": "Phil Wills",
        "biography": "Phil Wills spent his university career studying Physics, but having realised he probably wasn't going to be an astronaut, opted for the next best thing: a career in software development for the web. Phil has experience with a broad range of languages and technologies, but has spent the past three years focusing on redeveloping guardian.co.uk with a focus on building a strong domain model and achieving high performance."
      },
      {
        "name": "Greg Young",
        "biography": "Greg Young is an independent consultant who resides in two suitcases (literally!). At the moment of writing he is residing in Montreal, Quebec but loves to travel and may be in a city near you soon. In his spare time you can find Greg on the alt.net list, speaking at conferences or user groups, or floating upside down through rapids in his kayak."
      },
      {
        "name": "Randy Stafford",
        "biography": "Randy Stafford is a practicing software professional with 20 years’ experience as a developer, analyst, architect, manager, consultant, and author/presenter. Currently for Oracle’s middleware development A-Team, he engages globally for proof-of-concept projects, architecture reviews, and production crises with diverse customer organizations, specializing in grid, SOA, performance, HA, and JEE/ORM work. In past lives, Mr. Stafford has been Technical Advisor to agile vendor Rally Software, Chief Architect of SaaS company IQNavigator, Director of Development of SynXis Agent (acquired by Sabre), consultant for GemStone and Smalltalk, and a simulation specialist in the aerospace and CASE industries. Long active in the professional community, he was a contributor to Martin Fowler’s Patterns of Enterprise Application Architecture and Floyd Marinescu’s EJB Design Patterns, and a reviewer of other enterprise patterns books. He has presented at conferences of the Society for Computer Simulation, the International Council on Systems Engineering, the Agile Development Conference, and Oracle Open World, and he has participated heavily in online communities devoted to architecture and agile development. His professional interests include domain model persistence, enterprise application architecture, application performance management, requirements analysis and specification, software development process, organizational culture, and leadership of people. Mr. Stafford is motivated to improve the practice of software development and solve problems facing society. He lives in his native Denver, Colorado with his wife and family."
      }
    ],
    "year": 2009
  },
  {
    "title": "Take back control of your web application frontend",
    "level": "beginner",
    "intendedAudience": "This talk is relevant for developers of web applications, rich clients and user interaction designers. It gives you a refreshing, inexpensive and simple idea for adding functionality to existing web pages. Tags: * Frontend Technologies * Usability * Web as a Platform",
    "summary": "Since applications were put on the web, developers have accepted loss of functionality and control of their product's user experience. We now have the tools to easily retake the web, and give users the functionality they crave.",
    "description": "h1. Problem scenario You are to replace a mainframe system, where the user interface consists of a black console with screens of green text, with a web application. Even though the screens are unintuitive, skilled users can navigate and manipulate the data efficiently. The expensive, high-tech, replacement web application has all kinds of nifty features to please the user visually. But a simple request, such as utilizing function keys and mouse-less navigation can be hard to cater for, because the IT department has standardized browsers on IE6. h1. The proposal Create your own thick client frontend which wraps a web browser widget. Such widgets are maturing and easy to customize. They render advanced pages, tackle JavaScript and Flash just as good as standard browsers. You now have a new layer where you can take control of the user experience where needed. The web page will behave as normally, but you can specifically tailor functionality for the whole application, or the context of a specific page. h1. if( FAIL ) ? If the frontend fails, it was hopefully a cheap investment to throw away. The web application can still be used with a normal browser.",
    "room": "Lyntale",
    "keyWords": [
      "Web as a Platform"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Stig Lau",
        "biography": "Stig Lau has worked as a developer of enterpricy applications and consultant since 2004, and is currently employed by Bouvet. He invents problems and solves them with new technology."
      }
    ],
    "year": 2009
  },
  {
    "title": "Nei, du trenger ingen regelmotor!",
    "level": "beginner",
    "intendedAudience": "Utviklere, arkitekter, testere, forretningsfolk og andre beslutningstakere som jobber med eller vurderer å innføre en regelmotor.",
    "summary": "Fordi de fleste applikasjoner har forretningsregler mener enkelte at man trenger en regelmotor. Imidlertid medfører regelmotoren ofte høy kompleksitet og kostnader, i tillegg til at salgsargumentene er en illusjon. De fleste applikasjoner er tjent med håndtering av regler i kode eller en DSL.",
    "description": "Fordi de fleste applikasjoner har forretningsregler mener enkelte at man trenger en regelmotor. De besnærende argumentene er enkel regelutvikling og -forvaltning utført av forretningssiden og fortløpende endringer helt ut i det kjørende systemet. Når man starter utviklingen oppdager man at regelmotoren medfører høye kostnader innenfor utvikling, integrasjon og utrulling, dårlig støtte for automatisert testing samt spesielle krav til kompetanse og lisensbehov. Illusjonen om at forretningssiden skal skrive og vedlikeholde reglene blir etterhvert smertelig tydelig, og reglene må inngå i test- og utviklingsregimet som all annen applikasjonslogikk. Langt de fleste applikasjoner er tjent med å håndtere reglene i vanlig kode, alternativt med et enkelt DSL.",
    "room": "Lyntale",
    "keyWords": [
      "Architecture and Design",
      "Experience Reports",
      "Tools and Techniques"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Trond Arve Wasskog",
        "biography": "Trond Arve Wasskog er utvikler og CTO i Bekk Consulting. Han har jobbet med Java og Java EE applikasjonsutvikling i mer enn ti år, med fokus på smidig utvikling, kvalitet og vedlikeholdbarhet."
      }
    ],
    "year": 2009
  },
  {
    "title": "Er det ikke bare å legge på 'synchronized' da?",
    "level": "beginner",
    "summary": "Utivkling av parallelle systemer blir stadig viktigere. Hvor mange utviklere behersker egentlig dette? Vi går igjennom noen enkle caser for å belyse problemstillingen.",
    "description": "Høyere ytelse oppnås ikke lenger ved å øke klokkehastigheten, men ved å kaste flere prosessorkjerner på problemet. Allerede i dag er det vanlig med 4 kjerner på skrivebordet, og denne trenden vil bare fortsette fremover. Hvis en ikke makter å utnytte parallelliteten, vil man om ikke lenge utnytte kun få prosent av ytelsen i systemet. For å kunne utnytte systemet fullt ut, må man få et bevisst forhold til parallellitet. Hvor mange utviklere behersker egentlig dette? Vi vil belyse denne problemstillingen gjennom noen enkle caser basert på bruk av tråd-mekanismer som finnes i Java i dag.",
    "room": "Lyntale",
    "keyWords": [
      "Core Java"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Fredrik Vraalsen",
        "biography": "Fredrik Vraalsen is a Java developer/consultant at Know IT Objectnet, doing design and development on a large sales back-end system and client application for NSB. He is also a Scala enthusiast and co-founder of scalaBin as well as member of the JavaZone programme committee for the past two years. Fredrik received an M.Sc. degree from the University of Illinois at Urbana-Champaign in 2001 and has over 10 years of experience as a software developer working with J2EE, Swing client applications and Java/C++ on mobile devices. After graduating he was as a researcher and developer at SINTEF for 5 years with a focus on software development methodology, mobile systems and model-based security analysis."
      },
      {
        "name": "Jon Marius Håkedal",
        "biography": "Jon Marius Håkedal er utdannet Sivilingeniør fra NTNU (2004) og har siden 2005 jobbet som utvilker/konsulent for Know IT Objectnet. Han har vært med på å utvikle både klient- og serverside løsninger, og har erfaring med en bråte forskjellige teknologier. For tiden jobber han med en av norges største selvbetjeningsløsninger for bedriftsmarkedet."
      }
    ],
    "year": 2009
  },
  {
    "title": "Tools and practices for agile architecture documentation",
    "level": "beginner",
    "intendedAudience": "Developers, architects and others interested in agile architecture documentation tools and practices",
    "summary": "In this talk I will show how a mashup of Confluence and the Enterprise Architect UML tool can be used as pragmatic and agile tools for creating good and maintainable architecture documentation.",
    "description": "h1. The problem Creating good architecture documentation is often a problem in many large projects and organizations. Common issues are: * Out of date documentation in various MS Office formats * Architecture documentation is spread around the filesystem and mailsystem making it difficult to find the most current version of the documentation * Cumbersome and costly (enterprise) architecture tools * Using tools that are not well suited for multi-user updates * Developers are unwilling to document * Non-standard modelling conventions * Duplicated and inconsistent information * The list goes on... h1. The solution A pragmatic and agile solution to most of these issues is to create a mashup of the Confluence wiki tool together with a UML tool like Sparx Enterprise Architect. A wiki such as Confluence is very well suited for agile \"grassroots\" knowledge management and documentation. It keeps documentation in a single place, makes it easy for a group of people to work on the documentation together, it has a good search function, and it has proven to be a tool that most developers like to use. A mashup integration of Confluence with the Enterprise Architect UML tool creates a powerful combination of two good tools. UML models are integrated in wiki pages, and the UML models will be updated automatically when the UML model is updated in the UML tool. Other topics covered in the presentation: * using the Java API of Enterprise Architect to publish UML diagrams to Confluence * creating a 4+1 view model of architecture in a wiki * using labels to ** organise the information and create views ** express relationships between various parts of the architecture model * how to version control wiki documentation in Confluence",
    "room": "Lyntale",
    "keyWords": [
      "Agile and Software Engineering",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Per Spilling",
        "biography": "Per Spilling is a developer/architect/process mentor with 21 years experience in working with object technology (C++, Ada, Python, Actor, Concurrent C++, CORBA, Java). He is currently working as a principal consultant at Objectware in Oslo. His main work related interests are lightweight architectures, software craftsmanship, DDD, agile methods and agile development tools. Per has been a member of the JavaZone program committee for the last 5 years."
      }
    ],
    "year": 2009
  },
  {
    "title": "How can I eliminate builds, redeploys and gain 2-8 weeks a year?",
    "level": "intermediate",
    "summary": "This summer, over 1100 developers reported that they waste an average of one month per year waiting for builds and redeploys. In 10 minutes, we'll show you how to get that time back, without the need to re-engineer your applications or change the way your team works.",
    "description": "It's quick, it's easy, it integrates with Maven, Eclipse, IntelliJ IDEA and Netbeans, supports all servlet and EJB containers, Spring framework, Struts, Stripes and Google Web Toolkit, and it pays for itself in two weeks -- meet JavaRebel 2.0.",
    "room": "Lyntale",
    "keyWords": [
      "Agile and Software Engineering",
      "Usability",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Jevgeni Kabanov",
        "biography": "Jevgeni Kabanov is the founder and lead of ZeroTurnaround (www.zeroturnaround.com), a development tools company that focuses on productivity. Before that he worked as the R&D director of Webmedia, Ltd, the largest custom software development company in the Baltics. As part of the effort to reduce development time tunraround he wrote the prototype of the ZeroTurnaround flagship product, JavaRebel, a class reloading JVM plugin. Jevgeni has been speaking at international conferences for several years, including JavaPolis/Devoxx, JavaZone, JAOO and so on. He also has an active research interest, publishing several papers on topics ranging from category theoretical notions to typesafe Java DSLs. Besides the commercial products made for ZeroTurnaround, Jevgeni is a co-founder of two open-source projects -- Aranea and Squill. Aranea (www.araneaframework.org) is a web development and integration platform based on strong object-oriented principles. Squill (squill.dev.java.net) is a typesafe internal DSL for constructing and executing SQL queries. Jevgeni's personal blog can be found at dow.ngra.de."
      }
    ],
    "year": 2009
  },
  {
    "title": "Reflection Madness",
    "level": "advanced",
    "intendedAudience": "Advanced Java programmers who have used a bit of Java reflection before.",
    "summary": "Java reflection has some interesting abilities, not widely known, such as setting of final fields, discovering where in the call chain we are and the ability to make objects without calling a constructor. Based on topics from the Java Specialists Newsletter, it will make your ears ring and head explode.",
    "description": "In this presentation, we will look at some advanced uses of reflection to delegate method calls automatically, to determine where we are being called from and to create new enum values dynamically for unit test purposes, including modifying the switch statements on-the-fly. We will look at how we can use the stack information to determine the class type in a static context. We will demonstrate how Externalizable allows the private state of an object to be read and then modified. Lastly we will demonstrate how we can construct new objects without calling any of the available constructors. This talk will be aimed at the advanced Java specialist who does not shy away from reflection code. Topics from the Java Specialists Newsletter and related research.",
    "keyWords": [
      "Core Java",
      "Architecture and Design"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Heinz Kabutz",
        "biography": "Dr Heinz Kabutz is best known for his creation of The Java Specialists' Newsletter, read in 120 countries by 50000 Java experts. In his newsletter, he examines advanced aspects of Java that have helped Java developers around the world to produce better code. As someone remarked on the Sun website: \"Heinz Kabutz is a hero in the Java Developer Community. His newsletters have saved companies millions by helping burgeoning and experienced programmers deliver high quality products.\" In order to fund the newsletter, Heinz writes Java code on contract and runs seminars. His latest creation, the Java Specialist Master Course, examines ten areas of advanced Java. It is one of the only courses specifically aimed at the seasoned Java professional. Heinz was invited to speak at several Sun Tech Days events: Johannesburg 2006, Athens 2007, London 2007 and Frankfurt 2007. He is a regular speaker at Java User Groups such as JavaPolis, JavaZone, JFall and JHUG. In addition, he has spoken several times at the Server Side conferences in USA and Europe. Heinz was interviewed on the Sun Website (http://java.sun.com/developer/technicalArticles/Interviews/community/kabutz_qa.html)"
      }
    ],
    "year": 2009
  },
  {
    "title": "Breaking Barriers with HTML5 WebSockets: How to enable a stateful Web",
    "level": "intermediate",
    "intendedAudience": "This session will go beyond Ajax with a dive into Java, so experience using Ajax and Java is a bonus. Knowledge about HTTP, and or other protocols are a plus but not required. The session targets anyone interested in simplifying IT architectures and are looking for away to do more with HTML 5.",
    "summary": "By large the majority of us have been creating applications for the Web since the early 90's and we have \"just\" accepted the stateless nature of the Web and the fact that HTTP is limiting us to a request repsonse communication profile. With new emerging standards such as W3C's HTML 5 WebSockets we can change all of this!",
    "description": "By large the majority of us have been creating applications for the Web since the early 90's and we have \"just\" accepted the stateless nature of the Web and the fact that HTTP is limiting us to a request repsonse communication profile. Sixteen years later we have an opportunity to let Web communication take a gigantic step forward - if we let it - and forever change the way in which we build applications for the Web. Web applications have traditionally been seen as second tier citizens in our network infrastructure, not capable of fully participate in the backend message infrastructure due to its stateless architecture. One innovation - W3C's HTML 5 WebSockets - in particular will enable full-duplex communication, and finally bring an end to the tired request response paradigm traditionally associated with the Web, and allow browsers to become first class citizens in our network. With this new emerging standard and the potential it brings, it is now possible to simplify complex architectures and build statefull asynchronous systems and communicate with native protocols directly from the browser to any backend service. In this session, the speakers will offer their vision of the future of the Web, Web technologies, address the importance of browser support of the W3C WebSocket and Server-Sent Events standards, and offer insight into the key role developers' play in W3C standards proliferation and the impact they might have on the end users. During the session real-life demos and examples of the use of WebSockets and other communication standards such as Server-Sent Events and Cross-document messaging will be shown. The techniques and technologies covered in this session will include, but are not limited to, JavaScript, Flash, Silverlight, and communication protocols such as AMQP, XMPP, and Stomp.",
    "keyWords": [
      "Web as a Platform",
      "Enterprise Architecture and Integration",
      "Frontend Technologies"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jonas Jacobi",
        "biography": "As co-founder and Chief Executive Officer of Kaazing Corporation, Jonas Jacobi sets the company's business strategy and oversees all aspects of Kaazing's operations and mission to become the world-wide leader in real-time software. A native of Sweden, he has worked in the software industry for more than sixteen years. Before starting Kaazing, Jonas worked as VP of Product Management responsible for the product management and marketing strategy for Brane Corporation, a startup company in Silicon Valley. Prior to his appointment as vice president for Brane, he worked 8 years for Oracle as a Java EE and open source evangelist, and product manager responsible for the product management of JavaServer Faces and Oracle ADF Faces (now Apache Trinidad) in the Oracle JDeveloper team. Jonas is a frequent speaker at international conferences and has written numerous articles for leading IT magazines such as Java Developer's Journal, JavaPro, AjaxWorld, and Oracle Magazine. Jonas is co-author of the book, Pro JSF and Ajax: Building Rich Internet Components (Apress)."
      },
      {
        "name": "John Fallows",
        "biography": "John Fallows is a pioneer in the field of rich and highly interactive user interfaces and co-founder and CTO of Kaazing Corporation. He recently worked as Architect at Brane Corporation, a startup company based in Redwood City, California. Originally from Norther Ireland, John graduated from Cambridge University in the United Kingdom and has worked in the software industry for more than ten years. Prior to joining Brane, John was a Consulting Member of Technical Staff for Server Technologies at Oracle Corporation. During his last 5 years at Oracle, John focused on designing, developing, and evolving Oracle ADF Faces to fully integrate Ajax technologies. John is an active participant in the standards bodies working on defining the WebSockets standards. He is also a popular speaker at international conferences and has written numerous articles for leading IT magazines such as Java Developer's Journal, AjaxWorld Magazine, and JavaMagazine (DE). John is co-author of the recently published book Pro JSF and Ajax: Building Rich Internet Components, (Apress)."
      }
    ],
    "year": 2009
  },
  {
    "title": "HTTP caching on clients made easy",
    "level": "intermediate",
    "intendedAudience": "Developers that has written a client using Commons HttpClient, or a similar library.",
    "summary": "The session will compare a number of Http clients and see how HTTPCache4j supersedes them all.",
    "description": "Have you ever tried to write a HTTP or RESTful client using the libraries out there? Using java.net.URLConnection or Commons HttpClient? How do you cache your results? Do you use a proxy? Is server side caching enough? NO! Enter HTTPCache4j. You may use the library as a standard HTTP client, using just the resolver modules. Or you may use it as a full blown HTTP cache on the client. Your choice.",
    "room": "Lyntale",
    "keyWords": [
      "Java Frameworks",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Erlend Hamnaberg",
        "biography": "System developer at Escenic AS. He is the lead developer and architect behind the open source HTTP-cache client library HTTPCache4j."
      }
    ],
    "year": 2009
  },
  {
    "title": "State, Your'e Doing It Wrong:  Exploring Alternative Concurrency Paradigms on the JVM",
    "level": "beginner",
    "intendedAudience": "Developers interesting in writing simpler and more correct concurrent code to utilize multiprocessor architectures.",
    "summary": "An overview of alternative concurrency paradigms for the JVM (Actors, STM and Dataflow).",
    "description": "Writing concurrent programs in Java is hard and writing correct concurrent programs is even harder. What should be noted is that the main problem is not concurrency itself but the use of mutable shared state. Reasoning about concurrent updates to, and guarding of, mutable shared state is extremely difficult. It imposes problems like dealing with race conditions, deadlocks, live locks, thread starvation etc. It might come as a surprise to some people but there are alternatives to the so-called 'Shared-State Concurrency' (that has been adopted by C, C++, Java and become the default industry standard way of dealing with concurrency problems). In this talk we will discuss the importance of immutability and explore alternative paradigms such as Dataflow Concurrency, Message-Passing Concurrency and Software Transactional Memory (STM). We will have a pragmatic discussion on the drawbacks and benefits with each paradigm and through hands-on examples show you how each one, in its own way, can raise the abstraction level and give you a model that is much easier to reason about and use. We will show you how, by choosing the right abstractions and technologies, you can make hard concurrency problems close to trivial. All discussions are driven by examples using state-of-the-art implementations available for the JVM.",
    "keyWords": [
      "Alternative Languages",
      "Architecture and Design",
      "Core Java"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jonas Bonér",
        "biography": "Jonas Bonér is a programmer, mentor, speaker and author who spends most of his time consulting as well as lecturing and speaking at developer conferences world-wide. He has worked at Terracotta, the JRockit JVM at BEA and is an active contributor to the Open Source community; most notably created the AspectWerkz (AOP) framework, committer to the Terracotta JVM clustering technology and been part of the Eclipse AspectJ team. Read more on his blog: http://jonasboner.com"
      }
    ],
    "year": 2009
  },
  {
    "title": "Anemic domain models: diagnosis, causes, effects and possible treatments",
    "level": "intermediate",
    "intendedAudience": "Developers, architects",
    "summary": "Although object-orientation has been the mainstream programming language paradigm a long time, and domain driven design has been one of the hot topics in application development for some time, many real world projects end up with an anemic domain model. This manifests a problem because we are unable to leverage language features to achieve an easily maintainable application.",
    "description": "Object-orientation has been the mainstream programming language paradigm for the last 20 years. One of the central techniques in object-oriented programming is encapsulation using objects that both contain data and behavior. Nevertheless, in real applications we tend to end up with anemic domain models as opposed to \"proper\" domain models, where we have objects that only have data and no behavior, or vice versa. In many cases this results in a procedural style of programming, rather than an object-oriented style, not leveraging the language's features. Encapsulation suffers, possibly resulting in tight coupling in the application. In this talk I will try to give some reason why this happens, which problems this causes, and possible ways to avoid it.",
    "room": "Lyntale",
    "keyWords": [
      "Architecture and Design",
      "Domain-driven design"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Vidar Kongsli",
        "biography": "Vidar Kongsli works as a developer and architect at Bekk Consulting AS. He has a long experience developing enterprise solutions based on Microsoft .NET, Java, and Lotus Domino. Additionally, he is currently focusing on agile development, (automated) testing, and quality assurance."
      }
    ],
    "year": 2009
  },
  {
    "title": "SOA i praksis - det virker!",
    "level": "intermediate",
    "intendedAudience": "Virksomhetsarkitekter, tekniske arkitekter og utviklere som ønsker å vite hvordan det er mulig å bruke tjenesteorientert arkitektur i stor skala og hvordan man kan høste faktiske gevinster ved å benytte SOA.",
    "summary": "I mange år har SOA vært ”det neste store” og mange har prøvd å innføre dette i små og store prosjekter. Foredraget omhandler erfaringene fra innføringen av SOA i et av Norges mest komplekse IT-prosjekter og forsøker å gi svar på hvordan SOA virker i stor skala og om det faktisk gir de gevinster man ønsket.",
    "description": "I mange år har SOA vært ”det neste store” og mange har prøvd å innføre dette i små og store prosjekter. Mange har feilet og dermed har begrepet SOA mistet mye av sin glans. Foredraget omhandler erfaringene fra et prosjekt som innførte SOA i en av Norges mest komplekse IT-prosjekter og som har oppnådd gode resultater. I prosjektet har man fått etablert en SOA plattform som eksponerer tjenester fra mange forskjellige baksystemer og lagd automatiserte prosesser som benytter disse tjenestene. Å benytte gjenbrukbare tjenester fra forskjellige systemer direkte i en fleksibel forretningsprosess har vært selve drømmen som SOA skal innfri. Gevinsten skal være mulighet for raskere endringer og billigere forvaltning. Foredraget prøver å svare på om SOA kan innfri dette og hvor svakhetene og styrkene i en tjenesteorientert arkitektur ligger.",
    "keyWords": [
      "Experience Reports",
      "Enterprise Architecture and Integration"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Holger Zobel",
        "biography": "Holger har vært konsulent i Accenture i 10 år og har lang erfaring som teknisk arkitekt på utviklingsprosjekter basert på Java. Han er nordisk leder for Accentures ”Execution Architecture” faggruppe som fokuserer på kjøretidsarkitektur for skreddersømsapplikasjoner. Han er nå sjefsarkitekt på et av Norges største IT-prosjekter hvor han har vært med å etablere en ny SOA-arkitektur og implementere en forretningskritisk applikasjon på denne arkitekturen."
      }
    ],
    "year": 2009
  },
  {
    "title": "The New Face of JRuby",
    "level": "intermediate",
    "intendedAudience": "Pragmatic Java architects and developers interested in alternative languages and polygot programming environments.",
    "summary": "You've probably heard of JRuby. You may even have tried it. But a lot has changed in the past year, and JRuby is better than ever before!",
    "description": "This talk will demonstrate how JRuby has truly become a first-class JVM language. JRuby can integrate with all those pesky Java libraries that needed Java classes. JRuby's performance is substantially better than it was a year ago. JRuby has started to utilize the new invokedynamic bytecode for fast dynamic calls. JRuby supports libraries like Hibernate, JAX-RS, and JUnit4. JRuby can stand shoulder-to-shoulder with any language on the JVM and integrate just as well. At the same time, JRuby brings innovative Ruby libraries to the JVM like Rake, RSpec and Cucumber. Come hear the latest news about JRuby, from Java integration to performance to Ruby and Rails updates. We'll demonstrate several key Java libraries working with plain old Ruby code. And we'll show you why JRuby should be your dynamic language of choice for building applications on the JVM.",
    "keyWords": [
      "Alternative Languages",
      "Core Java",
      "Tools and Techniques",
      "Innovative use of IT",
      "Java Frameworks"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Nick Sieger",
        "biography": "Nick Sieger is an engineer at Engine Yard, working on JRuby and leading the effort to make the Java Virtual Machine a robust yet easy-to-use deployment platform for Rails and Ruby web applications. He created and co-maintains the JDBC adapter for ActiveRecord that JRuby on Rails uses for database connectivity, as well as the Warbler tool and JRuby-Rack library for dealing with Java application server deployment. He maintains a blog on Ruby and JRuby-related topics at http://blog.nicksieger.com/."
      }
    ],
    "year": 2009
  },
  {
    "title": "Software Transactional Memory (STM) i Java",
    "level": "intermediate",
    "intendedAudience": "Alle som begynner å bli lei av RDBMS-orienterte applikasjoner...",
    "summary": "Software Transactional Memory (STM) i Java the language",
    "description": "Nå som gratis vertikal skalering er ute av bildet og antallet kjerner øker, er samtidighetsproblematikk stadig mer aktuelt. Java støtter kun pessimistisk låsing, som mange mener ikke skalerer - verken kjøremessig eller kodevedlikeholdsmessig. Software Transactional Memory (STM) handler om optimistisk låsing som vi kjenner fra RDBMSene våre. Forskjellen er at STM håndteres internt i JVMen, uten å basere seg på en RDBMS.",
    "room": "Lyntale",
    "keyWords": [
      "Architecture and Design",
      "Java Frameworks",
      "Tools and Techniques",
      "Core Java"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Eirik Torske",
        "biography": "Eirik Torske er utvikler hos BBS og har over 10 år i Java-land."
      }
    ],
    "year": 2009
  },
  {
    "title": "Green Code",
    "level": "beginner",
    "intendedAudience": "Everybody are welcome to this talk! After attending the talk, attendants should be inspired to look for new solutions that are both economical and eco-friendly.",
    "summary": "Get some fresh and inspirational ideas on how you can be an eco-friendly developer by writing better code.",
    "description": "Green computing is always about energy efficient servers, hardware without hazardous materials and other things that appeal to hardware buffs. Cloud computing is fun, but what else can us programmers do to help the environment? In this talk, Anders shows us how to be eco-friendly through writing better code and smarter business logic.",
    "room": "Lyntale",
    "keyWords": [
      "Green IT",
      "Innovative use of IT"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Anders Norås",
        "biography": "Anders is a seasoned software developer and speaker. EJBs drove him to Microsoft .NET back in 2002. He made a name for himself in the .NET community using his Java-experiences to get a head start. Today he is a polyglot combining the best of all worlds to build better software. He has given talks on many conferences and user group meetings and is known for talks with few slides and lots of code. Anders lives in Norway where he works as the Chief Technology Evangelist for Objectware."
      }
    ],
    "year": 2009
  },
  {
    "title": "Hvordan lykkes med webtesting?",
    "level": "beginner",
    "intendedAudience": "Utviklere, testere og andre som enten driver med webtesting eller har tenkt til å begynne med det.",
    "summary": "Hva må man tenke på før man begynner med webtesting, og hvordan unngår man en skjør test-suite som er vanskelig å vedlikeholde?",
    "description": "Webtesting er en testmetode hvor man tester applikasjonen gjennom brukergrensesnittet. Ved å gjøre dette simulerer testene faktisk bruk av systemet. Webtesting kan virke som en åpenlys og enkel strategi for å teste webapplikasjoner, men som mange har erfart er det ikke så enkelt. Å starte med webtesting uten en gjennomtenkt strategi fører i de fleste tilfeller til en test-suite som er skjør, treg og vanskelig å vedlikeholde. Slike test-suiter mister ofte verdien fordi de ignoreres av prosjektdeltagerene. Basert på erfaring med webtesting på flere prosjekter vil jeg gi tips og råd for hvordan man kan oppnå en webtest-suite som gir verdi for prosjektet og dets deltagere over tid.",
    "keyWords": [
      "Experience Reports",
      "Frontend Technologies",
      "Tools and Techniques"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Vegard Hartmann",
        "biography": "Vegard Hartmann er fagleder for Kvalitet og testing i Bekk Consulting. Han har siden 2005 jobbet både med nyutvikling og forvaltning av en rekke applikasjoner."
      }
    ],
    "year": 2009
  },
  {
    "title": "Objects of Value",
    "level": "intermediate",
    "intendedAudience": "Those interested in the DDD track.",
    "summary": "Value objects are as overlooked as they are valuable. They express fine-grained, informational concepts in the problem domain and are associated with a number of practices in the technical domain. This session looks at a number of concepts and patterns, focusing primarily on Java but also mentioning value implementations in other languages.",
    "description": "Objects do not live in a free society: they exist for a purpose; they are not created with equal rights; they should not aspire to equality. What this means in practice is that objects live in a class-ridden society where each class serves a different role in the program as a whole. One category of object in need of attention and liberation is for representing domain values. Values are fine-grained and informational. They are inherent in the problem domain, but are often flattened into little more than plain integers and strings in the implementation, weakening the correspondence of the code to the situation it addresses. When it comes to identifying and implementing the Value Object pattern, there is a great deal more to be taken into consideration than can reasonably fitted into a single pattern. This talk looks at the practices and concepts that surround values both in Java and in other languages.",
    "keyWords": [
      "Domain-driven design",
      "Architecture and Design",
      "Agile and Software Engineering"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Kevlin Henney",
        "biography": "Kevlin Henney is an independent consultant based in the UK. He specialises in programming languages, OO design, patterns, development process and software architecture, helping teams adopt techniques and improve their software development through training, mentoring and reviewing. He is and has been a columnist for various magazines and web sites, including the Reg Developer channel of The Register, SearchSoftwareQuality.com and Better Software. He is also coauthor of two volumes in the Pattern-Oriented Software Architecture series, A Pattern Language for Distributed Computing and On Patterns and Pattern Languages."
      }
    ],
    "year": 2009
  },
  {
    "title": "Title: JSR-330 as implemented by Google Guice",
    "level": "intermediate",
    "intendedAudience": "Software architects, developers",
    "summary": "JSR-330+Guice leverages recently added language features to enable the best of both words: abstraction without the boilerplate!",
    "description": "Before Guice, the Java programming language subjected developers to a false dichotomy: 1. Use \"new\" to write concise but tightly coupled code. If you need more abstraction later, you'll have to update all of the N callers. or 2. Write a factory, so you can easily change the implementation later. You might end up doing unnecessary work, not to mention make your code harder to read. Guice leverages recently added language features to enable the best of both words: abstraction without the boilerplate! JSR-330's @Inject is the new new. Start off with coupled and straightforward code, and if you need more flexibility down the road, you can change your code in one place without having to update N callers. This speakers will compare factories and service locators with dependency injection, with and without Guice. Then he'll show you how to use Guice to make your code more modular, readable, and testable than ever before. All you need is a working knowledge of the language.",
    "keyWords": [
      "Java Frameworks",
      "Core Java",
      "Architecture and Design"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Bob (crazy bob) Lee",
        "biography": "Bob Lee created the Jolt-award-winning Google Guice framework and now leads JSR-330 (Dependency Injection for Java). He represents Google on the JCP Executive Committee. Bob is also involved with JSR-166 (java.util.concurrent), Project Coin (small language changes), and JSR-294 (Java Modules)."
      }
    ],
    "year": 2009
  },
  {
    "title": "JSON Flickr Integration - Live Coding Session",
    "level": "intermediate",
    "intendedAudience": "Mostly technical people, with the focus on or interest in client side technology",
    "summary": "JSON (JavaScript Object Notation) is the friendliest format for cross server sharing of data. This live coding session starts with an empty HTML page, and ends up with a searchable flickr integration using JSON. Time permitting, we will mash it up with Twitter.",
    "description": "XML used to be the format of choice for transferring data or content from one system to another. JSON has more or less replaced XML for this task. Among the reasons is the low amount of overhead surrounding the actual data. Another thing is JSONs readiness when it enters your program: It is a programatic object, immediately after transfer, ready to reveal its data. This session will demonstrate how little code is actually necessary to do \"near\" real life integration between two sites using JavaScript and JSON. It could be done as a 10 minute lightning talk with focus on the client side technologies only. As a 60 minute talk the intro could be longer, and more examples and integrations with other sites like twitter could be shown. Also server side handling of JSON could be demonstrated.",
    "room": "Lyntale",
    "keyWords": [
      "Web as a Platform"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Andreas Øverland",
        "biography": "Andreas Øverland is a Manager at BEKK Consulting. He has been working with Java and web development for 13-14 years. Now he has the position of web developer, focusing on client side technologies and user interaction in complex web applications. Pushing pixels, programming some java, ajaxing up and down, JSONing around, making nice colors in CSS and some good old HTML-coding using web standards for good accessibility, make up the most of his working days."
      }
    ],
    "year": 2009
  },
  {
    "title": "Dynamic Languages: the next big thing for the JVM or an evolutionary dead end?",
    "level": "beginner",
    "intendedAudience": "In this session, which is aimed at Java developers and architects, you will learn • What it means for a language to be dynamic • Which Groovy features we liked the most • The frustrating side of Groovy development • How Groovy compares to Scala, which is a modern statically typed language that provides many of benefits of Groovy",
    "summary": "Learn about the pros and cons of Groovy and while an statically typed yet expressive language such as Scala is an interesting alternative.",
    "description": "There is a good reason why dynamic languages such as Groovy and Ruby are getting a lot of attention. They are powerful, expressive languages that enable developers to easily write concise programs. However, not all of their benefits derive from being dynamic. Many important benefits are simply due to modern language design such as the support for closures. Moreover, dynamic languages have some inherent drawbacks. The extremely limited compile-time checking requires developers to write significantly more tests and severely limits how much help an IDE can provide to a developer.",
    "keyWords": [
      "Alternative Languages",
      "Core Java",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Chris Richardson",
        "biography": "Chris Richardson is a developer, architect and mentor with over 20 years of experience and is the author of the book \"POJOs in Action.\" He runs a consulting and training company that helps customers reduce the cost of development and increase the effectiveness of their development teams. His technical interests include domain-driven design, cloud computing and developer testing. Chris has been a technical leader at a variety of companies including Insignia Solutions and BEA Systems and recently became a Java Champion. Chris is the founder of Cloud Tools, which is an open-source project for quickly and easily deploying Java applications on Amazon EC2, and of Cloud Foundry, which provides outsourced, automated data center management. He has spoken at various conferences including JavaOne 2006/2007/2008, No Fluff Just Stuff Java Symposiums, Colorado Software Summit, SD West, The Spring Experience, SpringOne, and Javapolis as well as Java user groups. Chris holds a computer science degree from the Cambridge University in England and lives in Oakland, CA where he runs the local Java User Group. Website and blog: http://chrisrichardson.net/"
      }
    ],
    "year": 2009
  },
  {
    "title": "Sant og usant - Integrasjonserfaringer",
    "level": "intermediate",
    "intendedAudience": "Integrasjonsfolk",
    "summary": "Har du laget mange web services de siste 5 årene? Hvor mange av dem er blitt gjenbrukt? Har de vært lette å endre? Vi ser på hva vi har erfart, sant og usant i oppfattninger om integrasjon.",
    "description": "Integrasjon mellom systemer blir en stadig større del av budsjettene til IT-prosjekter. Over tid har en virksomhet gjerne mange systemer bygget på ulike teknologier. Derfor er det ofte kvaliteten på integrasjonen som avgjør om migrasjon til et nytt system lønner seg på sikt. Denne presentasjonen peker på noen vanlige fallgruver innen integrasjon, og dekker hva vi har hatt gode erfaringer med av retningslinjer når integrasjoner skal designes og bygges.",
    "keyWords": [
      "Enterprise Architecture and Integration",
      "Tools and Techniques"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Tor Magne Lindeberg",
        "biography": "Tor Magne Lindeberg and Irene Blesvik both work as integration architects at ErgoGroup AS, one of the largest Norwegian software companies offering operations, solutions and consultancy services. They are part of the company's Java technology group. They studied together at NTNU and have 5 years experience in the software industry. They have been working with various technologies and environments, including J2EE/JEE, but primarily focused on integration."
      },
      {
        "name": "Irene Blesvik",
        "biography": "Tor Magne Lindeberg and Irene Blesvik both work as integration architects at ErgoGroup AS, one of the largest Norwegian software companies offering operations, solutions and consultancy services. They are part of the company's Java technology group. They studied together at NTNU and have 5 years experience in the software industry. They have been working with various technologies and environments, including J2EE/JEE, but primarily focused on integration."
      }
    ],
    "year": 2009
  },
  {
    "title": "Right on Schedule",
    "level": "beginner",
    "intendedAudience": "Enterprise application architects and developers who need to run a task sometime in the future.",
    "summary": "There are many ways to schedule a job to run at a later time in an enterprise Java application. Learn about some of them, and why it's trickier than it sounds.",
    "description": "Enterprise applications often need to schedule tasks to run at a later time, either once or periodically. There's several ways to go about this: EJB 2.1 introduced a timer service (which will get some sorely needed extensions in JEE 6), there's the popular Quartz system from OpenSymphony, and Oracle and IBM promote the Timer and Work Manager API (CommonJ, JSR-236), to mention a few. And then there's always cron. This lightning talk explains why you might need a job scheduler, compares common solutions and frameworks, and describes some gotchas you should avoid.",
    "room": "Lyntale",
    "keyWords": [
      "Enterprise Architecture and Integration"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Markus Bjartveit Krüger",
        "biography": "Markus Krüger is a Sun Certified Enterprise Architect developing enterprise systems at ErgoGroup AS, one of the largest Norwegian software companies offering operations, solutions, and consultancy services. He is part of the company's Java technology group. Markus has 10 years experience in the software industry, working with various technologies and environments, including J2EE/JEE the last 7 years. Other experiences includes work on search engine technology at FAST, browser video plugins at GridMedia, and e-mail security and notary services at eNotarius. He has previously held talks, both internally and to open audiences, on various subjects such as CVS, Hibernate, and performance testing."
      }
    ],
    "year": 2009
  },
  {
    "title": "Speeding up the development cycle: Stash your files on a Solid State Drive",
    "level": "intermediate",
    "intendedAudience": "Developers on any kinds of project that are looking to reduce delay in their build cycle. The talk presents results produced with Maven, but the general idea should apply to any build system that compiles code.",
    "summary": "Put your build system on a solid state drive, and reduce the development round trip with 50%.",
    "description": "Solid state drives have recently become easily available. Their performence may provide a way of reducing the time spent on on the development cycle: compiling, packeting and deploying applications. This paper shows promising results by locating the code base and local maven repository on a solid state drive. Initial experiments shows that time spent on waiting for your code to compile may be reduced by 50%.",
    "room": "Lyntale",
    "keyWords": [
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Harald Søvik",
        "biography": "Harald is working as technical architect with Computas AS, on a 5-year-long java-project with 25 developers. He's responsible for the build system, infrastructure for development and testing, and adapting new designs into the existing architecture. He's quite ambivalent to the idea of Maven, but tries to praise the possibilities istead of weep over the weaknesses, and finally shorten the turnaround, to achive a truly agile development situation."
      }
    ],
    "year": 2009
  },
  {
    "title": "Utilizing Scripting in Real-World Applications",
    "level": "intermediate",
    "intendedAudience": "Those who are new to scripting in general or embedding scripting capabilities in their own applications in particular, those who want an introduction to the Java scripting engine (JSR 223), those who want to learn new ways of using scripting in their applications. Programming experience is recommended.",
    "summary": "By combining the power of compiled and interpreted languages in the same application, can we get the best of both worlds? This presentation gives an introduction to the Java scripting engine API (JSR 223) and how it can be used in combination with various scripting langauges in real-world applications.",
    "description": "By combining the power of compiled and interpreted languages in the same application, can we get the best of both worlds? Can embedding scripting capabilities in our applications help us develop software that is more flexible and more usable? Can we reduce development time by making volatile and highly fluctuating application logic customizable, dynamic and scriptable? Can we make life easier for ourselves as developers by choosing the right language for the right task at any given time? This presentation gives an introduction to the concept of scripting engines and how they can be used to add scripting capabilities to real-world applications. We take a closer look at the Java scripting engine API (JSR 223) and popular implementations of the standard. The session includes practical examples and actual code.",
    "keyWords": [
      "Alternative Languages",
      "Tools and Techniques",
      "Core Java"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Anders Sandvig",
        "biography": "Anders Sandvig is a self-taught hacker and pragmatic programmer with experience from many areas, including computer games, real-time graphics, interactive television, telecommunications, enterprise systems, desktop applications and web development. During the past two decades he has used a wide variety of programming languages, ranging from low-level assembly to high-level scripting. Anders has been a professional programmer for over ten years, is certified ScrumMaster and practitioner of agile development principles. He now works as a senior consultant for Webstep."
      }
    ],
    "year": 2009
  },
  {
    "title": "No pain, no gain",
    "level": "beginner",
    "intendedAudience": "Developers",
    "summary": "\"Brent barn skyr ilden\" sies det. Skyr du kodebasen din?",
    "description": "Hvordan kan man snu uleselig kode, lite tester og frustrasjon til noe positivt? Lær av det og aldri gjør det igjen!",
    "room": "Lyntale",
    "keyWords": [
      "Agile and Software Engineering"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Janniche Haugen",
        "biography": "Janniche har 5 års erfaring med utvikling av mer eller mindre domenedrevne Java applikasjoner. Hun er for tiden fagleder for Java i Bekk og har høy fokus på utvikling av god Java kode. Favoritt sitat: \"Expert programmers are those who write code even idiot programmers can understand. Idiot programmers are those who write code not even expert programmers can understand.\""
      }
    ],
    "year": 2009
  },
  {
    "title": "Jeg ser det når jeg tror det! Moter, retorikk og systemutviklingsmetoder (inkludert norgesmesterskap i estimering)",
    "level": "beginner",
    "intendedAudience": "Everybody with interest in software development methods.",
    "summary": "Endring i bruk av systemutviklingsmetoder har mange likhetspunkter med endring av klesmoter. I denne presentasjonen viser jeg hvordan motesyklusene for systemutviklingsmetoder blir stadig kortere og hvilke mekanismer (retorikk) som fører til dette. Prinsippene for å lykkes med en ny utviklingsmetode anvendes på min egen, revolusjonerende metode ELASTIC.",
    "description": "De fleste utviklere vil i dag være \"smidige\" (agile), mens de tidligere kanskje ville være ”unified” (RUP) eller ”rapid” (RAD). For lenge siden var det til og med noen som ønsket å være strukturerte eller fossefalls. Er man ikke med på det siste sies det at man følger ”tradisjonelle” utviklingsmetoder, noe som neppe er positivt ment. I denne presentasjonen ser jeg på hva det er som styrer utviklingen av systemutviklingsmetoder. Særlig interessant er det å se på hvilken retorikk som brukes når nye utviklingsmetoder lykkes med å få store deler av systemutviklingsverden til å se lyset og mene at tidligere (tradisjonelle) utviklere og prosjektledere har vært mer eller mindre uopplyste og ineffektive. Jeg vil også presentere resultater fra en empirisk studie om utviklingsmetoder som demonstrere riktigheten av utsagnet ”jeg ser det, når jeg tror det”. Med andre ord at vi tolker observasjoner som mye mer positive dersom vi allerede tror på en positiv sammenheng. Erfaringer med smidige metoder blir altså mer positive fordi vi tror det er positive sammenhenger. Gjennomgangen av retorikken brukt i innføring og markedsføring av nye utviklingsmetoder oppsummeres i ti prinsipper for å lykkes med å lage en bestselger av en utviklingsmetode. Disse prinsippene demonstreres ved å beskrive hvordan jeg ville ha innført min egen, revolusjonerende (fiktive) systemutviklingsmetode ELASTIC (”Elastic development”). Denne metoden baseres på at dagens utviklingsmetoder tar alt for lite hensyn til variasjonene (elastisiteten) i kundens modenhet og usikkerheten i utviklingsarbeidet. Vi at denne elastisiteten gjør ELASTIC mye mer effektiv enn tradisjonelle utviklingsmetoder (agile, lean, RUP, RAD og fossefalls).",
    "keyWords": [
      "Agile and Software Engineering",
      "Tools and Techniques"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Magne Jørgensen",
        "biography": "Tidligere jobbet som systemutvikler, prosjektleder og prosessforbedringsleder i Telenor og Storebrand. Professor ved Simula Research Laboratory og Universitetet i Oslo."
      }
    ],
    "year": 2009
  },
  {
    "title": "Tre ting du ikke visste at du kunne gjøre med Spring",
    "level": "intermediate",
    "intendedAudience": "Publikum forventes å ha en grunnleggende kjennskap til Spring Framework.",
    "summary": "Spring Framework er et svært viktig verktøy for mange av oss, og de fleste har en grunnleggende kjennskap til rammeverket. Imidlertid er Spring et omfattende rammeverk, og det kan være en utfordring å holde oversikt over alt det kan gjøre. I denne lyntalen vil jeg presentere tre ting jeg mener det kan være fordelaktig å gjøre med Spring, men som mange kanskje ikke kjenner til.",
    "description": "Spring Framework er et svært viktig verktøy for mange av oss, og de fleste har en grunnleggende kjennskap til rammeverket. Imidlertid er Spring et omfattende rammeverk, og det kan være en utfordring å holde oversikt over alt det kan gjøre. I denne lyntalen vil jeg presentere tre ting jeg mener det kan være fordelaktig å gjøre med Spring, men som mange kanskje ikke kjenner til.",
    "room": "Lyntale",
    "keyWords": [
      "Java Frameworks",
      "Core Java"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Karianne Berg",
        "biography": "Karianne har en mastergrad i IKT fra Universitetet i Bergen, og er ansatt som konsulent i Javaavdelingen i Objectware. Hennes hovedinteresser er patterns, smidig utvikling og Spring Framework, som hun har jobbet med siden 2005. Karianne er svært aktiv i fagmiljøet, og er medarrangør av konferansene ROOTS og Smidig, samt Oslo XP Meetup."
      }
    ],
    "year": 2009
  },
  {
    "title": "Test Driven Development in JavaScript",
    "level": "intermediate",
    "intendedAudience": "Developers interested in TDD best practices and how to do test driven JavaScript development. Some experience with TDD or JavaScript will help you get more from the session.",
    "summary": "We know how to create maintainable, flexible and solid Java code using Test Driven Development. With growing client side complexity, we need to write JavaScript in the same professional way. This hands-on demonstration will provide you with all the necessary pieces to do true Test Driven Development in JavaScript.",
    "description": "We create maintainable, flexible and solid Java code with the use of techniques such as Test Driven Development and Continuous Integration. When it comes to client side Web development with JavaScript, the story is quite different. JavaScript has for a long time been perceived as a toy programming language for making flashy buttons and simple form validation. But now as the client side grows larger and more complex, we should take the lessons learned from TDD in Java and apply them to our JavaScript development. There are many myths surrounding TDD and JavaScript, and we will in this session bust some of these: * There are no proper frameworks for test driven JavaScript development. * There is no IDE support. * It isn't possible to integrate it with my build or CI system. Our hands-on demonstration will show you a JavaScript application capable of controlling TANDBERG video systems and provide you with all the necessary pieces to do true Test Driven Development in JavaScript yourself. This includes: * Our minimal test framework for JavaScript testing * Running tests from Eclipse with the push of a button * Using mocks and stubs to test code in isolation * Testing of JavaScript integrated with your build and continuous integration systems",
    "room": "Lyntale",
    "keyWords": [
      "Alternative Languages",
      "Tools and Techniques"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Stig Murberg",
        "biography": "Stig Murberg has been working at TANDBERG for the last 4 years. He works as a team lead and software developer, and his main focus and interests are in the area of Web development."
      },
      {
        "name": "Ragnvald Barth",
        "biography": "Ragnvald Barth is a highly experienced Java and .Net developer. He has been working for TANDBERG the past 3 years on a wide array of projects."
      }
    ],
    "year": 2009
  },
  {
    "title": "Phidgets - kule dingser for trauste Java",
    "level": "beginner",
    "summary": "Phidgets tilbyr en rekke sensorer og kontrollere som du kan styre fra PC-en din gjennom enkle API-er. Hardwaren er rimelig og API-ene er gode. Phidgets er perfekte for små hobbyprosjekter der du har lyst til å gjøre noe litt utover det vanlige.",
    "description": "Phidgets tilbyr en rekke sensorer og kontrollere som du kan styre fra PC-en din gjennom enkle API-er. Hardwaren er rimelig og API-ene er gode. Phidgets er perfekte for små hobbyprosjekter der du har lyst til å gjøre noe litt utover det vanlige. I dette foredraget presenterer vi hvilke sensorer og kontrollere som er tilgjengelig og dykker ned i kode for å se hvor enkelt det er å programmere mot phidgets API-ene. Vi gir en kort demonstrasjon av en applikasjon som benytter en RFID-leser til å løse utfordringer rundt tidtagning for mosjonsløp. Etter foredraget vil du ha fått ny inspirasjon og er klar for å ta fatt på nye spennende hobbyprosjekter.",
    "room": "Lyntale",
    "keyWords": [
      "Innovative use of IT"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Hågen Hasle",
        "biography": "Hågen jobber som konsulent hos Know IT Objectnet og har kompetanse på en rekke av dagens mest moderne buzzwords. Som ung var han en ivrig deltager i nulløp i det lokale idrettslaget, og han vil gjerne bringe det gode budskap om nulløpets fortreffelighet til de store masser."
      },
      {
        "name": "Jan Eivind Stillingen",
        "biography": "Jan Eivind jobber som seniorkonsulent hos Know IT Objectnet. Han har 15 års erfaring med ulike teknologier, og har de siste 8 årene jobbet som arkitekt og utvikler i prosjekter med Java som plattform. Dette har gitt han bred erfaring innen J2EE (EJB2.0/3.0, JSP, WebServices), Spring, Hibernate, JPA og Swing."
      }
    ],
    "year": 2009
  },
  {
    "title": "Arkitektur for Pensjonister",
    "level": "advanced",
    "intendedAudience": "Primært tekniske arkitekter som helt sikkert vil kjenne seg igjen i og ha nytte av erfaringene som presenteres, men også andre som ønsker å vite mer om arkitekturens rolle i et stort Java prosjekt. Pensjonister er spesielt velkomne!",
    "summary": "Foredraget vil ta for seg erfaringer knyttet til Java arkitekturen som ble etablert for NAV Pensjonsprosjektet, et av de største Java prosjektene i Norge. Fokus vil ikke være på presentasjon av selve arkitekturen, men heller et utvalg av subjektive erfaringer som er gjort før, under og etter at arkitekturen ble tatt i bruk.",
    "description": "Pensjonsprosjektet i NAV har sannsynligvis vært det største Javaprosjektet som har foregått i Norge i de senere år. Flere hundre personer har vært involvert, bl.a. Javautviklere fra flere store konsulenthus. Foredraget vil ta for seg erfaringer knyttet til Java arkitekturen som ble etablert for dette prosjektet. I et prosjekt av denne størrelsen møter man på mengder av utfordringer og forventninger til arkitekturrollen fra ulike hold. Hvordan går man fram for å etablere en Java arkitektur, hva skjer typisk når arkitekturen tas i bruk, og hvilke erfaringer står man igjen med etter at prosjektet er levert. Fokus vil være på et utvalg av subjektive erfaringer sett fra innsiden fra en arkitekts perspektiv. Av temaer som omhandles kan nevnes tyvstarting, bygging av jernbaner og skip, UML - Unknown Modelling Language, De fordømte sjekklistene, White Tower arkitekter, Nei-generaler, Zen og kunsten å vedlikeholde en arkitektur, Lucky Luke og Don Quijote.",
    "keyWords": [
      "Experience Reports",
      "Architecture and Design",
      "Enterprise Architecture and Integration",
      "Java Frameworks"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Kjetil Kristiansen",
        "biography": "Kjetil Kristiansen er utdannet siv.ing fra NTNU, og er Senior Technology Architect i Accenture. Han har over 10 års erfaring fra større utviklingsprosjekter basert på Java, hovedsaklig som teknisk arkitekt/teknisk prosjektleder. Kjetil har de siste årene vært leder for applikasjonsarkitekturgruppen i NAV Pensjonsprosjektet, et av de største IT-prosjektene som har vært gjennomført i Norge, hvor han har vært ansvarlig for å etablere og vedlikeholde Java arkitekturen i prosjektet."
      }
    ],
    "year": 2009
  },
  {
    "title": "Scrum-teknikker i ikke-utviklingsprosjekter",
    "level": "beginner",
    "intendedAudience": "Everyone",
    "summary": "Erfaringsrapport fra hvordan teknikker fra Scrum kan fungere i ikke-utviklingsprosjekter.",
    "description": "Scrum er primært rettet mot programvareutviklingsprosjekter. Men metodikken er egentlig en samling av generelle teknikker for samarbeid i team. Mange av teknikkene fungerer derfor godt i ikke-utviklingsprosjekter, f.eks utredninger, kravspesifisering og andre aktiviteter. Det viser seg at bruk av tavle med ”user stories” og aktivitetslapper fungerer bra for å måle progresjon og holde fokus på oppgavene man ønsker å gjøre i neste periode. Derimot kan det være problematisk å vite hvordan man definerer ”user stories” som ferdige da de ofter løper over flere iterasjoner, og mange oppgaver avhenger av arbeid som skal gjøres av andre. I presentasjonen vil jeg drøfte disse problemstillingene og gi flere eksempler på hva som fungerer og ikke fungerer, fra et prosjekt hvor vi gjør IT-arkitekturbistand og SOA-governance utvikling.",
    "room": "Lyntale",
    "keyWords": [
      "Agile and Software Engineering"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Mario Aparicio",
        "biography": "Mario is an experienced developer and architect currently working with SOA, integration and IT-architecture at CIBER Norway. Ciber is an acknowledged consulting company, delivering mission critical solutions with strong focus on Java, and related technologies. Mario holds a Master of Computer Science from Norwegian University of Science and Technology. His main interests are SOA Governance, Enterprice Architecture, Scrum and software development on the Java platform."
      }
    ],
    "year": 2009
  },
  {
    "title": "Cplusplus, Java and .NET: Lessons learned from the Internet Age, and What it Means for the Cloud and Emerging Languages",
    "level": "beginner",
    "summary": "This presentation will provide a retrospective of the trade-offs compared to C++ illustrated by Java, C# and other VM-based programming languages with Garbage-Collection, why scripting languages simultaneously thrived, and what this teaches us about the applicability of technology to emerging challenges and environments.",
    "description": "Java’s appearance at the dawn of the Internet Age helped to propel it to near-instant prominence, and lodged cross-platform virtual machines and garbage-collection firmly into our mainstream consciousness. In Java’s wake, .NET introduced the concept of the “cross-language” virtual machine, and helped to foster a new discussion on the benefits of functional programming. Did Java and C# have an evolutionary advantage over C++, or were they simply “Cool” (the original code name for C# / .NET)? In retrospect, what were the actual efficiency advantages provided by each language? And despite the grip that these languages exerted on “enterprise” applications, how did scripting languages such as PHP, Python and Perl manage to thrive and multiply? Looking forward, what do these lessons teach us about the applicability of technology to emerging challenges and environments such as Cloud Computing, and what languages are rising to the top as a result?",
    "keyWords": [
      "Core Java",
      "Alternative Languages",
      "Experience Reports"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Cameron Purdy",
        "biography": "Cameron Purdy is Vice President of Development at Oracle. Prior to joining Oracle, Mr. Purdy was the CEO of Tangosol, whose revolutionary Coherence Data Grid product provides reliable and scalable data management across the enterprise. Mr. Purdy has over ten years of experience with Javaô and Java-related technology. As a software visionary and industry leader, Mr. Purdy is a frequent presenter at industry conferences and has received a number of awards in recognition of his contribution to the Java community, including twice being named as a JavaOne RockStar and being recognized in TheServerSideís ìWhoís Who in Enterprise Javaî. He regularly participates in industry standards development and is a specification lead for the Java Community Process."
      }
    ],
    "year": 2009
  },
  {
    "title": "JDK7: What the Future Holds For Java",
    "level": "intermediate",
    "intendedAudience": "People interested in what the next version of the Java Standard Edition will contain.",
    "summary": "Find out what will be in the next release of the JDK, coming in early 2010.",
    "description": "The next release of the Java Standard Edition is scheduled for the beginning of 2010. In this session we'll review the latest feature list of what's in and what's out of the next version of the JDK. The big areas being covered are: * Modularisation of the JDK: Project Jigsaw * Small language changes: Project Coin * Dynamic language support on the JVM: The Da Vinci Machine Project",
    "keyWords": [
      "Core Java"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Simon Ritter",
        "biography": "Simon Ritter is a Technology Evangelist at Sun Microsystems. Simon has been in the IT business since 1984 and holds a Bachelor of Science degree in Physics from Brunel University in the U.K. Originally working in the area of UNIX development for AT&T UNIX System Labs and then Novell, Simon moved to Sun in 1996. At this time he started working with Java technology and has spent time working both in Java technology development and consultancy. He now specialises in looking at emerging technologies including cloud computing, wireless sensor networks and gestural interfaces."
      }
    ],
    "year": 2009
  },
  {
    "title": "Høy ytelse med store datamengder i Java",
    "level": "beginner",
    "intendedAudience": "Foredraget passer for alle som ønsker tips til hvordan de kan skrive kode som kjører raskere.",
    "summary": "Har du høye krav til ytelse? Dette foredraget viser deg hvordan du kan gjøre koden din raskere.",
    "description": "De fleste Javautviklere er i sin daglige jobb ikke spesielt opptatt av ytelse. Vi flytter stor sett data fra en database til en annen og er fornøyd hvis tallene stemmer. Men større datamengder og høyere krav til responstid har de siste årene gjort ytelse til et stadig viktigere tema. Dette foredraget viser konkrete eksempler på ytelsesforbedringer i en Java-applikasjon som tilbyr søk og analyse i store datamengder. Applikasjonen skal gjennom et webgrensesnitt levere beregninger i sanntid og dette stiller høye krav til ytelse. Gjennom stegvise optimaliseringer viser vi hvordan utregninger som først tok minutter endte opp med å ta millisekunder. For å få til dette måtte vi bruke ekstremt effektive datastrukturer, forstå hvordan Java allokerer minne, hvordan moderne CPU-arkitekturer fungerer, og ikke minst bruke noen lure triks der det trengs. Foredraget viser også ytelseforebedringer i HTML, CSS og Javascript, et område som blir stadig viktigere i ytelsessammenheng.",
    "keyWords": [
      "Enterprise Architecture and Integration",
      "Core Java",
      "Tools and Techniques"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Eirik Bjørsnøs",
        "biography": "Eirik Bjørsnøs jobber som Chief Scientist hos Kantega i Trondheim. Der prøver han å finne teknologier og teknikker som kan hjelpe Kantegas utviklere til å jobbe bedre. Når han ikke jobber for Kantega utvikler Eirik SVNSearch, et endringsanalyseverktøy for versjonskontroll. Eirik har tidligere holdt foredrag på JavaZone og Smidig."
      }
    ],
    "year": 2009
  },
  {
    "title": "OAuth or how to keep your mashed up data secure",
    "level": "intermediate",
    "intendedAudience": "Software developers and system architects",
    "summary": "In this lightning talk I will present OAuth, an open protocol to allow secure API authorization in a simple and standard method from desktop and web applications.",
    "description": "After this lightning talk the listener will have a basic understanding of what OAuth is and how it can be used to secure mashed up data.",
    "room": "Lyntale",
    "keyWords": [
      "Architecture and Design",
      "Web as a Platform"
    ],
    "language": "en",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Stefan Landrø",
        "biography": "Stefan Magnus Landrø works as a manager at Bekk Consulting, and spends his free time playing around with open source libraries and in particular the ruby on rails framework."
      }
    ],
    "year": 2009
  },
  {
    "title": "Domain Driven Design in the Enterprise and the hardship of API design",
    "level": "intermediate",
    "intendedAudience": "Architects and developers.",
    "summary": "Domain driven design, the importance of good API's in a service oriented architecture.",
    "description": "StatoilHydro has practiciezed Domain Driven Design since 2004, and over these years we have experienced that some things are more difficult than others, some things more demanding than others and some things more valuable than others. There are two things that stands out in this context, the value of the ubiquitous language, and the hardship of API design. The importance of good API design are not though in school, and not much is written. On the other hand, good API's is the foundation of good software, and with SOA it become even more important. In this talk we will share our experience from designing and integrating some of our largest software systems where Domain Driven Design has been successfully applied. Examples of successful and not so successful APIs will be provided.",
    "keyWords": [
      "Domain-driven design",
      "Architecture and Design",
      "Enterprise Architecture and Integration"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Einar Landre",
        "biography": "Einar Landre is a practicing software professional with 25 years’ experience as a developer, architect, manager, consultant, and author/presenter. Currently for StatoilHydro's Business Application Services, he engages in business critical application development, architecture reviews and software process improvement activities, specializing in SOA, Domain Driven Design, use of Multi-Agents and design of large scale networked software intensive systems. Before joining StatoilHydro, Mr. Landre has been consultant and department manager with Norwegian Bouvet, Development manager of TeamWide, technical adviser with Skrivervik Data (SUN & CISCO distributor) and finally software developer with Norsk Data where he implemented communication protocols, operating systems and test software for the space station. Over the last years Mr. Landre has become an active member of the professional community, where he has been author and coauthor of several papers presented at OOPSLA and SPE. He has presented at several international conferences in Europe and the US. His professional interests include object oriented programming, enterprise application architecture, multi-agents, autonomous systems design, requirements analysis and specification, use of systems engineering practices, agile methodologies and leadership in high-tech organizations. He is a member of the ACM and the IEEE Computer Society, as well as the SPE (Society Petroleum Engineers). Mr. Landre holds a MSc in Information Technology from the University of Strathclyde, is an IEEE certified software development professional (CSDP) and lives with his family in Stavanger, Norway."
      }
    ],
    "year": 2009
  },
  {
    "title": "Agile Specification Quality Control: How to do inspections on any kinds of IT Development outputs for measurement of major defects",
    "level": "intermediate",
    "intendedAudience": "People interested in software quality, quality control, static testing (aka Inspection), possibly 'testers', project managers, people interested in the front end (requirements and design), people interested in development processes.",
    "summary": "* The most powerful way to prevent bugs in code delivered to testing, is to both detect them earlier and prevent them being injected * Software Inspections are proven capable of doing these things effectively, but the traditional costs are inhibiting * Agile Specification QC solves this problem by focussing on defect measurement by sampling, and strict numeric process exit.",
    "description": "Traditional Software Inspection is often uneconomic and ties up valuable staff resources. Shifting the emphasis from cleanup (that is, from identifying defects and then removing them), to merely sampling the defect level of specifications, produces significant benefits. It enables the quality level of specifications to be determined more rapidly. Consequently, the QC can be carried out more frequently. Systems and software engineers rapidly learn, through SQC feedback, to take standards seriously, which in turn reduces defect injection. Further, by analyzing where/how the defects occur continuous process improvement can be supported.",
    "keyWords": [
      "Agile and Software Engineering",
      "Experience Reports"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Tom Gilb",
        "biography": "\"Tom Gilb is a freelance consultant, teacher and author serving clients mainly in Europe and the US. He has 3 books in print: “Competitive Engineering” (2005, one chapter on SQC), “Principles of Software Engineering Management” (chapters on Inspection, 1988 !, 20th printing) and “Software Inspection” (1993, Japanese translation). Tom Gilb specializes in software engineering, systems engineering, and technical management. He resides in Oslo and London. His most recent papers, book manuscripts, and slides are available on www.gilb.com Tom was an early professional colleague, supporter, and inspection-pupil (1974-5) of Michael Fagan (Tom wrote over 80 pages about Inspection in his 1976 Software metrics book), and a consultant to Ron Radice (1980, inventor of CMM and co-inventor with Fagan of Inspection, author of \"High Quality Low Cost Software Inspections\"), and Tom was the first to preach and teach inspections outside of IBM, in Norway and many other countries. He developed his own version of Software Inspection (about 400 process changes compared to Fagan's version) and documented this (with co-author Dorothy Graham) in the worlds first published book on Inspection (Software Inspection 1993, now in 14th printing). The book also includes 2 chapters on the Defect Prevention Process (aka CMMI Level 5) and many guest chapter case studies. By 2003 he had developed and practiced an Agile version Inspection, renaming it Agile Specification Quality Control (SQC). In September 2008 he and Kai were invited by JUSE (Japanese Union of Scientists and Engineers) to Keynote their annual software conference on Inspections, and to present a one day tutorial on the subject. They also were invited to work with Hitachi Software, and Sony Corporation. Sony is currently spreading the Agile SQC within Sony and to many other Japanese Corporations. In 1989-90 Tom successfully spread the method to aircraft engineering design at Douglas and Boeing, with large scale adoption and detailed study and proof of effectiveness. From 1988 Tom and Kai spread his Inspection method to Hewlett Packard HP Corporate and worldwide, with well-documented savings in books and papers by HP (Robert Grady)."
      },
      {
        "name": "Kai Thomas Gilb",
        "biography": "Kai works in partnership with Tom, teaching, running workshops, consulting, starting up projects, saving projects, solving problems, lecturing, writing books and articles, course & lecture materials etc. Kai has been teaching and helping clients practice Inspections and Agile Inspections since about 1990, at major organizations like Ericsson, Nokia HP, and Citigroup (2003) - where he co-invented, with Tom, the current formal process \"Agile Inspections\", with Tom. Our initial client proved on many projects, a reduction of bugs 8 to 1 in 6 months. He most recently co-taught in Japan at JUSE, Sony and Hitachi, and for a few other corporations such as IBM."
      }
    ],
    "year": 2009
  },
  {
    "title": "The Rules of SOA - A Road to a Successful SOA Implementation",
    "level": "intermediate",
    "intendedAudience": "Architects and development teams embarking on an SOA strategy will find this session especially beneficial, as this kind of expert advice is required in order to avoid making the same mistakes that have been made many times in the past. This type of advice can save you months of lost design and development time, and hundreds of thousands of dollars in poorly conceived and executed projects.",
    "summary": "This talk explains the top ten tips seen through the eyes of companies doing a SOA implementation the hard way. Learn the best tips for a SOA rollout and see real world examples for where these tips work and what happens when they aren't adhered to.",
    "description": "You have been handed the keys and a blank slate to build a new services-based architecture. Are you up for the task? Do you have the knowledge, judgment, and combination of hard and soft skills needed to plan, design, and execute a significant SOA project? Implementing a strong and flexible SOA can be a difficult challenge for an experienced architect, let alone someone with less experience. Many complex architecture projects end in failure, or are scaled back so that something can be achieved in a reasonable amount of time. In this session Jeff explores the key characteristics of successful SOA projects. He covers some of the patterns, and anti-patterns, tool sets, and strategies that he himself learned the hard way – through his own trial and error experiences as an architect. Last, he provides a strategy and blueprint for achieving a high likelihood of success in your SOA project. Key session topics include: * How to apply SOA patterns to different classes of problems; * The common failures of a SOA project and how to prevent them; * Architectural strategies that offer the best chance of achieving project success; * And more.",
    "keyWords": [
      "Enterprise Architecture and Integration"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jeff Genender",
        "biography": "Jeff Genender is a Java Open Source consultant specializing in SOA and enterprise service implementations. He is the author of Professional Apache Tomcat 6, Professional Apache Geronimo, and Enterprise Java Servlets, as well as an Apache member and committer on several projects including ServiceMix, CXF, Geronimo, OpenEJB, ServiceMix, Mina, and Open Terracotta. Jeff serves on JSR-316 Java EE6 expert group committee."
      }
    ],
    "year": 2009
  },
  {
    "title": "Hva er Java SE for Embedded og hvordan bruke det på ARM Single Board Computer.",
    "level": "intermediate",
    "intendedAudience": "Utviklere som er nysgjerrige på hvordan en kan bruke java Standard Edition på embedded plattform.",
    "summary": "Hvordan lage java applikasjoner på embedded plattform med Java SE for Embedded på Single Board Computer. * Gjennomgang av Java SE for Embedded. * Introduksjon til JNI. * Oversikt over Single Board Computer. * Demo på EmbeddedArm TS-7800 med web-applikasjon med tilgang til analog og digital IO.",
    "description": "Å skrive applikasjoner for embedded plattform har lenge vært forbeholdt C og C++ utviklere. I dette foredraget vil jeg gi en oversikt over Java SE for Embedded og hvordan en med dette sammen med standard bibliotek kan lage web-applikasjoner på Single Board Computers (SBC). Foredraget vil gi en oversikt over Java SE for Embedded, hvordan dette skiller seg fra J2SE og J2ME samt distribusjon og lisensiering. Jeg vil videre gi en kort introduksjon til Java Native Interface for tilgang til maskinvare og drivere. Det vil også bli gitt en demo på EmbeddedArm TS-7800 SBC. Demoen vil vil gi innblikk i hvordan en fra webapplikasjon på en SBC kan få tilgang til analog og digital IO og demonstrere hvilken ytelse en kan forvente fra en slik applikasjon.",
    "keyWords": [
      "Core Java",
      "Embedded",
      "Mobile and Gaming",
      "Experience Reports"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Kristian Berg",
        "biography": "Kristian Berg er utdannet ved Høgskolen i Bergen og jobber som utvikler for InteliNet AS. Han har mer enn ti års erfaring med utvikling av network management løsninger for telekom industrien. Det siste året har han jobbet med å utvikle styring og overvåking av telekom-systemer på embedded plattform."
      }
    ],
    "year": 2009
  },
  {
    "title": "Constretto - Hvordan bli kvitt unoter i applikasjonens konfigurasjon",
    "level": "intermediate",
    "intendedAudience": "Dette foredraget henvender seg til utviklere, arkitekter og sist men ikke minst driftere av Java applikasjoner.",
    "summary": "En dyp titt på hvordan håndtere kompliserte konfigurasjonsutfordringer i større Java applikasjoner ved hjelp av Constretto.",
    "description": "I dette foredraget vil jeg sette fokus noen av de mer komplekse utfordringene vi kan møte når det gjelder konfigurasjon av større Java applikasjoner. Hvordan skal vi kunne forberede våre applikasjoner for utrulling på et stort antall servere, på et mangfold av operativsystemer, i forskjellige stadier av utviklingsprosjektet. Dette på samme tid som vi ikke ønsker kompliserte installerings- og konfigurasjonsrutiner. For å hjelpe oss med å håndtere disse utfordringene har jeg utviklet Constretto, et rammeverk for avansert konfigurasjonsstyring. Jeg vil ta en dyp titt på hvordan Constretto kan tas i bruk, samt hvilke muligheter som finnes for tilpassing av rammeverket Til slutt vil jeg gå gjennom erfaringene vi fikk med bruk av Constretto i en forsikringsportal for Nemi forsikring. Hvordan vi der fikk et etterhvert meget godt forhold til drifterene.",
    "keyWords": [
      "Java Frameworks",
      "Tools and Techniques"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Kaare Nilsen",
        "biography": "Kaare Nilsen jobber til daglig som sjefskonsulent i Arktekk AS som utvikler og teknisk arkitekt. Han har over 10 års erfaring som programmerer og har lenge fokusert på åpen kildekode produkter, samt lettvekts-arkitektur og containere. Kaare er en velkjent foredragsholder innen mange Java og åpen kildekode emner, og er et aktivt medlem i miljøet rundt Maven."
      }
    ],
    "year": 2009
  },
  {
    "title": "How to avoid rotten data  and remain responsive",
    "level": "intermediate",
    "intendedAudience": "Anyone with an interest for scalable web applications is invited. The goal of my talk is to show how proper cache management can dramatically improve performance. I also give an overview of available products and their performance characteristics.",
    "summary": "Any scalable web application uses object caching, both to reduce database load and to improve response time. But choosing the right cache management product is critical for performance. We have benchmarked several cache setups and give our results here.",
    "description": "“You have twenty server instances running. Available bandwidth is measured in gigabits, and your application’s user interface has been carefully designed to satisfy the high customer expectations. But there is one ugly flaw in this pretty picture: How can the monolithic, centralized database handle the load?” In practice, any scalable web application uses object caching, both to reduce database load and to improve response time. But creating efficient mechanisms for cache management is hard, especially in distributed environments such as clusters or clouds. Important challenges are data freshness, data consistency and fault tolerance. Several products promise to reduce the burden by providing automatic object cache management among distributed servers. Notable examples are Ehcache, memcached and Oracle Coherence. At BEKK, we have studied several such products. Our results indicate that finding the right solution with a proper setup is critical for performance. This talk presents an overview of our experience, including benchmarks.",
    "keyWords": [
      "Experience Reports"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Jon Grov",
        "biography": "Jon Grov is a Manager in Bekk Consulting. He has more than 10 years experience working with enterprise systems and open-source software, both as developer and manager. From 2004 to 2007, Jon was employed as researcher and lecturer by the Department of Informatics, University of Oslo. His work focused on scalability, data replication and transaction processing. In 2006, he worked on the EU-funded project GORDA as visiting researcher at the Distributed Systems Group in the University of Minho, Portugal. The goal of this project was to characterize and improve existing solutions for transaction processing in replicated databases."
      }
    ],
    "year": 2009
  },
  {
    "title": "Git og Github",
    "level": "beginner",
    "intendedAudience": "Utviklere som er lei av SVN og vil bruke noe som er litt mindre smertefullt.",
    "summary": "Git er et distribuert versjonskontroll system. Github er gratis git repository med mye snacks!",
    "description": "Bruker du SVN enda? Lei av at ingenting funker når repositoriet ditt går ned? Lei av at det er tungt å branche? Lei av ikke å kunne gjøre lokale endringer? Sjekk ut git. Det løser disse problemene for deg. Bruk github for å komme enkelt igang.",
    "room": "Lyntale",
    "keyWords": [
      "Tools and Techniques"
    ],
    "language": "no",
    "format": "lightning-talk",
    "speakers": [
      {
        "name": "Bjarte Stien Karlsen",
        "biography": "Utvilker som liker å holde meg oppdatert innen nye språk, teknikker og utviklings metodikker. Hatt fulgt scala miljøet i 1.5 år. Har utvikler applikasjoner i lift blandt annet scala.java.no. Har også i den siste tiden begynt å bruke git til personlige prosjekter. Bloggen min er blandt annet på github pages."
      }
    ],
    "year": 2009
  },
  {
    "title": "Ditch your complex clients: become RESTful",
    "level": "advanced",
    "intendedAudience": "Architects who are designing HTTP based APIs, and developers that are consuming such APIs. You think you have some knowledge of REST.",
    "summary": "This presentation will outline how Escenic went from an RPC based approach to a RESTful webservice. The presentation will cover the design of both the web service and the client. We will list lessons learned through the project and how these lessons have affected the end result.",
    "description": "This presentation will outline how Escenic went from an RPC based approach to a RESTful webservice. The presentation will cover the design of both the web service and the client. We will list lessons learned through the project and how these lessons have affected the end result. You will not NOT learn anything about the jungle of RESTful frameworks, as they are only tools to get the job done. You will learn the principles of REST and how it affects client side programmers. The focus will be on how to build the server and client correctly according to the principles behind REST, and not misuse the term as Flickr, SocialSite and Amazon do. RESTful HTTP is more than just using HTTP: it is identifying resources using URIs, exposing relationships between resources, and manipulating resources using the semantics of HTTP verbs. It also means designing resources to fit the constraints, based on nouns (and sometimes verbs) of the domain",
    "keyWords": [
      "Experience Reports",
      "Architecture and Design",
      "Web as a Platform"
    ],
    "language": "en",
    "format": "presentation",
    "speakers": [
      {
        "name": "Erlend Hamnaberg",
        "biography": "Systems developer at Escenic AS. He has worked at Escenic for two years and has worked with both RESTful server and client applications. His technical interests revolve around HTTP, REST, Dependency Injection, database abstractions, Swing, Java and Scala. In his spare time he is a member of the the JavaZone conference program comitee and he is also the lead developer and architect behind the open source HTTP-cache library HTTPCache4j."
      },
      {
        "name": "Erik Mogensen",
        "biography": "Chief Architect at Escenic AS. He has worked at Escenic for nine years and has worked with the server and client software all this time. He introduced REST to the company in 2004 and has designed most of the company's RESTful applications."
      }
    ],
    "year": 2009
  },
  {
    "title": "Trykk play for ny versjon!",
    "level": "intermediate",
    "intendedAudience": "Utviklere som er kjent med automatisert testing og kontinuerlig integrasjon og som ønsker å se hvordan man kan ta det siste skrittet for å helautomatisere. Testere som ønsker å ha full kontroll på når neste versjon kommer, og som vil ha latest-and-greatest kun ved å trykke på play-knappen i en web-applikasjon.",
    "summary": "Automatisering gjort riktig, intet mindre. Eller hvordan fullføre det siste skrittet som ivaretar (ikke bare) utviklernes krav, drifternes, testernes og prosjektledelsens. Foredraget er basert på praktisk erfaring i prosjekter.",
    "description": "Smidig utvikling er noe som de aller fleste organisasjoner holder på med, men det begrenser seg typisk til planlegging, rapportering og utvikling. Vi som er utviklere ønsker å bruke minst mulig tid på oppgaver som tar bort fokuset fra utvikling. Testerne ønsker å kunne få en ny versjon av applikasjonen vår så fort som mulig og ikke minst akkurat når de ønsker det selv. Drifterne ønsker at de binære artefaktene som rulles ut i produksjon er identiske med dem vi har benyttet i utviklernære miljøer og i systemtest. Alle har fått til automatisert bygging og kanskje testing. Flere og flere har fått til periodisk deployment av applikasjoner. Hvorfor stoppe her? Det vi trenger er et komplett regime for automatisert deployment og utrulling, der de samme binære pakkene brukes i alle miljøer, også produksjon. Vi vil spille på lag med operativsystemets egne pakker og versjonsstyring og vi ønsker full fleksibilitet for å rulle opp og ned mellom ulike versjoner. For at en prosjektgruppe skal kunne fungere og for at produksjonssettingen skal være knirkefri, er vi avhengig av at alle ledd fungerer sammen. Dette foredraget er en praktisk innføring til hvordan vi tar det siste steget - og ikke minst hvordan vi plasserer oss selv øverst på skrytelisten til testerne og samtidig blir drifternes gullunger. Testerne vil elske oss fordi vi kan levere så raskt, mens drifterne vil sette stor pris på enkle rutiner uten unødvendige manuelle steg. Dessuten får de ikke testerne på nakken fordi alt bare fungerer! Foredraget er basert på praktisk erfaring i utviklingsprosjekter.",
    "keyWords": [
      "Experience Reports",
      "Tools and Techniques"
    ],
    "language": "no",
    "format": "presentation",
    "speakers": [
      {
        "name": "Kristoffer Moum",
        "biography": "Kristoffer Moum er sjefskonsulent i Arktekk og jobber som utvikler, kursholder, scrum-master og teknisk arkitekt. Han har åtte års erfaring med utvikling av Java-løsninger. I tilegg har han ramlet innom stort sett det som finnes av produkter for kontinuerlig bygging og vet hva som virker. Kristoffer arbeider for tiden i et prosjekt hvis produkt shippes ferdig kjørbart nærmest per commit av kildekode."
      }
    ],
    "year": 2009
  }
]
